{
  "pmid": "37634105",
  "title": "SOTYKTUTM (Deucravacitinib 6-mg Tablets)- A New Agent for the Management of Adult Plaque Psoriasis.",
  "abstract": "SOTYKTUTM (deucravacitinib) is a newly approved oral agent for managing moderate to severe plaque psoriasis in adults who are candidates for systemic therapy or phototherapy. Deucravacitinib is a highly selective allosteric tyrosine kinase 2 inhibitor targeting dysregulated cytokine responses in psoriasis patients. Its efficacy was demonstrated in two randomized, placebo- and active comparator-controlled phase 3 trials, where a significantly higher proportion of patients, up to 58.4% (194/332), achieved lessening of symptoms at week 16. The recommended dosing regimen of deucravacitinib is 6 mg once daily. More frequent adverse reactions occurring in the deucravacitinib-treated patients include upper respiratory infection (19.2% [161/840]), increase in blood creatine phosphokinase (2.7% [23/840]), herpes simplex infection (2.0% [17/840]), mouth ulcers (1.9% [16/840]), folliculitis (1.7% [14/840]), and acne (1.4% [12/840]). Continuance of treatment for up to week 52 did not increase the exposure-adjusted rates of adverse reactions. The selectivity and specificity of deucravacitinib treatment may improve its long-term safety profile, compared to other Janus kinase inhibitors.",
  "pub_date": "2023-08-28",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Division of Dermatology, Department of Medicine, University of Toronto School of Medicine, Toronto, Ontario, Canada.",
    "Mediprobe Research Inc., London, Ontario, Canada; agupta@mediproberesearch.com.",
    "Mediprobe Research Inc., London, Ontario, Canada.",
    "Private Practice Sevierville, TN.",
    "University of Texas at Southwestern Medical School, Dallas, TX.",
    "Dermatology Treatment and Research Center, Dallas, TX."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37634105/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}