{
  "pmid": "38607726",
  "title": "Reappraising the Use of Systemic Immunomodulators for Psoriasis and Eczema in the Military.",
  "abstract": "Psoriasis and atopic dermatitis are chronic, immune-mediated skin disorders that are disqualifying for entrance into the military. Both conditions can cause difficulty wearing body armor and other protective equipment when poorly controlled, limiting a service member's ability to train and deploy worldwide. In addition, these conditions may be exacerbated by military service because of increased exposure to austere environments, extreme temperatures, stress, skin injury, bug bites, and vaccinations Service members have limited treatment options because of restrictions on systemic medications that can be used while deployed. Newer systemic medications-in particular, biologics and oral immunomodulators-have evolved to be both extremely effective and safe. We review more recent treatment options for psoriasis and atopic dermatitis in the context of DoD's regulations guiding entry and retention of personnel with psoriasis and eczema and make recommendations regarding updating DoD policy for systemic treatment options.\nA literature search was performed using PubMed, Embase, and Ovid with the last search done in the fall of 2023 from all years to date. These articles were further screened based on inclusion and exclusion criteria. In total, 25 articles were included in this review. An Internet search was also performed on the DoD's regulations guiding entry and retention of personnel with psoriasis and eczema. In addition, we examined medical requirements for deployment to the U.S. Central Command and U.S. European Command.\nCurrently, U.S. Central Command and U.S. European Command do not allow the use of medications with special storage and handling requirements on deployments. Newer biologics are safe and efficacious but require refrigeration, although other immunomodulators like deucravacitinib and apremilast are oral pills and do not have cold-storage requirements. However, the use of biologics in austere environments may be feasible because of increased intervals between dosing and the ability to store refrigerated medical supplies in most deployed environments. For military service members with psoriasis, risankizumab and deucravacitinib are excellent options given their favorable safety and efficacy profiles. Of the biologics available for atopic dermatitis, dupilumab is the safest and effective systemic medication available. The Janus kinase inhibitors have also demonstrated excellent efficacy in treating atopic dermatitis, but more safety data are needed because of potential adverse events to include heart-related events, blood clots, and cancers.\nSystemic treatments have evolved to become highly specific for both eczema and psoriasis. These newer biologics and immunomodulators may be compatible with use in the deployed setting, especially those that have long dosing intervals and proven efficacy and safety. Of the biologics, dupilumab and risankizumab offer the best efficacy, safety, and dosing intervals for atopic dermatitis and psoriasis, respectively. Deucravcitinib is a recently FDA-approved oral immunomodulator for psoriasis that has an excellent safety profile and efficacy. Allowing the use of these medications on deployments will enable more people with moderate to severe psoriasis and eczema to join and remain in the military while receiving effective treatment.",
  "pub_date": "2024-11-05",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "School of Medicine, Uniformed Services University of the Health Sciences, Bethesda, MD 20814, USA.",
    "School of Medicine, Uniformed Services University of the Health Sciences, Bethesda, MD 20814, USA.",
    "Department of Dermatology, William Beaumont Army Medical Center, El Paso, TX 48073, USA.",
    "Department of Dermatology, Uniformed Services University of the Health Sciences, Bethesda, MD 20814, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38607726/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}