{
  "pmid": "38907877",
  "title": "Cumulative Benefit Over 52 Weeks With Deucravacitinib Versus Apremilast in Moderate to Severe Plaque Psoriasis: POETYK PSO-1 Post Hoc Analysis.",
  "abstract": "Deucravacitinib demonstrated superior efficacy to apremilast in patients with moderate to severe plaque psoriasis in the POETYK PSO-1 and PSO-2 clinical trials. In the study reported here, we aimed to determine the overall 52-week cumulative clinical benefit of treatment initiated with deucravacitinib versus apremilast and to compare the 52-week cumulative benefit of initiating and staying on deucravacitinib versus initiating apremilast and continuing or switching to deucravacitinib at week 24 of treatment.\nThis post hoc analysis of POETYK PSO-1 data (ClinicalTrials.gov identifier: NCT03624127) determined the cumulative clinical benefit of deucravacitinib 6 mg once daily and apremilast 30 mg twice daily in adults with moderate to severe plaque psoriasis. Patients treated with apremilast who did not achieve a 50% reduction in the Psoriasis Area and Severity Index (PASI 50) at week 24 were switched to deucravacitinib. The cumulative clinical benefit of deucravacitinib versus apremilast over 52 weeks was based on cumulative measures of ≥ 75% improvement from baseline in PASI score (PASI 75) and the proportion of patients with a static Physician Global Assessment score of 0 or 1 (sPGA 0/1). Ratios of area under the curve estimates between treatments were calculated and compared based on analysis of covariance regression models.\nPatients initiating deucravacitinib (N = 332) had a greater cumulative benefit as measured by the PASI 75 and sPGA 0/1 than those initiating apremilast (N = 168). Over 52 weeks, those initiating deucravacitinib experienced 50% more benefit as measured by PASI 75 and 58% more benefit as measured by sPGA 0/1 than those initiating apremilast. Results were consistent with the primary analysis when patients were classified by prior systemic and prior biologic therapy exposure.\nResults from this analysis corroborate the primary efficacy analysis supporting the use of deucravacitinib compared with apremilast for moderate to severe plaque psoriasis, regardless of prior systemic or biologic use.",
  "pub_date": "2024-06-22",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Keck School of Medicine, University of Southern California, Los Angeles, CA, USA.",
    "University of California Los Angeles, Los Angeles, CA, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA. vardhaman.patel@bms.com.",
    "Bristol Myers Squibb, Boudry, Switzerland.",
    "OPEN Health Evidence & Access, Hingham, MA, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "OPEN Health Evidence & Access, Hingham, MA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38907877/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}