{
  "pmid": "39093663",
  "title": "Selective Tyrosine Kinase 2 (TYK2) Inhibition in Plaque Psoriasis.",
  "abstract": "Members of the Janus kinase (JAK) superfamily, comprising tyrosine kinase 2 (TYK2) and JAK1, JAK2, and JAK3, mediate signaling by cytokines (eg, interleukin [IL]-23) involved in psoriasis pathogenesis. Binding of IL-23 to its receptor activates TYK2 and JAK2, which trigger signal transducer and activator of transcription (STAT) translocation to the nucleus to regulate target gene transcription, including genes of proinflammatory mediators such as IL-17. Physiologically, TYK2 solely mediates immune function, whereas JAK1,2,3 mediate broad systemic and immune functions. Inhibition of individual JAK family members is being evaluated in many dermatologic indications, including psoriasis. Selective TYK2 inhibition is therefore expected to be associated with few adverse effects in patients with psoriasis. People with genetic mutations leading to loss of function of TYK2 are protected from the development of psoriasis without an increased risk of infections or malignancies. In contrast, treatments with JAK1,2,3 inhibitors are associated with various systemic effects. We review the unique allosteric mechanism of action of the selective TYK2 inhibitor, deucravacitinib, which binds to the TYK2 regulatory (pseudokinase) domain, and the mechanisms of action of JAK1,2,3 inhibitors, which bind to the adenosine 5'-triphosphate-binding active (catalytic) site in the kinase domains of JAK1,2,3. Deucravacitinib, which is approved for the treatment of moderate to severe plaque psoriasis in adults in the United States and several other countries, represents a novel, targeted systemic treatment approach with a favorable safety profile. J Drugs Dermatol. 2024;23(8):645-652.&nbsp; doi:10.36849/JDD.8293.",
  "pub_date": "2024-08-01",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39093663/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}