{
  "pmid": "39423145",
  "title": "Deucravacitinib, a selective, TYK2 inhibitor, in psoriatic arthritis: achievement of minimal disease activity components in a phase 2 trial.",
  "abstract": "Deucravacitinib is a novel, oral, selective, allosteric tyrosine kinase 2 (TYK2) inhibitor belonging to a distinct class of enzyme inhibitors. In a phase 2 trial in psoriatic arthritis (NCT03881059), deucravacitinib was significantly more efficacious than placebo across multiple endpoints, including achieving minimal disease activity (MDA). This post hoc analysis further evaluated the achievement of individual components of the MDA criteria with deucravacitinib treatment and the time course of responses in the phase 2 trial.\nPatients (N = 203) were randomized 1:1:1 to once daily treatment with placebo, deucravacitinib 6 mg or deucravacitinib 12 mg. The proportions of patients achieving MDA and each of the seven individual MDA components through week 16 were assessed.\nAt baseline, although some patients met criteria for individual MDA components, none of the patients met the composite MDA criterion, and all components were balanced overall across treatment arms. Treatment with deucravacitinib was associated with a numerically greater mean reduction from baseline in all MDA components vs placebo over 16 weeks of treatment. At week 16, a greater percentage of patients treated with either dose of deucravacitinib vs placebo achieved the threshold criteria for meeting MDA in each of the components.\nMore patients treated with deucravacitinib met each of the MDA components vs placebo, along with a higher rate of MDA response, after 16 weeks of treatment.",
  "pub_date": "2025-05-01",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase II",
    "Multicenter Study"
  ],
  "affiliations": [
    "Department of Medicine, University of California, San Diego, School of Medicine, La Jolla, CA, USA.",
    "Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences, University of Oxford, Oxford, UK.",
    "Department of Rheumatology, Swedish Medical Center/Providence St Joseph Health and University of Washington, Seattle, WA, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Department of Dermatology and Department of Medicine, Division of Rheumatology, UT Southwestern Medical Center, Dallas, TX, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39423145/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}