{
  "pmid": "39602111",
  "title": "Safety and Efficacy of Deucravacitinib in Moderate to Severe Plaque Psoriasis for Up to 3 Years: An Open-Label Extension of Randomized Clinical Trials.",
  "abstract": "Safe and effective long-term treatments for moderate to severe plaque psoriasis are needed.\nTo evaluate the long-term safety and efficacy of deucravacitinib through 3 years (week 148) in the randomized POETYK PSO-1, PSO-2, and nonrandomized long-term extension (LTE) trials.\nPSO-1/PSO-2 were global, 52-week, randomized, double-blinded phase 3 trials in patients with moderate to severe plaque psoriasis. After completing 52 weeks of treatment in PSO-1/PSO-2, patients could enroll in the prespecified, ongoing, nonrandomized LTE trial. The peak of the global COVID-19 pandemic coincided with the LTE trial. Patient enrollment in the LTE started August 12, 2019; safety and efficacy were assessed through June 15, 2022; and these data were analyzed through June 28, 2024.\nThe PSO-1/PSO-2 trials randomized patients 1:2:1 to oral placebo, deucravacitinib, 6 mg once daily, or apremilast, 30 mg twice daily. Patients enrolling in the LTE trial received open-label deucravacitinib, 6 mg once daily.\nSafety outcomes were evaluated in patients who received 1 or more doses of deucravacitinib. Efficacy outcomes included 75% or greater or 90% or greater reduction from baseline in Psoriasis Area and Severity Index (PASI 75/90) and static Physician Global Assessment scores of 0 (clear) or 1 (almost clear) (sPGA 0/1) and were assessed in patients who received deucravacitinib treatment from day 1 of the parent trials who continued in the LTE trial.\nOf 1519 patients who received 1 or more doses of deucravacitinib, 513 received continuous deucravacitinib treatment from day 1 and entered the LTE trial. Exposure-adjusted incidence rates (EAIRs) per 100 person-years were decreased or similar in the 1-year vs 3-year cumulative periods, respectively, for adverse events (AEs) (229.2 vs 144.8; 95% CI, 215.4-243.9 vs 137.1-153.0), serious AEs (5.7 vs 5.5; 95% CI, 4.4-7.4 vs 4.7-6.4), discontinuations due to AEs (4.4 vs 2.4; 95% CI, 3.3-5.9 vs 2.0-3.0), and deaths (0.2 vs 0.3; 95% CI, 0.1-0.8 vs 0.2-0.6). Incidence rates of the most common AEs (EAIR per 100 person-years ≥5) during the 1-year and 3-year cumulative periods, respectively, were nasopharyngitis (26.1 vs 11.4; 95% CI, 23.0-29.8 vs 10.2-12.7), COVID-19 (0.5 vs 8.0; 95% CI, 0.2-1.2 vs 7.1-9.1), and upper respiratory tract infection (13.4 vs 6.2; 95% CI, 11.3-16.0 vs 5.4-7.2). EAIRs for AEs of interest, including herpes zoster, major adverse cardiovascular events, and malignant diseases, remained low and were decreased or comparable between the 1-year and 3-year cumulative periods. Clinical response rates were maintained through 3 years.\nThe findings of this integrated analysis of the phase 3 POETYK PSO-1, PSO-2, and nonrandomized LTE trials demonstrate a consistent safety profile and durable clinical response of continuous treatment with deucravacitinib through 3 years of treatment in patients with psoriasis.\nClinicalTrials.gov Identifiers: NCT03624127, NCT03611751, and NCT04036435.",
  "pub_date": "2025-01-01",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase III"
  ],
  "affiliations": [
    "Division of Dermatology, University of California Los Angeles David Geffen School of Medicine, Los Angeles.",
    "Kimberly and Eric J. Waldman Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust, Manchester, United Kingdom.",
    "NIHR Manchester Biomedical Research Centre, Manchester University NHS Foundation Trust, Manchester Academic Health Science Centre, Manchester, United Kingdom.",
    "Division of Dermatology, University of California Los Angeles David Geffen School of Medicine, Los Angeles.",
    "Dermatology Research Associates, Los Angeles, California.",
    "Faculty of Medicine, Fukuoka University Hospital, Fukuoka, Japan.",
    "Department of Dermatology, Jichi Medical University, Tochigi, Japan.",
    "Veracity Clinical Research and Probity Medical Research, Brisbane, Queensland, Australia.",
    "Department of Dermatology, Université Côte d'Azur, and Department of Dermatology, University Hospital of Nice, Nice, France.",
    "Alliance Clinical Trials and Probity Medical Research, Waterloo, and the Department of Dermatology, University of Toronto School of Medicine, Toronto, Ontario, Canada.",
    "WW Medical Immunology, Bristol Myers Squibb, Princeton, New Jersey.",
    "Immunology Drug Development, Bristol Myers Squibb, Princeton, New Jersey.",
    "Immunology, Cardiovascular, and Neuroscience (ICN) Clinical Development, Bristol Myers Squibb, Princeton, New Jersey.",
    "Immunology & Fibrosis Clinical Development, Bristol Myers Squibb, Boudry, Switzerland.",
    "Global Biometrics and Data Sciences, Bristol Myers Squibb (Consultant), Princeton, New Jersey.",
    "WW Medical Immunology, Bristol Myers Squibb, Princeton, New Jersey.",
    "Epidemiology-Immunology, Bristol Myers Squibb, Princeton, New Jersey.",
    "Clinical Development, Dermatology and Rheumatology, Bristol Myers Squibb, Princeton, New Jersey.",
    "Department of Dermatology, Yale University School of Medicine, New Haven, and Central Connecticut Dermatology Research, Cromwell, Connecticut.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Oregon Medical Research Center, Portland, Oregon."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39602111/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}