{
  "pmid": "39873274",
  "title": "Real-world 52-week effectiveness of deucravacitinib in psoriasis: A stratified analysis by age and body mass index.",
  "abstract": "Deucravacitinib, an oral tyrosine kinase 2 inhibitor, is effective for psoriasis. However, long-term real-world effectiveness stratified by age and body mass index (BMI) has not been precisely examined. This study aimed to evaluate 52-week real-world effectiveness of deucravacitinib in psoriasis patients, stratified by age (≥65 years vs <65 years) and BMI (≥25 vs <25). A prospective study was conducted from December 2022 to August 2024, involving 107 Japanese patients aged ≥15 years with moderate to severe psoriasis. Patients received 6 mg of deucravacitinib daily for 52 weeks. Therapeutic effectiveness was evaluated by the achievement rates of Psoriasis Area and Severity Index (PASI) 75, PASI 90, PASI 100, and other key clinical indices. Data were stratified by age and BMI. Mean PASI scores decreased until week 52 similarly in all patients' groups stratified by age or BMI. The achievement rates of PASI 75, PASI 90, and PASI 100 at week 52 were 86.36%, 59.09%, and 13.64% in patients aged ≥65 years, while they were 86.36%, 65.22%, and 39.13% in patients aged <65 years, respectively, showing a slightly lower rate of PASI 100 in patients ≥65 years. The achievement rates of PASI 75, PASI 90, and PASI 100 at week 52 were 81.82%, 73.33%, and 18.18% in patients with BMI ≥25, while they were 88.24%, 82.86%, and 29.41% in patients with BMI < 25, respectively, and these rates at weeks 4, 16, 24, and 40 were slightly lower in patients with BMI ≥25. Deucravacitinib improved clinical indices of psoriasis patients during a 52-week period in all patients' groups stratified by age or BMI. The present results indicate that deucravacitinib may be effective for elderly psoriasis patients as well as younger or middle-aged patients, while effectiveness in patients with BMI ≥25 may be slightly lower compared with those with BMI < 25.",
  "pub_date": "2025-01-28",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Fujimoto Dermatology Clinic, Funabashi, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39873274/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}