{
  "pmid": "39916637",
  "title": "Long-term real-world effectiveness of deucravacitinib in psoriasis: A 52-week prospective study stratified by prior apremilast or biologic therapy.",
  "abstract": "Real-world evidence on the long-term effectiveness of deucravacitinib, a selective tyrosine kinase 2 inhibitor for psoriasis, remains limited, particularly in patients with different histories of systemic treatments. We evaluated the 52-week effectiveness of deucravacitinib in patients with psoriasis, stratified by a history of apremilast or biologic usage. This prospective, single-center study included 110 patients with moderate-to-severe psoriasis who received daily deucravacitinib (6 mg). Psoriasis Area and Severity Index (PASI) and Dermatology Life Quality Index (DLQI) scores during the treatment were analyzed in subgroups stratified by a history of apremilast or biologic usage. Deucravacitinib decreased PASI and DLQI scores for 52 weeks in psoriasis patients, both with and without prior apremilast or biologic usage. The percent reductions from baseline PASI or DLQI at week 52 were similar in apremilast-experienced patients (92% or 77.9%) and apremilast-naive patients (88.3% or 81.6%), respectively. The achievement rates of PASI 100 or absolute PASI ≤1 at week 52 in apremilast-experienced patients (30.8% or 61.5%) were slightly higher than those in apremilast-naive patients (20.5% or 46.2%). The percent reductions from baseline PASI or DLQI at week 52 in biologic-naive patients (91.6 or 82.8%) were slightly higher than those in biologic-experienced patients (57.6% or 63.6%), respectively. The achievement rates of PASI 75, 100 or absolute PASI ≤1 at week 52 in biologic-naive patients (84.4%, 24.4%, or 53.3%) were slightly higher than those in biologic-experienced patients (57.1%, 14.3%, or 28.6%), respectively. Deucravacitinib generated sustained 52-week effectiveness in diverse patient subgroups, supporting its role as a universal treatment for psoriasis.",
  "pub_date": "2025-02-07",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Department of Dermatology, Fujimoto Dermatology Clinic, Funabashi, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39916637/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}