{
  "pmid": "40095854",
  "title": "Exploring the Efficacy, Safety, and Clinical Implications of Deucravacitinib in East Asians with Psoriasis: A Narrative Review.",
  "abstract": "Deucravacitinib, a selective oral tyrosine kinase 2 (TYK2) inhibitor, has demonstrated strong efficacy in the treatment of moderate-to-severe psoriasis. It works through an allosteric mechanism to selectively inhibit TYK2, leading to the suppression of the IL-23/Th17/IL-17 axis and a reduction in key pro-inflammatory cytokines such as IL-17A, IL-17F, IL-22, and IL-23. This review focuses on the clinical implications of deucravacitinib in East Asian patients, highlighting its efficacy, safety, and differences in treatment outcomes compared to other populations. Data from pivotal trials such as POETYK PSO-3 and PSO-4, which included East Asian populations, demonstrated robust efficacy and safety profiles, often surpassing results observed in global trials like POETYK PSO-1 and PSO-2. Subgroup analyses and network meta-analyses further corroborate these findings, providing a comprehensive understanding of its therapeutic potential in this demographic. Factors such as lower body mass index, genetic predispositions, and environmental influences may contribute to these differences in response. The safety profile of deucravacitinib is favorable, with low rates of serious adverse events and stable laboratory parameters. This review underscores the need for further research to investigate the genetic, metabolic, and environmental factors that may influence treatment outcomes, aiming to optimize personalized treatment strategies for East Asian patients with psoriasis.",
  "pub_date": "2025-03-05",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Seoul St. Mary's Hospital, College of Medicine, The Catholic University of Korea, Seoul 06591, Republic of Korea.",
    "Department of Dermatology, Bucheon St. Mary's Hospital, College of Medicine, The Catholic University of Korea, Seoul 14647, Republic of Korea.",
    "Department of Dermatology, Bucheon St. Mary's Hospital, College of Medicine, The Catholic University of Korea, Seoul 14647, Republic of Korea."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40095854/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}