{
  "pmid": "40351849",
  "title": "Adverse Events Associated with Apremilast and Deucravacitinib for Psoriasis: A Pharmacovigilance Study Based on the FAERS Database.",
  "abstract": "Apremilast and deucravacitinib are oral small-molecule inhibitors approved for the treatment of psoriasis, each with the potential to fill unmet needs among psoriasis patients. Investigating their adverse event (AE) profiles with post-marketing data is essential for optimizing patient care.\nWe analyzed AE reports from the FDA Adverse Event Reporting System (FAERS) database during Q1 2014 to Q4 2023. Disproportionality and Bayesian analyses were utilized to compare safety signals.\nA total of 95,524 and 754 AE reports associated with apremilast and deucravacitinib were retrieved, respectively. Apremilast was more prevalent to cause gastrointestinal AEs such as diarrhea and nausea, as well as psoriasis recurrence and nervous system disorders like headache. Deucravacitinib showed stronger associations with cutaneous AEs, including acne, folliculitis, pruritus, rash, and erythema, along with oral conditions. AEs not previously documented on drug labels, such as sinus headache and multiple allergies for apremilast, and acneiform dermatitis and rosacea for deucravacitinib, were identified. Female patients were exposed to a higher risk for skin-related AEs when using deucravacitinib.\nOur study offers valuable real-world insights into the safety profiles of apremilast and deucravacitinib. The observed sex differences in adverse events associated with apremilast and deucravacitinib require further investigation in real-world and clinical settings.",
  "pub_date": "2025-05-05",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China.",
    "Laboratory of Dermatology, Clinical Institute of Inflammation and Immunology, Frontiers Science Center for Disease-Related Molecular Network, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China.",
    "Department of Dermatology, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China.",
    "Laboratory of Dermatology, Clinical Institute of Inflammation and Immunology, Frontiers Science Center for Disease-Related Molecular Network, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China.",
    "Department of Dermatology, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China.",
    "Laboratory of Dermatology, Clinical Institute of Inflammation and Immunology, Frontiers Science Center for Disease-Related Molecular Network, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China.",
    "Department of Dermatology, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China.",
    "Laboratory of Dermatology, Clinical Institute of Inflammation and Immunology, Frontiers Science Center for Disease-Related Molecular Network, West China Hospital, Sichuan University, Chengdu, 610041, People's Republic of China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40351849/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}