{
  "pmid": "40773611",
  "title": "Comparative Efficacy of Deucravacitinib and Adalimumab for Scalp Psoriasis: An Indirect Treatment Comparison.",
  "abstract": "Plaque psoriasis of the scalp, a common psoriasis location, remains difficult to manage. The comparative efficacy of newer oral agents, such as deucravacitinib, versus traditional first-generation biologics has not been characterized in the treatment of scalp psoriasis. This study indirectly compared the long-term efficacy of deucravacitinib versus that of adalimumab for the treatment of scalp psoriasis.\nA literature review identified trial publications reporting long-term efficacy (&ge;48 weeks) of adalimumab in patients with scalp psoriasis. Based on a feasibility assessment, summary-level adalimumab data (VOYAGE 1 trial [NCT02207231]) were deemed suitable for comparison to patient-level deucravacitinib data (POETYK PSO-1 trial [NCT03624127]). Unadjusted analyses and adjusted analyses using an unanchored matching-adjusted indirect comparison (MAIC) approach were used to describe and compare baseline characteristics and efficacy outcomes in terms of rates of achievement of clear or almost clear scalp psoriasis (scalp-specific Physician Global Assessment score of 0/1 [ss-PGA 0/1]) at weeks 16, 24, and 48.\nCross-trial differences were observed in age, race, severe scalp psoriasis, and quality of life scores. A larger percentage of patients achieved ss-PGA 0/1 at week 48 with deucravacitinib (unadjusted: 76.7%; adjusted: 73.0%) versus adalimumab (60.5%). Similarly, a larger percentage of patients achieved ss-PGA 0/1 at weeks 16 and 24 with deucravacitinib versus adalimumab.\nIn this study, treatment with deucravacitinib was effective in treating scalp psoriasis and, when compared with adalimumab, was also associated with a larger percentage of patients achieving ss-PGA 0/1 over 48 weeks.",
  "pub_date": "2025-08-01",
  "publication_types": [
    "Journal Article",
    "Comparative Study",
    "Review"
  ],
  "affiliations": [],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40773611/",
  "snapshot_id": "2026-02-12T15-11-42Z",
  "ingested_at": "2026-02-12T15:11:45.771210+00:00"
}