{
  "pmid": "41319674",
  "title": "Time to lift the moratorium on IL-23 inhibitors for axial psoriatic arthritis.",
  "abstract": "The disappointment stemming from IL-23 inhibition failure in axial spondyloarthritis has resulted in expert panels extrapolating these results to axial psoriatic arthritis, with recommendations against the use of IL-23 inhibitors in this setting. However, post-hoc analyses of clinical trials show clinical improvements in axial psoriatic arthritis following treatment with ustekinumab, guselkumab, and risankizumab. A growing body of real-world evidence also shows substantial amelioration of spinal pain, related outcome measures, and imaging-detected inflammation. Despite negative trials, IL-23 inhibition was associated with C-reactive protein reductions and some improvement in MRI scores in ankylosing spondylitis, indicating some modicum of potential benefit. Furthermore, inadequate response to biological therapies in axial spondyloarthritis was associated with absence of MRI-determined bone marrow oedema, whereas responses to secukinumab in axial spondyloarthritis were independent of bone marrow oedema, pointing to divergent pathophysiological processes. The growing recognition of clinical, microanatomical, and immunological differences between axial spondyloarthritis and axial psoriatic arthritis suggests differential IL-23 pathway dependence. This Personal View aims to provide a deeper examination of these distinctions as a basis to propose reconsidering the current moratorium on IL-23 inhibitors-particularly in phenotypes not linked to HLA-B27-and to potentially expand therapeutic options.",
  "pub_date": "2025-11-27",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Section of Musculoskeletal Disease, NIHR Leeds Musculoskeletal Biomedical Research Centre, Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Chapel Allerton Hospital, Leeds, UK; Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy; Rheumatology and Clinical Immunology, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Section of Musculoskeletal Disease, NIHR Leeds Musculoskeletal Biomedical Research Centre, Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Chapel Allerton Hospital, Leeds, UK.",
    "Section of Musculoskeletal Disease, NIHR Leeds Musculoskeletal Biomedical Research Centre, Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Chapel Allerton Hospital, Leeds, UK.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy; Rheumatology and Clinical Immunology, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Section of Musculoskeletal Disease, NIHR Leeds Musculoskeletal Biomedical Research Centre, Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Chapel Allerton Hospital, Leeds, UK. Electronic address: d.g.mcgonagle@leeds.ac.uk."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41319674/",
  "snapshot_id": "2026-02-12T16-10-22Z",
  "ingested_at": "2026-02-12T16:10:23.603185+00:00"
}