{
  "pmid": "41641952",
  "title": "S3 Guideline for the Treatment of Psoriasis vulgaris, adapted from EuroGuiDerm - part 2: Specific clinical and comorbid situations.",
  "abstract": "The present Part 2 of the updated German S3 guideline on the treatment of psoriasis vulgaris provides recommendations for therapy selection in special clinical situations and in the presence of comorbidities. A major focus of this update is the chapter on screening for tuberculosis as well as therapy selection and management in latent tuberculosis. The recommendations regarding the use of interferon-gamma release assays and the indication for chest radiography have been extensively revised. In addition, the guidance on the suitability of systemic psoriasis therapies in patients with latent tuberculosis and on the need for preventive antituberculous treatment has been thoroughly updated. In the chapter on inflammatory bowel diseases, risankizumab and guselkumab have been added as recommended treatment options, as both agents have recently been approved for the indications Crohn's disease and ulcerative colitis. Further substantial revisions are included in the chapters on patients with a history of malignancy and viral hepatitis.",
  "pub_date": "2026-02",
  "publication_types": [
    "Journal Article",
    "Practice Guideline"
  ],
  "affiliations": [
    "Division of Evidence-Based Medicine (dEBM), Department of Dermatology, Venereology and Allergology, Charité - Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany.",
    "Department of Dermatology, Venereology and Allergology, Dessau Municipal Hospital, Dessau, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany.",
    "Dermatology Center Berlin Siddi & Bachmann, Berlin, Germany.",
    "Service de Dermatologie et Vénéréologie, Hôpitaux Universitaires de Genève, Geneva, Switzerland.",
    "Department of Gastroenterology, Hepatology and Endocrinology, Hannover Medical School, Hannover, Germany.",
    "Department of Internal Medicine, Tropical Medicine and Infectious Diseases, Rostock University Medical Center, Rostock, Germany.",
    "German Central Committee against Tuberculosis (DZK), Berlin, Germany.",
    "Rheumatology Center according to G-BA, Department of Rheumatology, Clinical Immunology and Physical Therapy, Marienhaus Hospital Mainz, Mainz, Germany.",
    "German Psoriasis Federation, Hamburg, Germany.",
    "Division of Rheumatology, Immunology - Inflammation Medicine, University Hospital Frankfurt Goethe University, Frankfurt am Main, Germany.",
    "Fraunhofer Institute for Translational Medicine and Pharmacology ITMP Frankfurt, Frankfurt am Main, Germany.",
    "Dermatology Office, Duisburg, Germany.",
    "Psoriasis Center, Department of Dermatology, Venereology, Allergology, University Hospital Schleswig-Holstein, Campus Kiel, Kiel, Germany.",
    "Department of Dermatology and Allergy, Hospital Hanau, Hanau, Germany.",
    "Division of Evidence-Based Medicine (dEBM), Department of Dermatology, Venereology and Allergology, Charité - Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany.",
    "Dermatology Office, Oranienburg, Germany.",
    "Helios Versorgungszentren GmbH, MVZ Gotha, Gotha, Germany.",
    "Dermatology Office, Osnabrück, Germany.",
    "German Central Committee against Tuberculosis (DZK), Berlin, Germany.",
    "Dermatology Office, Oldenburg, Germany.",
    "Berolina Hospital, Löhne, Germany.",
    "Dermatology Office, Mahlow, Germany.",
    "Department of Dermatology and Allergology, University Hospital Augsburg, Augsburg, Germany.",
    "Dermatology Office, Selters, Germany.",
    "German Psoriasis Federation, Hamburg, Germany.",
    "Division of Evidence-Based Medicine (dEBM), Department of Dermatology, Venereology and Allergology, Charité - Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41641952/",
  "snapshot_id": "2026-02-12T16-10-22Z",
  "ingested_at": "2026-02-12T16:10:23.603185+00:00"
}