{
  "pmid": "41665798",
  "title": "Patient Satisfaction Using Guselkumab Self-administered Using the One-Press Device for Treatment of Moderate-to-Severe Psoriasis: Results from a National, Prospective, Real-World Study in Portugal (CERES Study).",
  "abstract": "Guselkumab, a selective p19 subunit-targeted IL-23 inhibitor, has shown high efficacy and a favorable safety profile in clinical trials of moderate-to-severe plaque psoriasis (PsO). However, real-world data on patient satisfaction with the guselkumab One-Press device, particularly in Portuguese clinical practice, are limited.\nThis real-world, prospective, multicenter, nationwide study evaluated patient satisfaction with self-administration of guselkumab using the One-Press device over 52 weeks in adults with moderate-to-severe plaque PsO. A total of 101 patients from 10 dermatology centers were enrolled between September 2022 and November 2023. Patient satisfaction was assessed using the Self-Injection Assessment Questionnaire (SIAQ) at baseline and week 20. Using the SIAQ, patients rated the One-Press device's acceptability across six domains predose and postdose (feeling about injections, self-confidence, and satisfaction with self-injection; postdose only: self-image, pain and skin reactions during or after the injection, and ease of self-injection device use). Quality of life (Dermatology Life Quality Index [DLQI]), clinical effectiveness (Investigator Global Assessment [IGA]), and safety were evaluated through week 52.\nMean SIAQ PRE Module score increased significantly from 6.9 ± 1.8 at baseline to 8.3 ± 1.5 at week 20 (p < 0.001), indicating improved self-injection experience. Injection-related anxiety decreased from 63.4% to 48.9%. Mean DLQI score improved from 8.5 ± 6.9 at baseline to 1.5 ± 2.8 at week 20 and 1.1 ± 3.0 at week 52; 70.8% of patients achieved DLQI 0/1 by week 52. Despite nearly 90% having prior biologic or systemic therapy exposure, IGA 0/1 (\"clear\" or \"almost clear\") was achieved by 86.3% of patients at week 20 and 91.0% at week 52. A total of 198 adverse events (AEs) were reported in 62.4% of patients and were mainly mild, localized injection-site reactions. One serious AE was considered related to guselkumab.\nIn routine clinical practice in Portugal, guselkumab self-administered using the One-Press device demonstrated high patient satisfaction, substantial quality-of-life improvement, robust clinical effectiveness, and a favorable safety profile. These real-world findings support the usability and benefit-risk profile of self-administered guselkumab for patients with moderate-to-severe plaque PsO.",
  "pub_date": "2026-02-10",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Unidade Local de Saúde de Santo António-Hospital Santo António, EPE, 4050-366, Porto, Portugal. torres.tiago@outlook.com.",
    "Unidade Local de Saúde de Lisboa Ocidental-Hospital Egas Moniz, EPE, 1349-019, Lisbon, Portugal.",
    "Unidade Local de Saúde de Santa Maria-Hospital Santa Maria, EPE, 1649-035, Lisbon, Portugal.",
    "Hospital CUF Descobertas, 1998-018, Lisbon, Portugal.",
    "Unidade Local de Saúde de São José-Hospital Santo António Capuchos, EPE, 1169-050, Lisbon, Portugal.",
    "Hospital de Loulé, 8100-503, Loulé, Portugal.",
    "Unidade Local de Saúde da Região de Leiria, EPE, 2410-197, Leiria, Portugal.",
    "Unidade Local de Saúde de Almada/Seixal-Hospital Garcia Orta, EPE, 2805-267, Almada, Portugal.",
    "Unidade Local de Saúde de São João-Hospital São João, EPE, 4200-319, Porto, Portugal.",
    "Johnson & Johnson Innovative Medicine, Lisbon, Portugal.",
    "Unidade Local de Saúde do Alto Ave-Hospital Senhora da Oliveira, EPE, 4835-044, Guimarães, Portugal."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41665798/",
  "snapshot_id": "2026-02-12T16-10-22Z",
  "ingested_at": "2026-02-12T16:10:23.603185+00:00"
}