{
  "pmid": "36834806",
  "title": "Tyk2 Targeting in Immune-Mediated Inflammatory Diseases.",
  "abstract": "The Janus kinase (Jak)/signal transducer and activating protein (STAT) pathways mediate the intracellular signaling of cytokines in a wide spectrum of cellular processes. They participate in physiologic and inflammatory cascades and have become a major focus of research, yielding novel therapies for immune-mediated inflammatory diseases (IMID). Genetic linkage has related dysfunction of Tyrosine kinase 2 (Tyk2)-the first member of the Jak family that was described-to protection from psoriasis. Furthermore, Tyk2 dysfunction has been related to IMID prevention, without increasing the risk of serious infections; thus, Tyk2 inhibition has been established as a promising therapeutic target, with multiple Tyk2 inhibitors under development. Most of them are orthosteric inhibitors, impeding adenosine triphosphate (ATP) binding to the JH1 catalytic domain-which is highly conserved across tyrosine kinases-and are not completely selective. Deucravacitinib is an allosteric inhibitor that binds to the pseudokinase JH2 (regulatory) domain of Tyk2; this unique mechanism determines greater selectivity and a reduced risk of adverse events. In September 2022, deucravacitinib became the first Tyk2 inhibitor approved for the treatment of moderate-to-severe psoriasis. A bright future can be expected for Tyk2 inhibitors, with newer drugs and more indications to come.",
  "pub_date": "2023-02-08",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology IIB Sant Pau, Hospital de la Santa Creu i Sant Pau, Universitat Autònoma de Barcelona, 08041 Barcelona, Spain.",
    "Department of Dermatology IIB Sant Pau, Hospital de la Santa Creu i Sant Pau, Universitat Autònoma de Barcelona, 08041 Barcelona, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/36834806/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}