{
  "pmid": "37075192",
  "title": "New Treatments for Psoriasis: An Update on a Therapeutic Frontier.",
  "abstract": "The landscape of psoriasis treatments has undergone rapid change within the last decade and the dizzying speed of drug development has not slowed, with 4 notable entries into the psoriasis treatment armamentarium within the last year: tapinarof, roflumilast, deucravacitinib, and spesolimab. Several others are in late-stage development, and these therapies represent new mechanisms, pathways, and delivery systems, meaningfully broadening the spectrum of treatment choices for our patients. However, it can be quite difficult to keep track of all the medication options. This review aims to present the mechanisms and data on both newly available therapeutics for psoriasis and products in the pipeline that may have a notable impact on our treatment paradigm for psoriasis in the near future.",
  "pub_date": "2023-02",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Drs. Pelet del Toro and Han are from the Department of Dermatology, Donald and Barbara Zucker School of Medicine at Hofstra/Northwell, Hempstead, New York. Dr. Wu is from the Dr. Phillip Frost Department of Dermatology and Cutaneous Surgery, University of Miami Miller School of Medicine, Florida.",
    "Drs. Pelet del Toro and Han are from the Department of Dermatology, Donald and Barbara Zucker School of Medicine at Hofstra/Northwell, Hempstead, New York. Dr. Wu is from the Dr. Phillip Frost Department of Dermatology and Cutaneous Surgery, University of Miami Miller School of Medicine, Florida.",
    "Drs. Pelet del Toro and Han are from the Department of Dermatology, Donald and Barbara Zucker School of Medicine at Hofstra/Northwell, Hempstead, New York. Dr. Wu is from the Dr. Phillip Frost Department of Dermatology and Cutaneous Surgery, University of Miami Miller School of Medicine, Florida."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37075192/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}