{
  "pmid": "37150956",
  "title": "Treatment of plaque psoriasis with deucravacitinib (POETYK PSO-2 study): a plain language summary.",
  "abstract": "This is a summary of a paper published in a medical journal that describes the results of a study called POETYK PSO-2, which investigated a new treatment for plaque psoriasis. Plaque psoriasis appears on the body as dry, discolored, patches of skin that can be flaky and covered in scales. This can make the skin itch, crack or bleed and make it difficult for people with psoriasis to perform basic everyday tasks. Treatments are available, but some do not always reduce symptoms or may need to be injected or taken multiple times a day, which can be difficult to do, or can have undesirable side effects. Researchers are looking for new treatments for psoriasis.\nDeucravacitinib is a once-daily pill taken by mouth (orally) that was studied as a treatment for moderate to severe plaque psoriasis in two large studies conducted globally, PSO-1 and PSO-2. POETYK PSO-2 was a Phase 3 research study, which is a study that tests a treatment in a large group of participants, that looked at how well deucravacitinib worked in participants with moderate to severe plaque psoriasis compared to a placebo (an inactive pill that has no effect) and an approved psoriasis treatment called apremilast, which is a pill taken twice a day. These medications were tested in adults with moderate to severe plaque psoriasis, which is psoriasis involving 10% or more of their body (equal to 10 or more handprints). The aims of the POETYK PSO-2 study were to find out if treatment with deucravacitinib could improve psoriasis for the participants in the study and to see if there were any side effects. Side effects are events that happened during treatment that may or may not be caused by that treatment. The study also wanted to find out what would happen after stopping treatment with deucravacitinib in participants who had shown major improvements in their psoriasis.\nAfter 4 months of treatment, more participants taking deucravacitinib had significantly greater improvements in psoriasis than those taking placebo or apremilast. The study also showed that participants continued to see these improvements after taking deucravacitinib for up to 1 year. Some participants maintained the improvements in their psoriasis with deucravacitinib after stopping treatment and switching to a placebo. Side effects for participants taking deucravacitinib were generally mild and occurred in similar numbers to those in participants taking placebo. The most common side effects in participants taking deucravacitinib were inflammation of the nose and throat (a common cold) which occurred at a similar rate in participants who took placebo. Clinical Trial Registration: NCT03611751 (POETYK PSO-2 study) (ClinicalTrials.gov).",
  "pub_date": "2023-05-07",
  "publication_types": [
    "Journal Article",
    "Research Support, Non-U.S. Gov't",
    "Patient Education Handout"
  ],
  "affiliations": [
    "Department of Dermatology, Yale University School of Medicine, New Haven, & Central Connecticut Dermatology Research, Cromwell, CT, USA.",
    "Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Department of Dermatology & Pediatrics, UCLA School of Medicine, Los Angeles, CA, USA.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "Department of Dermatology, Medical College of Wisconsin, Milwaukee, WI, USA.",
    "Department of Dermatology, The University of Melbourne, Skin Health Institute & Probity Medical Research, Carlton, VIC, Australia.",
    "Oregon Dermatology & Research Center, Portland, OR, USA.",
    "University of Toulouse & CHU, Toulouse, France.",
    "Psoriasis Treatment Center of New Jersey, East Windsor, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Alliance Clinical Trials & Probity Medical Research, Waterloo, ON, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37150956/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}