{
  "pmid": "37168605",
  "title": "Effectiveness and Safety of Deucravacitinib for the Management of Psoriasis: A Review of the Current Literature.",
  "abstract": "Psoriasis management may be challenging, particularly for moderate-to-severe forms of the disease. Indeed, conventional systemic treatments are often avoided for contraindications or the risk of adverse events as well as phototherapy is often limited by logistic concerns. Despite the development of biological drugs and small molecules revolutionized the treatment options showing promising results in terms of safety and effectiveness, some limitations remain. Thus, there is still a need for new therapies that are always welcome in order to tailor the treatment to the patient and to have a higher level of performance, especially in order to maintain long-term effectiveness. In this scenario, deucravacitinib, an oral small molecule which selectively inhibits Tyrosine Kinase 2, may represent a promising weapon in psoriasis management. The aim of our manuscript is to review the current knowledge on the efficacy and safety of deucravacitinib for the management of psoriasis.",
  "pub_date": "2023-05-04",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37168605/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}