{
  "pmid": "37223005",
  "title": "Clinical Utility of Deucravacitinib for the Management of Moderate to Severe Plaque Psoriasis.",
  "abstract": "Psoriasis is a chronic, immune-mediated skin condition with significant detriments to physical/mental health. While systemic therapies are available for the treatment of moderate-to-severe psoriasis, patients can experience therapeutic failure, loss of efficacy, or medical contraindications that require other therapeutic options.\nWith the recent approval of deucravacitinib, a first-in-class TYK2 small molecule inhibitor administered orally for psoriasis patients, we reviewed data from randomized controlled trials (RCTs) to synthesize its clinical utility. To our knowledge, this is the first systematic review and meta-analysis of deucravacitinib comparing its clinical efficacy to placebo in psoriasis.\nA literature search was conducted in PubMed (MEDLINE), Embase, and the Cochrane Central Register of Controlled Trials to identify RCTs studying deucravacitinib in human patients with moderate-to-severe psoriasis.\nOne placebo-controlled Phase II RCT and two placebo-controlled/active-comparator Phase III RCTs were included for review. Patients (N=1953) treated with deucravacitinib 6 mg daily showed marked improvement in disease severity (Psoriasis Area and Severity Index (PASI), static Physician Global Assessment (sPGA) and quality-of-life outcomes compared to patients administered comparator (apremilast) and placebo. Clinical improvement given deucravacitinib was noted for scalp psoriasis but not fingernail psoriasis. Meta-analysis (deucravacitinib, n=888; placebo, n=466) comparing rates of clearance (sPGA 0/1) demonstrated superior efficacy of deucravacitinib compared to placebo (odds ratio, 12.87; 95% confidence interval, 8.97-18.48; χ2=4.08, I2=51%). Deucravacitinib was well-tolerated, with similar rate of occurrence and type of adverse events reported among patients treated with placebo or apremilast at Week 12-16. No cardiovascular events, serious infections, or lab abnormalities were noted.\nDeucravacitinib possesses good efficacy, with no report of safety concerns associated with prior JAK inhibitors used for psoriasis. Meta-analysis demonstrated deucravacitinib's superiority compared to placebo, indicating its promising clinical utility. Further studies are needed to observe long-term safety and efficacy, and to compare deucravacitinib to existing treatments.",
  "pub_date": "2023-05-18",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "School of Medicine, University of California at San Francisco, San Francisco, CA, USA.",
    "Department of Dermatology, University of California at San Francisco, San Francisco, CA, USA.",
    "Department of Dermatology, University of California at San Francisco, San Francisco, CA, USA.",
    "Department of Dermatology, University of California at San Francisco, San Francisco, CA, USA.",
    "Department of Dermatology, University of California at San Francisco, San Francisco, CA, USA.",
    "Department of Dermatology, University of California at San Francisco, San Francisco, CA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37223005/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}