{
  "pmid": "38031699",
  "title": "Janus-kinase inhibitors in dermatology: A review of their use in psoriasis, vitiligo, systemic lupus erythematosus, hidradenitis suppurativa, dermatomyositis, lichen planus, lichen planopilaris, sarcoidosis and graft-versus-host disease.",
  "abstract": "Recent studies on molecular pathways have elucidated novel therapeutic approaches in inflammatory and autoimmune skin disorders. Specifically, the dysregulation of the Janus kinase signal transducer and activator of transcription (JAK-STAT) cascade plays a central role in the pathogenesis of many skin conditions. JAK inhibitors, with their ability to selectively target immune responses, are potential treatment options. Using the National Library of Medicine, we provide a comprehensive review of the use of United States Food and Drug Administration (FDA)-approved and emerging JAK or tyrosine kinase 2 (TYK2) inhibitors in a wide range of dermatologic conditions, including psoriasis, vitiligo, systemic lupus erythematosus, hidradenitis suppurativa, dermatomyositis, lichen planus, lichen planopilaris, sarcoidosis and graft-versus-host disease. In patients with psoriasis, oral deucravacitinib (TYK2 inhibitor) has been approved as a once-daily therapy with demonstrated superiority and efficacy over apremilast and placebo and tolerable safety profiles. In patients with vitiligo, topical ruxolitinib (JAK1 inhibitor) is approved as a twice-daily treatment for repigmentation. The efficacy of several other JAK inhibitors has also been demonstrated in several clinical trials and case studies for systemic lupus erythematosus, hidradenitis suppurativa, dermatomyositis, lichen planus, lichen planopilaris, sarcoidosis and graft-versus-host disease. Further investigations with long-term clinical trials are necessary to confirm their utility in treatment and safety for these diseases.",
  "pub_date": "2023",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Keck School of Medicine, University of Southern California, Los Angeles, United States.",
    "Keck School of Medicine, University of Southern California, Los Angeles, United States."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38031699/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}