{
  "pmid": "38188537",
  "title": "Deucravacitinib: a novel TYK2 inhibitor for the treatment of moderate-to-severe psoriasis.",
  "abstract": "Deucravacitinib is a first-in-class tyrosine kinase 2 (TYK2) inhibitor recently approved for the treatment of adults with moderate-to-severe plaque psoriasis.\nTo discuss the mechanism of action, efficacy, safety, and real-world applications of deucravacitinib for the treatment of psoriasis.\nLiterature on the mechanism of action of deucravacitinib is reviewed. The pivotal clinical studies and long-term extension studies for deucravacitinib are also examined.\nDeucravacitinib is a novel oral TYK2 inhibitor that binds to the regulatory domain of TYK2, a Janus kinase. By inhibiting TYK2, deucravacitinib interferes with signaling of IL-23, IL-12, and type I interferons, cytokines believed to play important roles in psoriasis pathogenesis. Nearly 60% of patients achieve PASI 75 at 16 weeks of treatment; efficacy improves over 24 weeks and is maintained through 2 years of continuous treatment. In a head-to-head comparison, deucravacitinib efficacy was superior to apremilast, an older yet commonly used oral PDE4 inhibitor approved for the treatment of psoriasis. Of note, patients with moderate-to-severe plaque psoriasis with concomitant involvement of the scalp, nails, and/or palms/soles demonstrated good improvement in these high impact areas. Deucravacitinib has an acceptable safety profile and is generally well-tolerated. Small increases in reactivation of herpesvirus infections, including herpes simplex outbreaks, have been reported. Tuberculosis evaluation, but no other blood tests, is recommended prior to initiation of deucravacitinib. Monitoring of triglyceride levels should be conducted for high-risk patients according to local guidelines.\nDeucravacitinib is an effective, safe, and well-tolerated novel oral medication for adults with moderate-to-severe plaque psoriasis.",
  "pub_date": "2023-09-05",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Keck Medicine of USC, Los Angeles, California.",
    "Oregon Medical Research Center, Portland, Oregon.",
    "Department of Dermatology, Yale University School of Medicine, New Haven, and Central Connecticut Dermatology Research, Cromwell, Connecticut.",
    "Division of Dermatology, University of California, Los Angeles, Los Angeles, California."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38188537/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}