{
  "pmid": "38216005",
  "title": "Properties of FDA-approved small molecule protein kinase inhibitors: A 2024 update.",
  "abstract": "Owing to the dysregulation of protein kinase activity in many diseases including cancer, this enzyme family has become one of the most important drug targets in the 21st century. There are 80 FDA-approved therapeutic agents that target about two dozen different protein kinases and seven of these drugs were approved in 2023. Of the approved drugs, thirteen target protein-serine/threonine protein kinases, four are directed against dual specificity protein kinases (MEK1/2), twenty block nonreceptor protein-tyrosine kinases, and 43 inhibit receptor protein-tyrosine kinases. The data indicate that 69 of these drugs are prescribed for the treatment of neoplasms. Six drugs (abrocitinib, baricitinib, deucravacitinib, ritlecitinib, tofacitinib, upadacitinib) are used for the treatment of inflammatory diseases (atopic dermatitis, rheumatoid arthritis, psoriasis, alopecia areata, and ulcerative colitis). Of the 80 approved drugs, nearly two dozen are used in the treatment of multiple diseases. The following seven drugs received FDA approval in 2023: capivasertib (HER2-positive breast cancer), fruquintinib (metastatic colorectal cancer), momelotinib (myelofibrosis), pirtobrutinib (mantle cell lymphoma, chronic lymphocytic leukemia, small lymphocytic lymphoma), quizartinib (Flt3-mutant acute myelogenous leukemia), repotrectinib (ROS1-positive lung cancer), and ritlecitinib (alopecia areata). All of the FDA-approved drugs are orally effective with the exception of netarsudil, temsirolimus, and trilaciclib. This review summarizes the physicochemical properties of all 80 FDA-approved small molecule protein kinase inhibitors including the molecular weight, number of hydrogen bond donors/acceptors, polar surface area, potency, solubility, lipophilic efficiency, and ligand efficiency.",
  "pub_date": "2024-01-11",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Blue Ridge Institute for Medical Research, 221 Haywood Knolls Drive, Hendersonville, NC 28791, United States. Electronic address: rrj@brimr.org."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38216005/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}