{
  "pmid": "38280146",
  "title": "Clinical Pharmacokinetic and Pharmacodynamic Considerations in the Treatment of Moderate-to-Severe Psoriasis.",
  "abstract": "Psoriasis is a common inflammatory immune disorder due to chronic activation of the adaptive and innate immune responses. Therapies for psoriasis target reducing inflammatory cytokines such as tumor necrosis factor-alpha, interleukin-17, and interleukin-22. Patients with inflammatory disorders have reduced metabolism by cytochrome P450 enzymes in the liver. The pharmacokinetic and pharmacodynamic changes due to psoriasis also have an impact on reaching therapeutic concentrations of the drug. Pharmacokinetic and pharmacodynamic data help determine the safety and clinical considerations necessary when utilizing drugs for plaque psoriasis. A literature search was performed on PubMed and Ovid MEDLINE for the pharmacokinetic and pharmacodynamic data of oral therapies and biologics utilized for moderate-to-severe plaque psoriasis. The findings from the literature search were organized into two sections: oral therapies and biologics. The pharmacokinetic and pharmacodynamic parameters in healthy patients, patients with psoriasis, and special populations are discussed in each section. The oral therapies described in this review include methotrexate, cyclosporine, apremilast, tofacitinib, and deucravacitinib. Biologics include tumor necrosis factor-alpha inhibitors, interleukin-17 inhibitors, ustekinumab, and interleukin-23 inhibitors. Clinical considerations for these therapies include drug toxicities, dosing frequency, and anti-drug antibodies. Methotrexate and cyclosporine have a risk for hepatoxicity and renal impairment, respectively. Moreover, drugs metabolized via cytochrome P450, including tofacitinib and apremilast have decreased clearance in patients with psoriasis, requiring dose adjustments. Patients treated with therapies such as adalimumab can develop anti-drug antibodies that reduce the long-term efficacy of the drug. Additionally, overweight patients benefit from more frequent dosing to achieve better psoriasis clearance.",
  "pub_date": "2024-01-27",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Center for Dermatology Research, Wake Forest University School of Medicine, 475 Vine St, Winston-Salem, NC, 27101, USA. jdg106@georgetown.edu.",
    "Department of Dermatology, Center for Dermatology Research, Wake Forest University School of Medicine, 475 Vine St, Winston-Salem, NC, 27101, USA.",
    "Department of Pathology, Wake Forest University School of Medicine, Winston-Salem, NC, USA.",
    "Department of Social Sciences & Health Policy, Wake Forest University School of Medicine, Winston-Salem, NC, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38280146/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}