{
  "pmid": "38444845",
  "title": "Application of JAK inhibitors in paradoxical reaction through immune-related dermatoses.",
  "abstract": "Biologics play a positive and effective role in the treatment of immune-related dermatoses. However, many other immune-related diseases have also manifested along with biologics treatment. Paradoxical reaction through immune-related dermatoses refer to the new onset or exacerbation of other immune-mediated dermatoses (mainly psoriasis and atopic dermatitis) after biologics treatment of inflammatory dermatoses (mainly psoriasis and atopic dermatitis), such as new atopic dermatitis (AD) in psoriasis (PsO) treatment and new PsO in AD treatment. A common genetic background and Inflammatory pathway are possible pathogenesis. Faced with paradoxical reactions, the choice of therapy needs to be directed toward therapies effective for both diseases, such as Janus kinase (JAK) inhibitors. The Janus kinase and signal transducer and activator of transcription (JAK-STAT) pathway plays an important role in the inflammatory pathway, and has been widely used in the treatment of AD and PsO in recent years. This article focuses on JAK inhibitors such as tofacitinib, baricitinib, ruxolitinib, Abrocitinib, upadacitinib, and deucravacitinib, to explore the possible application in treatment of paradoxical reactions. Common side effects, baseline risk factors and safety use of JAK inhibitors were discussed.",
  "pub_date": "2024-02-20",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "First College for Clinical Medicine, Xuzhou Medical University, Xuzhou, China.",
    "Department of Dermatology, Affiliated Hospital of Xuzhou Medical University, Xuzhou, China.",
    "Department of Dermatology, Affiliated Hospital of Xuzhou Medical University, Xuzhou, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38444845/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}