{
  "pmid": "38799436",
  "title": "Reactive oxygen species-responsive supramolecular deucravacitinib self-assembly polymer micelles alleviate psoriatic skin inflammation by reducing mitochondrial oxidative stress.",
  "abstract": "The new topical formula is urgent needed to meet clinical needs for majority mild patients with psoriasis. Deucravacitinib exerts outstanding anti-psoriatic capacity as an oral TYK2 inhibitor; however, single therapy is insufficient to target the complicated psoriatic skin, including excessive reactive oxygen species (ROS) and persistent inflammation. To address this need, engineered smart nano-therapeutics hold potential for the topical delivery of deucravacitinib.\nhydrophobic Deucravacitinib was loaded into polyethylene glycol block-polypropylene sulphide (PEG-b-PPS) for transdermal delivery in the treatment of psoriasis. The oxidative stress model of HaCaT psoriasis was established by TNF-α and IL-17A in vitro. JC-1 assay, DCFH-DA staining and mtDNA copy number were utilized to assess mitochondrial function. 0.75% Carbopol®934 was incorporated into SPMs to produce hydrogels and Rhb was labeled to monitor penetration by Immunofluorescence. In vivo, we established IMQ-induced psoriatic model to evaluate therapeutic effect of Car@Deu@PEPS.\nDeu@PEPS exerted anti-psoriatic effects by restoring mitochondrial DNA copy number and mitochondrial membrane potential in HaCaT. In vivo, Car@Deu@PEPS supramolecular micelle hydrogels had longer retention time in the dermis in the IMQ-induced ROS microenvironment. Topical application of Car@Deu@PEPS significantly restored the normal epidermal architecture of psoriatic skin with abrogation of splenomegaly in the IMQ-induced psoriatic dermatitis model. Car@Deu@PEPS inhibited STAT3 signaling cascade with a corresponding decrease in the levels of the differentiation and proliferative markers Keratin 17 and Cyclin D1, respectively. Meanwhile, Car@Deu@PEPS alleviated IMQ-induced ROS generation and subsequent NLRP3 inflammasome-mediated pyroptosis.\nDeu@PEPS exerts prominent anti-inflammatory and anti-oxidative effects, which may offers a more patient-acceptable therapy with fewer adverse effects compared with oral deucravacitinib.",
  "pub_date": "2024-05-10",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University, Xi'an, China.",
    "Medical Research Center, North China University of Science and Technology, Tangshan, Hebei, China.",
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University, Xi'an, China.",
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University, Xi'an, China.",
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University, Xi'an, China.",
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University, Xi'an, China.",
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University, Xi'an, China.",
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University, Xi'an, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38799436/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}