{
  "pmid": "38914425",
  "title": "Cost per response analysis of deucravacitinib versus apremilast and first-line biologics among patients with moderate to severe plaque psoriasis in the United States.",
  "abstract": "Understanding the economic value of deucravacitinib and apremilast could assist treatment decision-making for patients with moderate to severe plaque psoriasis.\nThis study compared the cost per response (CPR) for US patients initiating deucravacitinib versus apremilast for moderate to severe plaque psoriasis.\nA CPR model using pharmacy and administration costs was developed from a US payer perspective. Response was defined as a 75% reduction from baseline in Psoriasis Area and Severity Index (PASI 75) at weeks 16 and 24. Long-term response was defined as the cumulative benefit over 52 weeks, measured as area under the curve; subsequent treatment was included. Scenario analyses explored varying the efficacy measure or choices of subsequent treatments and limiting discontinuation.\nThe CPR for deucravacitinib versus apremilast was lower at 16 weeks (difference: -$3796 [95% confidence interval (CI): -$6140 to -$1659]) and 24 weeks (difference: -$12,784 [95% CI: -$16,674 to -$9369]). At 52 weeks, the cost per cumulative benefit was lower for patients who initiated deucravacitinib, regardless of initial treatment period duration (16 or 24 weeks).\nScenario analyses found mainly consistent results. This study showed that the CPR is lower when initiating deucravacitinib versus apremilast in moderate to severe plaque psoriasis.",
  "pub_date": "2024-06-24",
  "publication_types": [
    "Journal Article",
    "Comparative Study"
  ],
  "affiliations": [
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "OPEN Health Evidence and Access, York, UK.",
    "OPEN Health Evidence and Access, Parsippany, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38914425/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}