{
  "pmid": "39657275",
  "title": "Long-term effectiveness and safety of deucravacitinib for psoriasis: a 52-week real-world study of genital, scalp and nail lesions.",
  "abstract": "The long-term (around 1-year) effectiveness and safety of deucravacitinib for the treatment of psoriasis have not been extensively studied in real-world settings, particularly in difficult-to-treat areas, such as the genital, scalp and nail regions.\nTo evaluate the 52-week real-world effectiveness and safety of deucravacitinib in patients with moderate-to-severe psoriasis of the genital, scalp and nail regions.\nThis prospective study analysed 104 patients with moderate-to-severe plaque psoriasis treated with deucravacitinib. Clinical scores, Psoriasis Area and Severity Index (PASI), both static and site-specific Physician Global Assessment (PGA), Dermatology Life Quality Index (DLQI) and laboratory inflammatory indices were assessed during a 52-week period.\nDeucravacitinib decreased clinical severity scores, and the decrease was sustained for 52 weeks. At week 52, 86% (37/43), 63% (27/43) and 26% (11/43) of patients achieved PASI 75, PASI 90 and PASI 100 reductions (representing a ≥ 75%, ≥ 90% or 100% improvement from baseline), respectively. Deucravacitinib reduced the PGA scores for the genital, scalp and nail regions, as well as the DLQI. Among the patients who completed the 52-week treatment, no significant impact on laboratory inflammatory indices was observed, and no severe or lethal adverse events were reported. Not all patients completed the full 52-week treatment period, as some discontinued early due to adverse events or for other reasons.\nDeucravacitinib may be a promising long-term treatment option for psoriasis, demonstrating sustained effectiveness and safety, including in difficult-to-treat areas, such as the genital, scalp and nail regions in real-world clinical practice.",
  "pub_date": "2025-04-24",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Fujimoto Dermatology Clinic, Funabashi, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39657275/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}