{
  "pmid": "40490621",
  "title": "Deucravacitinib as a monotherapy for concurrent management of psoriasis and chronic spontaneous urticaria.",
  "abstract": "Patients with autoimmune diseases are susceptible to developing a second autoimmune disorder. Psoriasis, a common autoimmune disease, frequently occurs alongside other autoimmune conditions in some individuals. We report the case of a young female patient diagnosed with plaque psoriasis, initially treated with secukinumab, and achieved complete skin clearance at 12 weeks. However, she experienced a decline in the efficacy of secukinumab, with recurrence of symptoms and subsequent development of chronic spontaneous urticaria (CSU) and was switched to treatment with deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor. The use of deucravacitinib resulted in a favorable therapeutic outcome, effectively managing both psoriasis and CSU 12 weeks after treatment. This case highlights the potential of deucravacitinib as a novel monotherapy for patients with both psoriasis and CSU.",
  "pub_date": "2025-06-09",
  "publication_types": [
    "Journal Article",
    "Case Reports"
  ],
  "affiliations": [
    "Department of Dermatology, the Tenth Affiliated Hospital, Southern Medical University (Dongguan People's Hospital), Southern Medical University, Dongguan, China.",
    "Department of Dermatology, Nanfang Hospital, Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, the Tenth Affiliated Hospital, Southern Medical University (Dongguan People's Hospital), Southern Medical University, Dongguan, China.",
    "Department of Dermatology, Nanfang Hospital, Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, Nanfang Hospital, Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, Nanfang Hospital, Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, Nanfang Hospital, Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, the Tenth Affiliated Hospital, Southern Medical University (Dongguan People's Hospital), Southern Medical University, Dongguan, China. lilichangxing@163.com.",
    "Department of Dermatology, Nanfang Hospital, Southern Medical University, Guangzhou, China. lilichangxing@163.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40490621/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}