{
  "pmid": "40856907",
  "title": "Management of Erythrodermic Psoriasis with Systemic Therapies: A Systematic Review.",
  "abstract": "Erythrodermic psoriasis (EP) is a severe and rare variant of psoriasis. Clinical features include scaling and erythema affecting more than 75% of body surface area, associated with systemic symptoms such as lymphadenopathy, arthralgia, fever, fatigue, dehydration, serum electrolyte disturbances, and tachycardia, making this condition a potentially life-threatening disease. Differential diagnosis can be challenging, encompasses atopic dermatitis, cutaneous adverse drug reaction, and advanced cutaneous lymphoma. Following a correct diagnostic framing, appropriate systemic treatment must be initiated. Unfortunately, there are no recent up-to-date guidelines and standardized treatment options for EP are still lacking.\nTo review the current reported systemic treatment options for EP.\nThis systematic review was conducted in accordance with the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) guidelines, and based on a search in MEDLINE, PubMed, Scopus, and Cochrane Library for articles in English from first available publication to 9 November 2024.\nIn all, 145 studies were included in the review. Case reports and case series are the main available work, reporting heterogeneous outcomes and effectiveness with nonbiologic and biologic systemic agents. Among non-biologic systemic treatments, methotrexate and cyclosporin are the most widely reported as treatment for EP, showing clinical response in over 60% of cases, with cyclosporine offering a faster onset of action and being suitable for acute management. Available randomized controlled trials include patients with EP treated with etretinate, infliximab, certolizumab-pegol (CZP), Ixekizumab, guselkumab, risankizumab, and deucravacitinib. However, these trials were not specifically designed for erythrodermic psoriasis, and the sample size of EP patients included is limited, resulting in reduced statistical power and limiting the reliability of the findings. Among TNF-α inhibitors, infliximab is the most reported agent, with data on 103 patients. Certolizumab pegol (CZP) also showed promising results, with PASI 75 achieved in over 80% of patients at 52 weeks. A retrospective analysis comparing infliximab, adalimumab, etanercept, ustekinumab, and efalizumab found TNF-α inhibitors to be superior to other biologic classes. Regarding IL-17 inhibitors, secukinumab is the second most frequently studied biologic, with 93 patients reported. It demonstrated rapid efficacy, achieving PASI 75 in more than 80% of patients by week 8. A head-to-head comparison with ixekizumab showed comparable outcomes. Among IL-23 inhibitors, risankizumab led to PASI 90 in over 75% of patients at week 16, suggesting high efficacy despite more limited data.\nNon-biologic systemic drugs appear to be a rational first-line therapy, with cyclosporine showing good results in managing the acute phase and methotrexate being effective in maintaining remission. In the case of contraindications or treatment failure of traditional systemic therapies, among biologic drugs, the rapidity of action, safety, and limited evidence of efficacy are in favor of IL-17 inhibitors and risankizumab. However, the findings we report are limited by the evidence available in current literature, which is characterized by low statistical power.",
  "pub_date": "2025-08-26",
  "publication_types": [
    "Journal Article",
    "Systematic Review"
  ],
  "affiliations": [
    "Section of Dermatology, Department of Medical Sciences, University of Turin, Via Cherasco 23, 10126, Turin, Italy. Lucamastorino02@gmail.com.",
    "Section of Dermatology, Department of Medical Sciences, University of Turin, Via Cherasco 23, 10126, Turin, Italy.",
    "Section of Dermatology, Department of Medical Sciences, University of Turin, Via Cherasco 23, 10126, Turin, Italy.",
    "Section of Dermatology, Department of Medical Sciences, University of Turin, Via Cherasco 23, 10126, Turin, Italy.",
    "Section of Dermatology, Department of Medical Sciences, University of Turin, Via Cherasco 23, 10126, Turin, Italy.",
    "Section of Dermatology, Department of Medical Sciences, University of Turin, Via Cherasco 23, 10126, Turin, Italy.",
    "Section of Dermatology, Department of Medical Sciences, University of Turin, Via Cherasco 23, 10126, Turin, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40856907/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}