{
  "pmid": "40920289",
  "title": "Design of Two Randomized, Placebo-Controlled, Phase 3 Trials of Deucravacitinib, an Oral, Selective, Allosteric TYK2 Inhibitor, in Systemic Lupus Erythematosus.",
  "abstract": "Deucravacitinib, a first-in-class, oral, selective, allosteric tyrosine kinase 2 inhibitor, demonstrated efficacy across the primary endpoint and all key secondary endpoints in the phase 2 PAISLEY SLE trial in patients with active systemic lupus erythematosus (SLE). Here, we describe 2 phase 3 trials [POETYK SLE-1 (NCT05617677), POETYK SLE-2 (NCT05620407)] which will assess the efficacy and safety of deucravacitinib in patients with active SLE. These phase 3 trials have been designed to replicate the successful elements of the phase 2 trial, including its glucocorticoid-tapering strategy and disease activity adjudication.\nIn these global, phase 3, randomized, double-blind, placebo-controlled trials, patients aged 18-75 years with active SLE receiving background standard-of-care treatment will be randomized 3:2 to receive deucravacitinib or placebo for 52 weeks of double-blind treatment. Patients receiving glucocorticoids will be instructed to taper, unless significant disease activity is present, to a threshold dose level during the double-blind treatment period. At week 52, eligible patients may continue to an optional 104-week open-label extension phase, in which all patients will receive deucravacitinib.\nThe primary endpoint of SLE Responder Index-4 response and all secondary endpoints will be assessed at week 52. Safety and tolerability will be assessed throughout the trials. In each trial, planned randomization includes patients in multiple countries across North and South America, Europe, and the Asia-Pacific region.\nThe POETYK SLE-1 and SLE-2 trials in progress are important to the continued evaluation of deucravacitinib as a potential well-tolerated and effective therapy option for patients with SLE.\nClinicalTrials.gov identifiers, NCT05617677 and NCT05620407.",
  "pub_date": "2025-09-08",
  "publication_types": [
    "Journal Article",
    "Clinical Trial Protocol"
  ],
  "affiliations": [
    "Department of Arthritis and Clinical Immunology, Rheumatology, Oklahoma Medical Research Foundation and Department of Medicine, University of Oklahoma Health Sciences Center, 825 NE 13th St, Oklahoma City, OK, 73104, USA. cristina-arriens@omrf.org.",
    "Centre for Inflammatory Diseases, Monash University, Clayton, VIC, 3168, Australia.",
    "Department of Medicine, Division of Rheumatology, Columbia University, New York, NY, 10032, USA.",
    "The Feinstein Institutes for Medical Research, Northwell Health, Manhasset, NY, 11030-3816, USA.",
    "Department of Rheumatology and Clinical Immunology, Amsterdam University Medical Centers, Amsterdam, 1081, The Netherlands.",
    "First Department of Internal Medicine, School of Medicine, University of Occupational and Environmental Health Japan, Kitakyushu, 807-8555, Japan.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, Princeton, NJ, 08540, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40920289/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}