{
  "pmid": "41035834",
  "title": "Effective management of psoriasis and psoriatic arthritis in a patient with systemic lupus erythematosus using deucravacitinib, mycophenolate mofetil and hydroxychloroquine.",
  "abstract": "We report the case of a 32-year-old woman with severe psoriasis, psoriatic arthritis (PsA) and systemic lupus erythematosus (SLE), including lupus nephritis. Despite effective control of her SLE and PsA with hydroxychloroquine, mycophenolate mofetil (MMF) and belimumab, her psoriatic skin manifestations worsened over time. The differing therapeutic responses of these two autoimmune diseases are rooted in their distinct pathogenesis: SLE treatments target B cells, autoantibodies and interferon signalling, while psoriasis requires therapies inhibiting the interleukin (IL)-23/IL-17 axis or tumour necrosis factor-α to address cutaneous inflammation and keratinocyte proliferation. There is limited evidence suggesting that MMF may suppress joint inflammation in PsA, but it does not effectively control psoriatic skin manifestations. Given the negative impact on her quality of life, deucravacitinib, a selective tyrosine kinase 2 inhibitor, was initiated at the approved dose of 6 mg daily. To avoid overimmunosuppression, belimumab was halted. Within 3 months, the patient's Psoriasis Area and Severity Index (PASI) improved from 23 to 1.2, body surface area from 70% to 2% and Dermatology Life Quality Index (DLQI) from 15 to 2, with no joint pain and no SLE flare-ups. After 6 and 9 months, her skin manifestations remained in remission (PASI 1.2 and PASI 0, respectively), DLQI was 0 and joint symptoms remained fully controlled. No significant side effects or infections were observed. These findings suggest deucravacitinib may offer an effective treatment alternative for patients with overlapping autoimmune diseases, without compromising SLE control or increasing infection risk.",
  "pub_date": "2025-08-04",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Institute for Health Services Research in Dermatology and Nursing Professions (IVDP), University Medical Centre Hamburg Eppendorf (UKE), Hamburg, Germany.",
    "III. Department of Internal Medicine, University Medical Centre Hamburg Eppendorf (UKE), Hamburg, Germany.",
    "Immunology Center Hamburg, Rheumatology Clinic, Specialist Medical Center Struenseehaus, Hamburg, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing Professions (IVDP), University Medical Centre Hamburg Eppendorf (UKE), Hamburg, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing Professions (IVDP), University Medical Centre Hamburg Eppendorf (UKE), Hamburg, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41035834/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}