{
  "pmid": "41096715",
  "title": "Review of Promising Off-Label Use of Deucravacitinib.",
  "abstract": "Tyrosine kinase 2 (TYK2) mediates the signaling pathways of proinflammatory cytokines such as interleukin (IL)-12, IL-23, and type I interferons (IFNs) and plays a pivotal role in the pathogenesis of psoriasis and various other immune-mediated diseases. Deucravacitinib, a selective oral TYK2 inhibitor, has been approved for the treatment of psoriasis and demonstrated high efficacy and a favorable safety profile. This review summarizes the potential for expanding deucravacitinib indications based on case reports, clinical trials, and preclinical studies. Diseases in which TYK2 pathway has been demonstrated to be involved and for which clinical benefit of deucravacitinib has been reported include discoid lupus erythematosus, systemic lupus erythematosus, alopecia areata, lichen planus, palmoplantar pustulosis, psoriatic arthritis, systemic sclerosis, interstitial pneumonia, inflammatory bowel disease, and chronic recurrent multifocal osteomyelitis. Furthermore, emerging research suggests potential therapeutic applications in neurodegenerative diseases such as Alzheimer's disease, and malignancies such as type 1 diabetes, vascular calcification in chronic kidney disease, T-cell acute lymphoblastic leukemia, and multiple sclerosis. Deucravacitinib may exert therapeutic effects by broadly suppressing cytokine signaling in a diverse range of inflammatory disorders. Ongoing clinical trials and mechanistic studies are required to clarify the efficacy and support its future indications.",
  "pub_date": "2025-09-27",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Tokyo Metropolitan Police Hospital, Tokyo 164-8541, Japan.",
    "Department of Dermatology, Tokyo Metropolitan Police Hospital, Tokyo 164-8541, Japan.",
    "Department of Dermatology, Tokyo Metropolitan Police Hospital, Tokyo 164-8541, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41096715/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}