{
  "pmid": "41630865",
  "title": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 (TYK2) inhibitor, in patients with moderate to severe scalp psoriasis: Efficacy and safety results through week 16 in a phase 3b/4, multicenter, randomized, double-blinded, placebo-controlled trial (PSORIATYK SCALP).",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, is approved in multiple countries for adults with moderate to severe plaque psoriasis who are candidates for systemic therapy.\nThe 52-week, phase 3b/4 PSORIATYK SCALP (NCT05478499) trial evaluated deucravacitinib efficacy and safety in scalp psoriasis, including patients with more limited overall psoriasis. Here, we report week 16 results.\nAdults with moderate to severe scalp psoriasis and body surface area involvement ≥ 3% were randomized 1:2 to placebo (n = 51) or deucravacitinib 6 mg once daily (n = 103) through week 16. The primary efficacy endpoint was scalp-specific Physician Global Assessment score of 0/1; key secondary endpoints were Psoriasis Scalp Severity Index 90, scalp-specific numeric rating scale itch score, and static Physician Global Assessment (sPGA) 0/1.\nIn the overall population, scalp-specific Physician Global Assessment score of 0/1 (48.5% vs 13.7%; P < .0001), Psoriasis Scalp Severity Index 90 (38.8% vs 2.0%; P < .0001), and mean change from baseline in scalp-specific numeric rating scale itch (-3.2 vs -0.7; P < .0001) were superior with deucravacitinib versus placebo. In the sPGA ≥ 3 subpopulation, sPGA 0/1 was superior with deucravacitinib (51.0% vs 4.3%; P < .0001). Adverse events were comparable between groups.\n16-week analysis.\nDeucravacitinib was efficacious and well tolerated in patients with moderate to severe scalp psoriasis.",
  "pub_date": "2025-12-22",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, University of Utah, Salt Lake City, Utah.",
    "Dermatology Centre, University of Manchester, Manchester.",
    "Department of Dermatology, King's College Hospital, King's College London, London, United Kingdom.",
    "Private Practice, Witten, Germany.",
    "Blauvelt Consulting, LLC, Annapolis, Maryland.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Department of Dermatology, University Hospital of the Goethe University, Frankfurt am Main, Germany.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Department of Dermatology, Henry Ford Health System, West Bloomfield, Michigan.",
    "Kimberly and Eric J. Waldman Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41630865/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}