{
  "pmid": "41657209",
  "title": "Two-Year Real-World Effectiveness of Deucravacitinib in Psoriasis: The Analysis Stratified by Prior Apremilast or Biologic Therapy.",
  "abstract": "Two-year effectiveness of tyrosine kinase 2 inhibitor deucravacitinib is unknown for psoriasis in real-world, especially in patients with different histories of systemic therapy. To evaluate the 104-week effectiveness of deucravacitinib in patients with psoriasis, stratified by prior use of apremilast or biologics. We studied 131 patients with moderate-to-severe psoriasis who received deucravacitinib 6 mg/day. Psoriasis area and severity index (PASI) and dermatology life quality index (DLQI) were analyzed in subgroups stratified by prior apremilast or biologic therapy. Deucravacitinib decreased PASI and DLQI through 104 weeks regardless of prior apremilast or biologic therapy. Week 104 achieving PASI 100 and absolute PASI ≤ 1 were higher in apremilast-naïve patients (15.4% and 53.8%) than in apremilast-experienced patients (0% and 25%, respectively). Week 104 achieving PASI 75, PASI 90, PASI 100, and absolute PASI ≤ 1 were higher in biologic-naïve patients (84.6%, 57.7%, 15.4%, and 53.8%) than in biologic-experienced patients (25%, 25%, 0%, and 25%, respectively). Deucravacitinib reduced PASI and DLQI through 104 weeks in patients with psoriasis regardless of prior apremilast or biologic therapy, with lower sustainability of PASI 100 or absolute PASI ≤ 1 achievements in patients with prior apremilast or biologic treatment.",
  "pub_date": "2026-02-09",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Department of Dermatology, Fujimoto Dermatology Clinic, Funabashi, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41657209/",
  "snapshot_id": "2026-02-12T14-08-00Z",
  "ingested_at": "2026-02-12T14:08:04.327151+00:00"
}