{
  "pmid": "41591532",
  "title": "Differential clinical factors influencing the effectiveness of distinct biologic agents in psoriasis: insights from a prospective cohort study in China.",
  "abstract": "This prospective multicenter cohort study was conducted to identify and compare clinical factors associated with the effectiveness of commonly used biologics in Chinese patients with moderate-to-severe psoriasis.\nPatients from the SPEECH registry initiating treatment with ixekizumab, secukinumab, guselkumab, or ustekinumab were included.\nGuideline-recommended dosing; 3-month follow-up.\nThe primary endpoint was PASI90 response at 3 months. Multivariable logistic regression estimated adjusted odds ratios (aORs) and 95% confidence intervals (CIs) for clinical predictors of treatment response.\nA total of 717 patients were included in the analysis. In guselkumab-treated patients, obesity (aOR 0.22, 95% CI 0.06-0.78) and prior biologic exposure (aOR 0.22, 95% CI 0.06-0.75) were independently associated with reduced PASI90 response. Psoriatic arthritis predicted poorer response to ustekinumab (aOR 0.16, 95% CI 0.03-0.78). For secukinumab, male sex reduced the likelihood of PASI90 (aOR 0.47, 95% CI 0.23-0.96), whereas family history of psoriasis improved outcomes (aOR 2.20, 95% CI 1.10-4.42). In ixekizumab-treated patients, obesity (aOR 0.38, 95% CI 0.18-0.80) was a negative predictor, while family history (aOR 2.79, 95% CI 1.22-6.38) enhanced treatment response.\nPredictors of biologic effectiveness differ by agent, supporting personalized treatment based on patient characteristics.",
  "pub_date": "2026-01-27",
  "epub_date": null,
  "publication_types": [
    "Journal Article",
    "Multicenter Study",
    "Observational Study"
  ],
  "affiliations": [
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China. gaoyunlu@126.com.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China. gaoyunlu@126.com.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China. gaoyunlu@126.com.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China. yuervictory@163.com.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China. yuervictory@163.com.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China. yuervictory@163.com.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Tongji University School of Medicine, Shanghai, 200443, China. shiyuling1973@tongji.edu.cn.",
    "Institute of Psoriasis, Tongji University School of Medicine, Shanghai, China. shiyuling1973@tongji.edu.cn.",
    "Psoriasis Clinical Research Center, Tongji University, Shanghai, China. shiyuling1973@tongji.edu.cn."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41591532/",
  "snapshot_id": "2026-02-12T16-32-54Z",
  "ingested_at": "2026-02-12T16:32:55.577559+00:00"
}