{
  "pmid": "37083505",
  "title": "New synthetic pharmacotherapeutic approaches to the treatment of moderate-to-severe plaque psoriasis in adults.",
  "abstract": "Psoriasis is a chronic inflammatory and immune-mediated condition affecting 3.2% of the United States population. There are many options for psoriasis treatment including topicals, oral systemic agents, and biologics. A greater understanding of the pathophysiology of psoriasis has led to an increase in the therapeutic options for treatment.\nIn this review, we outline the novel synthetic agents for moderate-to-severe plaque psoriasis and discuss a strategy for implementing these agents in clinical practice. A literature search was performed using PubMed to identify articles relevant to the topic published before October 2022.\nTopicals are first-line for the treatment of moderate-to-severe plaque psoriasis, most commonly including topical steroids, vitamin D analogs, and topical calcineurin inhibitors. While new topical agents have favorable properties, they are not always effective and adherence to topical agents is poor. Biologics are safe and effective, but patients often prefer oral therapy as opposed to injectable medications. Additionally, anti-drug antibodies can reduce effectiveness of biologics over time. Oral medications are preferred, but we now have a high bar for efficacy and safety. Cost is also a barrier for many patients. Recent development of new synthetic treatment options is promising, and we recommend that providers consider these agents as they develop holistic and individualized treatment plans for their patients.",
  "pub_date": "2023-04-27",
  "publication_types": [
    "Review",
    "Journal Article"
  ],
  "affiliations": [
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, USA.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, USA.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, USA.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, USA.",
    "Department of Pathology, Wake Forest University School of Medicine, Winston-Salem, USA.",
    "Department of Social Sciences & Health Policy, Wake Forest University School of Medicine, Winston Salem, USA.",
    "Department of Dermatology, University of Southern Denmark, Odense, Denmark."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37083505/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}