{
  "pmid": "37096862",
  "title": "Recent developments for new investigational JAK inhibitors in psoriatic arthritis.",
  "abstract": "Psoriatic arthritis (PsA) is a chronic inflammatory disease affecting about one-third of subjects with psoriasis. Several treatment modalities targeting Janus Kinase pathways and intracellular inflammatory cascade are now available and under clinical investigation to treat this disease.\nThis review describes ongoing and recently completed phase 2 and 3 randomized clinical trials (RCTs) evaluating the efficacy and safety of approved JAK (Tofacitinib and Upadacitinib) and investigational JAK inhibitors (JAK1 inhibitors: Filgotinib and Ivarmacitinib (SHR0302); TYK2 inhibitors: Brepocitinib (PF-06700841) Deucravacitinib (BMS-986165), and NDI-034858) in PsA through February 2023.\nCurrent standard of care has significantly improved the quality of life in PsA. Recently approved JAK inhibitors for PsA have addressed many of the unmet needs of PsA, particularly of those with severe phenotypes. Preliminary results from several RCTs have reported good and fast efficacy and an acceptable safety profile of investigational JAK inhibitors in PsA. Additional clinical trials and long-term outcome data on these agents are necessary for increasing available therapeutic options for PsA.",
  "pub_date": "2023-05-03",
  "publication_types": [
    "Review",
    "Journal Article"
  ],
  "affiliations": [
    "Rheumatology Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Rheumatology Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Rheumatology, allergology and clinical immunology, Department of Systems Medicine, University of Rome Tor Vergata, Rome, Italy.",
    "ImmunoPharmaLab, Department of Pharmacy, School of Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Rheumatology Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Dermatology Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Rheumatology, allergology and clinical immunology, Department of Systems Medicine, University of Rome Tor Vergata, Rome, Italy.",
    "Rheumatology Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37096862/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}