{
  "pmid": "37168876",
  "title": "Deucravacitinib for the treatment of psoriatic arthritis: the evidence so far.",
  "abstract": "Psoriatic arthritis (PsA) is a heterogeneous disease that may develop in up to 30% of patients with psoriasis. PsA mainly involves peripheral joints; however, axial skeleton and entheses can also be involved. PsA is the result of a complex interplay between an individual's genotype and environmental factors that triggers an immune response and leads to the production of a cytokine cascade. Even though there are about 17 targeted therapies for PsA, a significant percentage of patients fail to respond to such treatments, have a partial response or develop side-effects. This article aims to review the current knowledge on deucravacitinib, a new oral small molecule that selectively inhibits tyrosine kinase 2 (TYK2), for the treatment of PsA. TYK2, a member of the Janus kinase (JAK) family, is responsible for mediating intracellular signalling of cytokines involved in the pathogenesis of PsA and psoriasis, namely IL-12, IL-23, and type I interferons. Recently, deucravacitinib was approved by the FDA for the treatment of moderate-to-severe plaque psoriasis and is currently being evaluated in phase III clinical trials in PsA. In a phase II clinical trial, deucravacitinib showed sustained effectiveness in several domains of PsA, namely arthritis, enthesitis and dactylitis, was well tolerated, and had a favourable safety profile. In patients with psoriasis, deucravacitinib had shown a higher efficacy than placebo and apremilast. Deucravacitinib is a promising therapy, with a unique mechanism of action. Results from the phase III programme and studies evaluating long-term response and head-to-head comparisons with other targeted agents will be important to establishing the position of deucravacitinib in the management of PsA.",
  "pub_date": "2023-05-03",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Rheumatology, Centro Hospitalar Universitário de São João, Porto, Portugal.",
    "Department of Medicine, Faculdade de Medicina da Universidade do Porto, Porto, Portugal.",
    "Department of Dermatology, Centro Hospitalar Universitário do Porto, Porto, Portugal.",
    "Department of Dermatology, Centro Hospitalar Universitário do Porto, Porto, Portugal.",
    "Instituto de Ciências Biomédicas Abel Salazar, University of Porto, Porto, Portugal."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37168876/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}