{
  "pmid": "37287330",
  "title": "TYK2 as a novel therapeutic target in psoriasis.",
  "abstract": "Psoriasis is a chronic inflammatory skin disease affecting approximately 60 million people worldwide. Genome-wide association studies (GWAS) have allowed identification of novel therapeutic targets in psoriasis including tyrosine kinase 2 (TYK2) where an exonic variant within the gene increases the risk of developing psoriasis.\nThis review discusses the role of TYK2 in psoriasis pathogenesis, how that relates to genetic variants and recently published ground-breaking clinical trials of novel TYK2 inhibitors. Keyword searches of PubMed were made until January 2023, using the terms: 'TYK2 inhibitor,' 'TYK2 inhibitor AND psoriasis' and 'TYK2 AND GWAS.' Articles and references have been thoroughly reviewed by the authors.\nThe TYK2 inhibitor deucravacitinib shows promise as an effective oral agent for treating psoriasis. Longer term data are needed to know if thrombotic risk/cancer risk is distinct from other Janus kinase (JAK) inhibitors. Psoriasis is a complex genetic disease for which risk is influenced by genes and environmental factors. GWAS studies have identified several regions of DNA associated with increased risk of disease. We believe that pathway analysis by genetic and genomic means will be key to optimizing TYK2 therapy for the right person at the right time.",
  "pub_date": "2023-06-07",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust, 2 NIHR Manchester Biomedical Research Centre, Manchester University NHS Foundation Trust, Manchester Academic Health Science Centre, Manchester, UK.",
    "Centre for Genetics and Genomics versus Arthritis, Division of Musculoskeletal and Dermatological Sciences, School of Biological Sciences, Faculty of Biology, Medicine and Health, The University of Manchester, Manchester, UK.",
    "Centre for Genetics and Genomics versus Arthritis, Division of Musculoskeletal and Dermatological Sciences, School of Biological Sciences, Faculty of Biology, Medicine and Health, The University of Manchester, Manchester, UK.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust, 2 NIHR Manchester Biomedical Research Centre, Manchester University NHS Foundation Trust, Manchester Academic Health Science Centre, Manchester, UK."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37287330/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}