{
  "pmid": "37927384",
  "title": "JAK Inhibitors in Psoriatic Disease.",
  "abstract": "Psoriasis is now considered to be the cutaneous phenotype of a systemic inflammatory condition, recognized under the term Psoriatic Disease (PsD). PsD has several extracutaneous manifestations, such as inflammatory articular and entheseal involvement, leading to psoriatic arthritis (PsA), and the less frequent intestinal and ocular manifestations with colitis/inflammatory bowel disease and uveitis, respectively. There have also been several reports of an increased frequency of comorbidities such as hypertension, diabetes, dyslipidemia, obesity, metabolic syndrome and cardiovascular manifestations during the course of PsD. The link between psoriasis and related comorbidities is considered a long-term disease sequela, often characterized by an unhealthy lifestyle and a consequence of systemic inflammation; hence, psoriasis requires adequate and prompt treatment, with the aim of controlling not only cutaneous manifestations but also extracutaneous manifestations and systemic inflammation. Pharmacological strategies for PsD have significantly increased over recent years. Recently, the targeted synthetic DMARDs, Janus kinase (JAK) inhibitors, tofacitinib and upadacitinib, were added to the therapeutic armamentarium for treating PsA, and deucravacitinib for psoriasis. These oral agents act directly on inflammatory mechanisms underlining the disease, as antagonists of the intracellular JAK signal pathway and, by STAT phosphorylation, inhibit gene proinflammatory cytokine transcription. JAK inhibitors represent a recent additional treatment strategy for PsD management and, among these, tofacitinib and upadacitinib have recently been approved for PsA, and deucravacitinib for psoriasis. In this review we describe ongoing and recent phase II and III randomized controlled trials (RCTs) evaluating the efficacy and safety of investigational JAK inhibitors in psoriasis and PsA.",
  "pub_date": "2023-10-31",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Immunopharmalab, Department of Pharmacy, School of Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Rheumatology Research Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Rheumatology Research Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Rheumatology Research Unit, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37927384/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}