{
  "pmid": "37981596",
  "title": "Pharmacokinetics and Safety of the Tyrosine Kinase 2 Inhibitor Deucravacitinib in Healthy Chinese Subjects.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, blocks cytokine signaling involved in psoriasis pathogenesis. This ethnic-bridging study evaluated deucravacitinib pharmacokinetics, tolerability, and safety in healthy Chinese subjects.\nThis phase I, double-blind, single-/multiple-dose study randomized healthy Chinese subjects 4:1 to a single dose of deucravacitinib 6 mg or placebo (group 1) or deucravacitinib 12 mg or placebo (group 2) on day 1; groups 1 and 2 received deucravacitinib 6 mg and 12 mg once daily, respectively, or placebo on days 5-19. Blood samples were collected on days 1-5 (0 predose-96 h postdose), day 5 (0-24 h postdose), days 9 and 12 (0 h), and day 19 (0-24 h postdose). Deucravacitinib and metabolite (BMT-153261, BMT-158170) concentrations were determined using liquid chromatography/mass spectrometry; pharmacokinetic parameters were calculated using noncompartmental analysis. Urine was collected on days 1-4 (4 h predose-96 h postdose). Safety was monitored throughout.\nForty healthy Chinese subjects (groups 1 and 2: deucravacitinib, n = 32; placebo, n = 8) were enrolled. Deucravacitinib was rapidly absorbed after single-/multiple-dose administration, with median time to maximal plasma concentration of 1.5-2.3 h. Systemic exposure after single or multiple doses increased approximately twofold with twofold dose increase. Modest deucravacitinib accumulation was observed after multiple-dose administration (1.3- to 1.4-fold increase in area under the curve [AUC] under one dosing interval). Metabolite-to-parent ratios for maximal plasma concentration and AUC remained consistent in each dose group. Mean urinary percent recovery and renal clearance were similar between dose groups. Most adverse events (AEs) were mild/moderate, with no serious treatment-related AEs, deaths, or discontinuations due to AEs.\nDeucravacitinib was safe and well tolerated in healthy Chinese subjects. Deucravacitinib exhibited rapid absorption, dose-related increases in exposure, comparable half-life, and no evidence of time-dependent pharmacokinetics, suggesting minimal effect of Chinese ethnicity on deucravacitinib pharmacokinetics.\nNCT03956953.",
  "pub_date": "2023-11-19",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Clinical Pharmacology Centre, Beijing Anzhen Hospital, Capital Medical University, Beijing, China.",
    "Clinical Pharmacology Centre, Beijing Anzhen Hospital, Capital Medical University, Beijing, China.",
    "Bristol Myers Squibb, 3551 Lawrenceville Road, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, 3551 Lawrenceville Road, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, 3551 Lawrenceville Road, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, 3551 Lawrenceville Road, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, 3551 Lawrenceville Road, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, 3551 Lawrenceville Road, Princeton, NJ, 08540, USA.",
    "Bristol Myers Squibb, 3551 Lawrenceville Road, Princeton, NJ, 08540, USA. Urvi.Aras@bms.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37981596/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}