{
  "pmid": "38122848",
  "title": "Deucravacitinib, a selective, allosteric tyrosine kinase 2 inhibitor, in scalp psoriasis: A subset analysis of two phase 3 randomized trials in plaque psoriasis.",
  "abstract": "Scalp involvement in plaque psoriasis is challenging to treat.\nTo evaluate the efficacy and safety of deucravacitinib (DEUC) in scalp psoriasis.\nPOETYK PSO-1 and PSO-2 were global phase 3, 52-week, double-blinded trials in adults with moderate to severe psoriasis. Patients were randomized 1:2:1 to oral placebo, DEUC 6 mg once daily, or apremilast 30 mg twice daily. This pooled secondary analysis evaluated scalp-specific Physician Global Assessment score of 0 or 1 (0/1), ≥90% improvement from baseline in Psoriasis Scalp Severity Index, and change from baseline in Psoriasis Scalp Severity Index. Adverse events were evaluated through week 16.\nOverall, 1084 patients with moderate to severe scalp psoriasis at baseline were included. At week 16, response rates were greater with DEUC versus placebo or apremilast for scalp-specific Physician Global Assessment 0/1 (64.0% vs 17.3% vs 37.7%; P < .0001), ≥90% improvement from baseline in Psoriasis Scalp Severity Index (50.6% vs 10.5% vs 26.1%; P < .0001), and change from baseline in Psoriasis Scalp Severity Index. Responses were maintained through 52 weeks with continuous DEUC. Safety was consistent with the entire study population.\nLack of data in milder scalp psoriasis.\nDEUC was significantly more efficacious than placebo or apremilast in improving moderate to severe scalp psoriasis and was well tolerated.",
  "pub_date": "2023-12-18",
  "publication_types": [
    "Clinical Trial, Phase III",
    "Journal Article",
    "Randomized Controlled Trial",
    "Research Support, Non-U.S. Gov't"
  ],
  "affiliations": [
    "Oregon Medical Research Center, Portland, Oregon. Electronic address: ablauvelt@oregonmedicalresearch.com.",
    "Oregon Dermatology and Research Center, Portland, Oregon.",
    "Division of Dermatology, UCLA School of Medicine, Dermatology Research Associates, Los Angeles, California.",
    "Department of Dermatology, Yale University School of Medicine, New Haven, Connecticut; Central Connecticut Dermatology Research, Cromwell, Connecticut.",
    "Department of Dermatology, Brigham and Women's Hospital, Brigham Dermatology Associates, Boston, Massachusetts; Department of Dermatology, Harvard Medical School, Boston, Massachusetts.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Department of Geriatric and Environmental Dermatology, Nagoya City University Graduate School of Medical Sciences, Nagoya, Japan.",
    "Department of Dermatology, Venereology and Allergology, Wrocław Medical University, Wrocław, Poland.",
    "Department of Dermatology, Ghent University, Ghent, Belgium.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Bristol Myers Squibb, Princeton, New Jersey.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38122848/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}