{
  "pmid": "38399292",
  "title": "New and Emerging Oral/Topical Small-Molecule Treatments for Psoriasis.",
  "abstract": "The introduction of biologic therapies has led to dramatic improvements in the management of moderate-to-severe psoriasis. Even though the efficacy and safety of the newer biologic agents are difficult to match, oral administration is considered an important advantage by many patients. Current research is focused on the development of oral therapies with improved efficacy and safety compared with available alternatives, as exemplified by deucravacitinib, the first oral allosteric Tyk2 inhibitor approved for the treatment of moderate to severe psoriasis in adults. Recent advances in our knowledge of psoriasis pathogenesis have also led to the development of targeted topical molecules, mostly focused on intracellular signaling pathways such as AhR, PDE-4, and Jak-STAT. Tapinarof (an AhR modulator) and roflumilast (a PDE-4 inhibitor) have exhibited favorable efficacy and safety outcomes and have been approved by the FDA for the topical treatment of plaque psoriasis. This revision focuses on the most recent oral and topical therapies available for psoriasis, especially those that are currently under evaluation and development for the treatment of psoriasis.",
  "pub_date": "2024-02-06",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Hospital de la Santa Creu i Sant Pau, 08041 Barcelona, Spain.",
    "Institut de Recerca Sant Pau (IR SANT PAU), 08041 Barcelona, Spain.",
    "Sant Pau Teaching Unit, School of Medicine, Universitat Autònoma de Barcelona, 08041 Barcelona, Spain.",
    "Department of Dermatology, Hospital de la Santa Creu i Sant Pau, 08041 Barcelona, Spain.",
    "Institut de Recerca Sant Pau (IR SANT PAU), 08041 Barcelona, Spain.",
    "Sant Pau Teaching Unit, School of Medicine, Universitat Autònoma de Barcelona, 08041 Barcelona, Spain.",
    "Department of Dermatology, Hospital de la Santa Creu i Sant Pau, 08041 Barcelona, Spain.",
    "Institut de Recerca Sant Pau (IR SANT PAU), 08041 Barcelona, Spain.",
    "Sant Pau Teaching Unit, School of Medicine, Universitat Autònoma de Barcelona, 08041 Barcelona, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38399292/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}