{
  "pmid": "38499181",
  "title": "Full Guidelines-From the Medical Board of the National Psoriasis Foundation: Perioperative management of systemic immunomodulatory agents in patients with psoriasis and psoriatic arthritis.",
  "abstract": "Systemic immunomodulatory agents are indicated in the treatment of moderate-to-severe plaque psoriasis and psoriatic arthritis. Perioperative use of these medications may increase the risk of surgical site infection (SSI) and complication.\nTo evaluate the risk of SSI and complication in patients with chronic autoimmune inflammatory disease receiving immunomodulatory agents (tumor necrosis factor-alfa [TNF-α] inhibitors, interleukin [IL] 12/23 inhibitor, IL-17 inhibitors, IL-23 inhibitors, cytotoxic T-lymphocyte-associated antigen-4 costimulator, phosphodiesterase-4 inhibitor, Janus kinase inhibitors, tyrosine kinase 2 inhibitor, cyclosporine (CsA), and methotrexate [MTX]) undergoing surgery.\nWe performed a search of the MEDLINE PubMed database of patients with chronic autoimmune inflammatory disease on immune therapy undergoing surgery.\nWe examined 48 new or previously unreviewed studies; the majority were retrospective studies in patients with rheumatoid arthritis and inflammatory bowel disease.\nFor low-risk procedures, TNF-α inhibitors, IL-17 inhibitors, IL-23 inhibitors, ustekinumab, abatacept, MTX, CsA, and apremilast can safely be continued. For intermediate- and high-risk surgery, MTX, CsA, apremilast, abatacept, IL-17 inhibitors, IL-23 inhibitors, and ustekinumab are likely safe to continue; however, a case-by-case approach is advised. Acitretin can be continued for any surgery. There is insufficient evidence to make firm recommendations on tofacitinib, upadacitinib, and deucravacitinib.",
  "pub_date": "2024-03-17",
  "publication_types": [
    "Journal Article",
    "Review",
    "Practice Guideline"
  ],
  "affiliations": [
    "Center for Dermatology Research, Department of Dermatology, Wake Forest School of Medicine, Winston-Salem, North Carolina.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest School of Medicine, Winston-Salem, North Carolina.",
    "Department of Dermatology, University of Miami Miller School of Medicine, Miami, Florida.",
    "Department of Dermatology, Temple University School of Medicine, Philadelphia, Pennsylvania.",
    "Department of Dermatology, Keck School of Medicine at University of Southern California, Los Angeles, California.",
    "Department of Dermatology, Cherry Hills Dermatology, Englewood, Colorado.",
    "Department of Dermatology, Medical University of South Carolina, Charleston, South Carolina.",
    "Department of Dermatology, Brigham and Women's Hospital, Harvard Medical School, Boston, Massachusetts.",
    "Department of Dermatology, 72nd Street Medical Associates, New York, New York.",
    "Department of Dermatology, University of Toronto, Toronto, Canada.",
    "Department of Dermatology, Bellevue Dermatology, Bellevue, Washington.",
    "Department of Dermatology, University of California, San Francisco Medical Center, San Francisco, California.",
    "Department of Dermatology, University of California, Davis, Rocklin, California.",
    "Department of Dermatology, New York University Grossman School of Medicine, New York, New York.",
    "Department of Dermatology, Washington Dermatology Center, Frederick, Maryland.",
    "Department of Dermatology, Dermatology Institute & Skin Care Center, Santa Monica, California.",
    "Department of Dermatology, Illinois Dermatology Institute, LLC, Chicago, Illinois.",
    "Department of Dermatology, Southern California Dermatology, Santa Ana, California.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Department of Dermatology, Glick Skin Institute, Margate, Florida.",
    "Department of Dermatology, Physicians Skin Care, Louisville, Kentucky.",
    "Department of Dermatology, Innovative Dermatology, Plano, Texas.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest School of Medicine, Winston-Salem, North Carolina; Department of Dermatology, Wake Forest School of Medicine, Winston-Salem, North Carolina; Department of Pathology, Wake Forest School of Medicine, Winston-Salem, North Carolina; Department of Social Sciences and Health Policy, Wake Forest School of Medicine, Winston-Salem, North Carolina.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest School of Medicine, Winston-Salem, North Carolina. Electronic address: mlzain01@louisville.edu."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38499181/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}