{
  "pmid": "40066907",
  "title": "Deucravacitinib in plaque psoriasis: Safety and efficacy through 3 years in Japanese patients in the phase 3 POETYK PSO-1, PSO-4, and LTE trials.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, was effective and well tolerated at a dose of 6 mg once daily through 1 year (52 weeks) in patients with moderate to severe plaque psoriasis in the phase 3 POETYK PSO-1 and POETYK PSO-4 trials. Patients completing PSO-1 or PSO-4 could enter the ongoing POETYK long-term extension trial and receive open-label deucravacitinib. Safety and efficacy were evaluated through 3 years (148 weeks; data cutoff date: June 15, 2022) in Japanese patients in these trials. Safety was assessed via adverse events (AEs). Efficacy endpoints, including ≥75% reduction from baseline in the Psoriasis Area and Severity Index (PASI 75) and static Physician Global Assessment (sPGA) score of 0/1 (clear/almost clear), were evaluated in patients receiving continuous deucravacitinib treatment from baseline in PSO-1 and PSO-4 and in PSO-1 patients crossing over from placebo to deucravacitinib at week 16. At data cutoff, 125 patients had received at least one deucravacitinib dose; 86.4% had >24 months and 27.2% had >36 months of total deucravacitinib exposure. Exposure-adjusted incidence rates per 100 person-years for AEs were: any AEs, 188.5; discontinuations attributable to AEs, 3.2; serious AEs, 7.4; serious infections, 1.3; herpes zoster events, 1.6; major adverse cardiovascular events, 0.6; venous thromboembolic events, 0; and malignancies, 1.0. Clinical responses (as observed) were maintained in PSO-1 patients receiving continuous deucravacitinib treatment from baseline (PASI 75: year 1, 88.9%; year 3, 87.5%; sPGA 0/1: year 1, 74.1%; year 3, 66.7%). Year 1 response rates were also maintained through year 3 in PSO-4 patients and in PSO-1 placebo crossovers. Response rates were also consistent using modified nonresponder imputation and treatment failure rules data imputation methodologies. These findings support the consistent safety profile and durable efficacy of deucravacitinib through 3 years in Japanese patients with psoriasis. ClinicalTrials.gov: NCT03624127; NCT03924427; NCT04036435.",
  "pub_date": "2025-03-11",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Multicenter Study",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "Nagoya City University Graduate School of Medical Sciences, Nagoya, Japan.",
    "Fukuoka University Faculty of Medicine, Fukuoka, Japan.",
    "Teikyo University School of Medicine, Tokyo, Japan.",
    "Tokyo Medical University, Tokyo, Japan.",
    "Bristol Myers Squibb, Tokyo, Japan.",
    "Bristol Myers Squibb, Tokyo, Japan.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Jichi Medical University, Tochigi, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40066907/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}