{
  "pmid": "40078858",
  "title": "From the Masterclasses in Dermatology 2024 Meeting: Updates in Psoriasis Treatments.",
  "abstract": "Psoriasis (PsO) is an immune-mediated, chronic inflammatory skin disease that significantly impairs quality of life. Its treatment landscape is rapidly evolving, providing better disease control. Here, we highlight updates in biologics, obtaining coverage for biologics under Medicare, the PsO-to-psoriatic arthritis (PsA) transition, and orally administered drugs, as presented at the 2024 Masterclass in Dermatology in Puerto Rico. We provide a concise overview of the evolving therapeutic landscape and its impact on personalized care for patients with PsO. The toolkit of biologics is expanding, with agents that target interleukin (IL)-17 and IL-23 pathways addressing symptoms across multiple disease domains. Interchangeable biosimilars reduce financial barriers to access, particularly for tumor necrosis factor (TNF) inhibitors. An IL-36 receptor antibody, spesolimab, demonstrates efficacy in generalized pustular psoriasis. Further, Medicare has expanded coverage of certain biologics, addressing challenges to treating patients of this population. PsA is an important comorbidity that can significantly reduce quality of life. Recent studies suggest that biologic therapies-including TNF inhibitors, as well as anti-IL-17, anti-IL-23, and anti-IL-12/23 agents-protect against arthritis onset in PsO patients. In addition to traditional modes of delivery, novel formulations address widespread preference for orally administered therapies. Deucravacitinib, a tyrosine kinase (TYK) 2 inhibitor, is highly selective, effective, and safe. Additionally, JNJ-77242113, an investigational IL-23 receptor antagonist, constitutes an orally administered, targeted biologic therapy. Together, these developments are shaping the future for patients with PsO. It is our goal to simplify the complexities of emerging treatment options, offering clinicians a concise and useful guide for patient management.",
  "pub_date": "2025-02",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Ms. Childs and Dr. Merola are with the Department of Dermatology and Department of Medicine, Division of Rheumatology at UT Southwestern Medical Center in Dallas, Texas.",
    "Ms. Romanelli and Dr. Gottlieb are with the Department of Dermatology and Department of Medicine, Division of Rheumatology at Icahn School of Medicine at Mount Sinai in New York, New York.",
    "Ms. Childs and Dr. Merola are with the Department of Dermatology and Department of Medicine, Division of Rheumatology at UT Southwestern Medical Center in Dallas, Texas.",
    "Ms. Romanelli and Dr. Gottlieb are with the Department of Dermatology and Department of Medicine, Division of Rheumatology at Icahn School of Medicine at Mount Sinai in New York, New York."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40078858/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}