{
  "pmid": "40109802",
  "title": "Therapeutic Advancements in the Management of Psoriasis: A Clinical Overview and Update.",
  "abstract": "Psoriasis is an autoimmune chronic inflammatory skin condition with a strong genetic predisposition. Pathogenesis of psoriasis is complex and multifactorial; it is known that genetic, immunological, and environmental factors play significant roles in its development. Treatment options vary and include topical therapy (e.g., corticosteroids, vitamin D analogs, and calcineurin inhibitors), phototherapy (e.g., narrowband ultraviolet radiation (NB-UVB)), and systemic therapy (e.g., methotrexate and retinoids). Several new treatments have emerged in recent years, including biological treatments. Biologics approved by the United States Food and Drug Administration (FDA) for the treatment of psoriasis include inhibitors of tumor necrosis factor (TNF)-α. Other FDA-approved biologics for the treatment of psoriasis target cytokines, such as the p40 subunit of interleukin (IL)-12 and IL-23, IL-17, as well as the p19 subunit of IL-23. Additionally, the Janus kinase (JAK) inhibitor deucravacitinib is also FDA-approved for the treatment of moderate-to-severe psoriasis. Other promising treatment modalities are consistently undergoing trials. Further therapeutic details, including regimens, side effects, indications, contraindications, and FDA approval dates, are discussed comprehensively in this article. For the purpose of this review, the literature was thoroughly searched for publications discussing psoriasis therapy. This review aims to provide a comprehensive overview and update on the management of psoriasis.",
  "pub_date": "2025-02-16",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Dermatology, Amiri Hospital, Ministry of Health, Kuwait City, KWT.",
    "Dermatology, Amiri Hospital, Ministry of Health, Kuwait City, KWT.",
    "Internal Medicine, Mubarak Al-Kabeer Hospital, Jabriya, KWT."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40109802/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}