{
  "pmid": "40113724",
  "title": "Deucravacitinib: Laboratory Parameters Across Phase 3 Plaque Psoriasis Trials.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, is approved in the USA and other countries for treatment of adults with moderate to severe plaque psoriasis who are candidates for systemic therapy. In POETYK PSO-1 and PSO-2, deucravacitinib was superior to placebo and apremilast and well tolerated in patients with plaque psoriasis. Patients who completed PSO-1/PSO-2 could enroll in the POETYK long-term extension (LTE) trial. This analysis evaluates the effects of deucravacitinib on laboratory parameters.\nPOETYK PSO-1 and PSO-2 were 52-week, phase 3, double-blinded trials that randomized patients 1:2:1 to placebo, deucravacitinib 6 mg once daily, or apremilast 30 mg twice daily. At week 52, eligible patients enrolled in POETYK LTE and received open-label deucravacitinib. Mean changes from baseline in laboratory parameters, laboratory adverse events (AEs), and laboratory AEs resulting in discontinuation were evaluated over 3 years.\nA total of 1519 patients received one or more doses of deucravacitinib across trials. Total exposure over 3 years was 3294.3 person-years. No clinically relevant mean changes were observed in laboratory parameters. Grade ≥ 3 laboratory AEs were infrequent during the 1-year period, with incidence rates remaining stable in patients treated with deucravacitinib through 3 years. Most laboratory AEs remained at the same grade; shifts to higher grades were infrequent, with most increases being to grade ≤ 2. Discontinuations due to laboratory AEs were rare.\nDeucravacitinib did not result in clinically meaningful changes in laboratory parameters over 3 years, including changes seen with Janus kinase (JAK) 1,2,3 inhibitors. Grade ≥ 3 laboratory AEs and discontinuations were rare.\nClinicalTrials.gov identifier, POETYK PSO-1 (NCT03624127), POETYK PSO-2 (NCT03611751), POETYK LTE (NCT04036435).",
  "pub_date": "2025-03-20",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Division of Dermatology, University of California Los Angeles David Geffen School of Medicine, 200 Medical Plaza, Suite 450, Los Angeles, CA, 90095, USA. skinstudy@mednet.ucla.com.",
    "Kimberly and Eric J. Walden Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "Department of Dermatology, Henry Ford Health System, West Bloomfield, IN, USA.",
    "Department of Dermatology, Yale University School of Medicine, New Haven, and Central Connecticut Dermatology Research, Cromwell, CT, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Kimberly and Eric J. Walden Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40113724/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}