{
  "pmid": "40252783",
  "title": "Properties of FDA-approved small molecule protein kinase inhibitors: A 2025 update.",
  "abstract": "Because of the deregulation of protein kinase action in many inflammatory diseases and cancer, the protein kinase family has become one of the most significant drug targets in the 21st century. There are 85 FDA-approved protein kinase antagonists that target about two dozen different enzymes and four of these drugs were approved in 2024 and a fifth was approved in 2025. Of these drugs, five target dual specificity protein kinases (MEK1/2), fourteen inhibit protein-serine/threonine protein kinases, twenty-one block nonreceptor protein-tyrosine kinases, and 45 target receptor protein-tyrosine kinases. The data indicate that 75 of these drugs are prescribed for the treatment of neoplasms. Seven drugs (abrocitinib, baricitinib, deucravacitinib, deuruxolitinib, ritlecitinib, tofacitinib, upadacitinib) are prescribed for the management of inflammatory diseases (atopic dermatitis, rheumatoid arthritis, psoriasis, alopecia areata, and ulcerative colitis). Of the 85 FDA-approved agents, about two dozen are used in the treatment of multiple diseases. The following four drugs received FDA approval in 2024 - deuruxolitinib (alopecia areata), ensartinib and lazertinib (non-small cell lung cancer), and tovorafenib (pediatric glioma) while mirdametinib was approved in 2025 for the treatment of type I neurofibromatosis (von Recklinghausen disease). Apart from netarsudil, temsirolimus, and trilaciclib, the approved protein kinase blockers are orally bioavailable. This article summarizes the physicochemical properties of all 85 FDA-approved small molecule protein kinase inhibitors including the molecular weight, number of hydrogen bond donors/acceptors, ligand efficiency, lipophilic efficiency, polar surface area, and solubility. A total of 39 of the 85 FDA-approved drugs have a least one Lipinski rule of 5 violation.",
  "pub_date": "2025-04-17",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Blue Ridge Institute for Medical Research, 221 Haywood Knolls Drive, Hendersonville, NC 28791, United States. Electronic address: rrj@brimr.org."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40252783/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}