{
  "pmid": "40571687",
  "title": "Psoriasis.",
  "abstract": "Plaque psoriasis is a chronic, immune-mediated inflammatory skin disease that has considerable effects on patients' physical, psychological and social well-being. It is strongly influenced by genetic predisposition, with HLA-C*06:02 showing the strongest association, particularly in those with early-onset disease. Additional susceptibility loci, including IL23A, IL12B and IL17RA, are linked to dysregulation of the IL-23-T helper 17 axis, which contributes to chronic inflammation and keratinocyte hyperproliferation. Plaque psoriasis is frequently associated with psoriatic arthritis and other comorbidities, such as cardiovascular disease, metabolic syndrome and psychiatric disorders, all of which contribute to increased morbidity and mortality. Management strategies are tailored to disease severity and the presence of comorbidities. For mild disease, topical therapies remain the first-line treatment, including corticosteroids, vitamin D analogues and topical calcineurin inhibitors. New non-steroidal agents, such as topical PDE4 and aryl hydrocarbon receptor agonists, offer additional options. In moderate-to-severe disease, oral systemic therapies, such as methotrexate, ciclosporin, acitretin, apremilast and deucravacitinib, provide a range of immunomodulatory effects. Biologic therapies targeting TNF, IL-17, IL-23 and IL-12/23 have demonstrated high efficacy in improving both cutaneous and systemic inflammation. Current research on systemic therapies is focused on the development of additional inhibitors of the Tyk2 pathway and inhibitors to IL-23 receptor, IL-17, and TNF. Early screening for psoriatic arthritis, proactive cardiovascular risk reduction and multidisciplinary care are crucial to optimizing long-term outcomes. Ongoing research continues to advance precision medicine approaches, with the goal of enhancing treatment durability and improving quality of life for individuals living with psoriasis.",
  "pub_date": "2025-06-26",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Division of Dermatology, Department of Medicine, University of California Los Angeles David Geffen School of Medicine, Los Angeles, CA, USA. armstrongpublication@gmail.com.",
    "Blauvelt Consulting LLC, Annapolis, MD, USA.",
    "National Psoriasis Foundation, Alexandria, VA, USA.",
    "Department of Dermatology, University of Utah Spencer F. Eccles School of Medicine, Salt Lake City, UT, USA.",
    "Department of Dermatology, Chang Gung Memorial Hospital and College of Medicine, Chang Gung University, Taoyuan City, Taiwan.",
    "Leeds Centre for Dermatology, University of Leeds, Leeds, UK.",
    "Duke University School of Medicine, Durham, NC, USA.",
    "Department of Dermatology, UT Southwestern Medical Center, Dallas, TX, USA.",
    "Division of Rheumatology, Department of Medicine, UT Southwestern Medical Center, Dallas, TX, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40571687/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}