{
  "pmid": "40672022",
  "title": "Identifying Predictive Factors for Complete Skin Clearance at Week 52 by Deucravacitinib in Moderate-to-Severe Psoriasis: A Prospective Observational Study.",
  "abstract": "Deucravacitinib, an oral selective tyrosine kinase 2 inhibitor, is effective for moderate-to-severe psoriasis. However, not all patients can achieve complete skin clearance (CSC) by deucravacitinib even after long-term treatment (one year). Therefore, we sought to determine predictive baseline factors of achieving CSC (Psoriasis Area and Severity Index score 0) at week 52.\nIn this prospective single‑center study (December 2022 - February 2025), we enrolled 77 patients aged ≥ 15 years and treated them with deucravacitinib 6 mg once daily. Baseline demographic, clinical, and laboratory factors were compared between patients who achieved CSC at week 52 and those who did not.\nSeventy-seven patients aged ≥ 15 years with moderate to severe psoriasis received deucravacitinib 6 mg once daily, and 15 patients achieved CSC at week 52. We compared patients' background factors and baseline clinical and laboratory indices between week 52 CSC achievers and non-achievers. The age (years) of week 52 CSC achievers (median: 55.0; IQR: 45.0-65.5) was significantly younger compared to non-achievers (median: 67.0; IQR: 55.3-76.0) (p = 0.0461, by Mann-Whitney U test; area under the curve (AUC) = 0.667). Additionally, the body mass index (BMI) of week 52 CSC achievers (median: 20.9; IQR: 18.3-22.9) was significantly lower compared to non-achievers (median: 23.6; IQR: 22.0-27.1) (p = 0.00571, by Mann-Whitney U test; AUC = 0.733). Compared to non-achievers, week 52 CSC achievers showed higher and faster improvements of nail, scalp, and genital lesions and quality of life, evaluated by the Dermatology Life Quality Index.\nA BMI < 22.9 kg/m² and age < 61 years independently identify patients most likely to obtain CSC at week 52 with deucravacitinib. These cut‑offs can support early treatment selection and stratification in future prospective trials, facilitating personalized care for psoriasis.",
  "pub_date": "2025-06-15",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, JPN.",
    "Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, JPN.",
    "Dermatology, Nippon Medical School, Tokyo, JPN.",
    "Dermatology, Fujimoto Dermatology Clinic, Funabashi, JPN.",
    "Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, JPN."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40672022/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}