{
  "pmid": "40767824",
  "title": "Systemic pharmacological treatments for chronic plaque psoriasis: a network meta-analysis.",
  "abstract": "Psoriasis is an immune-mediated disease with either skin or joints manifestations, or both, and it has a major impact on quality of life. Although there is currently no cure for psoriasis, various treatment strategies allow sustained control of disease signs and symptoms. Despite multiple available treatments, their comparative efficacies and safety remain unclear due to the limited number of direct comparisons. We conducted a network meta-analysis to comprehensively compare systemic treatments.\nTo compare the benefits and harms of non-targeted systemic agents, targeted synthetic agents, and biologic targeted treatments for people with moderate-to-severe psoriasis using a network meta-analysis, and to rank these treatments according to their benefits and harms.\nFor this update of the living systematic review, we updated our searches monthly up to July 2024 in the following databases and trial registers: CENTRAL, MEDLINE, Embase, ClinicalTrials.gov, and WHO ICTRP.\nRandomised controlled trials of systemic pharmacological treatments in adults over 18 years of age with moderate-to-severe plaque psoriasis, at any stage of treatment, compared to placebo or another active agent, irrespective of dose and duration.\nThe critical outcomes were proportion of participants who achieved clear or almost clear skin, that is, at least Psoriasis Area and Severity Index (PASI) 90 and proportion of participants with serious adverse events (SAEs) at induction phase (8 to 24 weeks after randomisation).\nWe used the Cochrane RoB 2 tool.\nWe conducted study selection, data extraction, risk of bias assessment, and analysis in duplicate. We synthesised data using pairwise and network meta-analyses to compare treatments and rank them according to effectiveness (PASI 90 score) and acceptability (inverse of SAEs). We assessed the certainty of network meta-analysis evidence for the two critical outcomes and all comparisons using CINeMA, as very low, low, moderate, or high. We contacted study authors when data were unclear or missing. We used the surface under the cumulative ranking curve (SUCRA) to infer treatment hierarchy, from 0% (worst for effectiveness or safety) to 100% (best for effectiveness or safety).\nThis update includes 26 new studies, taking the total number of included studies to 204, and randomised participants to 67,889 (67% men), mainly recruited from hospitals. The average age was 44.4 years, and the mean PASI score at baseline was 20.5 (range: 9.5 to 40). Most studies were placebo-controlled (56%). We assessed 26 treatments. Most (171) trials were multicentric (2 to 231 centres). Most studies (157/204) declared funding by a pharmaceutical company, and 27 studies did not report a funding source.\nNetwork meta-analysis at class level demonstrated that all interventions had a higher proportion of participants reaching PASI 90 than placebo. Anti-interleukin (IL)17 treatment showed a higher proportion of participants reaching PASI 90 compared to all the interventions. Biologic treatments anti-IL17, anti-IL12/23, anti-IL23, and anti-tumour necrosis factor (TNF)-alpha showed a higher proportion of participants reaching PASI 90 than the non-targeted systemic agents and the targeted systemic agents. For reaching PASI 90, the most effective drugs when compared to placebo were (in SUCRA rank order): infliximab (moderate-certainty evidence), xeligekimab (moderate-certainty), bimekizumab (high-certainty), ixekizumab (moderate-certainty), and risankizumab (moderate-certainty). Clinical effectiveness of these drugs was similar when compared against each other. There was evidence of a difference in favour of bimekizumab, ixekizumab, and risankizumab compared to secukinumab, brodalumab, and guselkumab in achieving PASI 90. Infliximab, anti-IL17 drugs (bimekizumab, ixekizumab, secukinumab, sonelokimab, brodalumab), and anti-IL23 drugs (risankizumab and guselkumab) showed evidence of a difference in achieving PASI 90 compared to ustekinumab, tildrakizumab, three anti-TNF-alpha agents (adalimumab, certolizumab, and etanercept), and deucravacitinib. Ustekinumab was superior to certolizumab. Adalimumab, tildrakizumab, and ustekinumab were superior to etanercept, deucravacitinib, and apremilast. Ciclosporin and methotrexate were superior to apremilast for reaching PASI 90. We found no evidence of a difference between any of the interventions and the placebo for the risk of SAEs. Nevertheless, the SAEs analyses were based on a very low number of events with low-certainty evidence for most comparisons. Therefore, the findings must be viewed with caution. For PASI 90, 31% of studies (51/165) had a high risk of bias, 34% (56 studies) had some concerns, and 35% (58) had low risk. For SAEs, 57% (94/169) had a high risk of bias, 31% (53 studies) had some concerns, and 13% (22 studies) had low risk.\nOur review shows that, compared to placebo, the biologics infliximab, xeligekimab, bimekizumab, ixekizumab, and risankizumab were the most effective treatments for achieving PASI 90 in people with moderate-to-severe psoriasis, with high-certainty evidence for bimekizumab and moderate-certainty evidence for infliximab, xeligekimab, ixekizumab, and risankizumab. This network meta-analysis evidence is limited to induction therapy (outcomes measured from 8 to 24 weeks after randomisation), and is not sufficient for evaluating longer-term outcomes in this chronic disease. Moreover, we found low numbers of studies for some of the interventions, and the young age (mean 44.4 years) and high level of disease severity (PASI 20.5 at baseline) may not be typical of people seen in daily clinical practice. More randomised trials directly comparing active agents are needed, and these should include systematic subgroup analyses (sex, age, ethnicity, comorbidities, psoriatic arthritis). To provide long-term information on the safety of treatments included in this review, an evaluation of non-randomised studies is needed. Our confidence in the results for non-targeted systemic treatments is limited due to concerns regarding study conduct. Further research is warranted and may modify these findings. Editorial note: this is a living systematic review. Living systematic reviews offer a new approach to review updating, in which the review is continually updated, incorporating relevant new evidence as it becomes available. Please refer to the Cochrane Database of Systematic Reviews for the current status of this review.\nThis Cochrane review obtained funding from the French Society of Dermatology and the French Ministry of Health.\nThe previous version of this Living Systematic Review is available via DOI 10.1002/14651858.CD011535.pub6.",
  "pub_date": "2025-08-06",
  "publication_types": [
    "Comparative Study",
    "Journal Article",
    "Network Meta-Analysis",
    "Systematic Review",
    "Research Support, Non-U.S. Gov't"
  ],
  "affiliations": [
    "Department of Dermatology, AP-HP Hôpital Henri Mondor, Créteil, France.",
    "Clinical Investigation Centre, AP-HP Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Université de Paris, Centre of Research in Epidemiology and Statistics (CRESS), INSERM, F-75004, Paris, France.",
    "Cochrane France, Paris, France.",
    "Department of Dermatology, AP-HP Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Medical Library, Department of Medical Education, Linkou Chang Gung Memorial Hospital, Taoyuan, Taiwan.",
    "Department of Dermatology, AP-HP Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Department of Intensive Care Medicine, University College London, Hospitals NHS Foundation Trust, London, UK.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Department of Dermatology, AP-HP Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Department of Dermatology, Montpellier University Hospital and Montpellier University, Montpellier, France.",
    "c/o Cochrane Skin Group, The University of Nottingham, Nottingham, UK.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Department of Dermatology, AP-HP Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40767824/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}