{
  "pmid": "40836369",
  "title": "A Review of Phase III and Long-Term Data for Deucravacitinib for Plaque Psoriasis.",
  "abstract": "Deucravacitinib, an oral, selective tyrosine kinase 2 (TYK2) inhibitor, represents a novel approach to systemic psoriasis treatment, offering the advantages of oral administration and selective inhibition of cytokine signaling pathways involved in psoriasis pathogenesis. This review evaluates the efficacy and safety of deucravacitinib based on findings from phase III clinical trials, including POETYK PSO-1, PSO-2, PSO-4, and long-term extension studies. In these trials, deucravacitinib demonstrated superior efficacy compared to placebo and apremilast, with a significantly higher proportion of patients achieving ≥ 75% improvement in Psoriasis Area and Severity Index (PASI 75). Long-term data suggest sustained efficacy through 3 years of continuous treatment. Deucravacitinib was well tolerated, with a safety profile characterized by low rates of serious adverse events, including infections and major cardiovascular events. The most common adverse events included nasopharyngitis, upper respiratory tract infections, and acne, with herpes zoster occurring at a low incidence. The results of the phase III trials support deucravacitinib as an effective oral alternative to biologic therapies, with sustained efficacy and a favorable safety profile. Future studies should explore head-to-head comparisons with interleukin (IL)-17 and IL-23 inhibitors to define their role in psoriasis management better.",
  "pub_date": "2025-08-20",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Loma Linda University School of Medicine, Loma Linda, California, USA.",
    "Loma Linda University School of Medicine, Loma Linda, California, USA.",
    "Albany Medical College, Albany, New York, USA.",
    "Tulane University School of Medicine, New Orleans, Louisiana, USA.",
    "Indiana University School of Medicine, Indianapolis, Indiana, USA.",
    "Department of Dermatology, Miller School of Medicine, Miami, Florida, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40836369/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}