{
  "pmid": "41327887",
  "title": "Targeting the JAK/STAT pathway in palmoplantar pustulosis: a review.",
  "abstract": "Palmoplantar pustulosis (PPP) is a chronic, relapsing inflammatory dermatosis characterized by recurrent sterile pustules localized to the palms and soles, accompanied by significant pain and psychological burden. Refractory PPP remains a therapeutic challenge, particularly in patients unresponsive to conventional systemic agents and biologics. Recent clinical observations have explored the use of Janus kinase inhibitors (JAKi), which target key cytokine pathways implicated in PPP pathogenesis. This review summarizes and critically examines the emerging clinical evidence for JAK inhibitors in PPP, mechanistic basis, therapeutic efficacy and safety.\nWe collected relevant studies by searching literature published on PubMed, Embase, Cochrane Library, Google Scholar and USFDA websites up to July 2025.\nRecent clinical case reports and early studies have shown favourable outcomes with JAK inhibitors, such as tofacitinib, upadacitinib, baricitinib, deucravacitinib and abrocitinib, in refractory PPP cases. These oral agents offer broad immunomodulation, rapid onset of action and reversibility, with some patients achieving complete remission after failing conventional therapies. Tofacitinib shows the most rapid and durable responses, generally achieving cutaneous resolution within 2-4 weeks, including in patients with coexisting pustulotic arthro-osteitis (PAO) and SAPHO syndrome. Selective JAK1 inhibitors, such as upadacitinib and abrocitinib, have also shown significant improvement in PPP and associated conditions, with some patients achieving complete remission and good tolerability even in the elderly. While generally well tolerated, potential adverse events such as elevated cholesterol, herpes zoster and cardiovascular risks require careful monitoring.\nJAK inhibitors emerge as a promising therapeutic strategy for PPP, due to their ability to block multiple inflammatory pathways simultaneously, especially where other cytokine-targeted therapies have failed. However, despite compelling early reports, larger controlled trials are essential to establish definitive efficacy, clarify long-term safety and optimize clinical use.",
  "pub_date": "2025-12-01",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Yijishan Hospital, the First Affiliated Hospital of Wannan Medical College, Wuhu, Anhui Province, China.",
    "Department of Dermatology, Yijishan Hospital, the First Affiliated Hospital of Wannan Medical College, Wuhu, Anhui Province, China.",
    "Department of Dermatology, Yijishan Hospital, the First Affiliated Hospital of Wannan Medical College, Wuhu, Anhui Province, China.",
    "Department of Dermatology, Yijishan Hospital, the First Affiliated Hospital of Wannan Medical College, Wuhu, Anhui Province, China.",
    "Department of Dermatology, Yijishan Hospital, the First Affiliated Hospital of Wannan Medical College, Wuhu, Anhui Province, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41327887/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}