{
  "pmid": "41531416",
  "title": "S3 Guideline for the treatment of psoriasis vulgaris, adapted from EuroGuiDerm - part 1: Treatment recommendations and monitoring.",
  "abstract": "This first part of the updated German S3 guideline on the treatment of psoriasis vulgaris covers the sections on treatment recommendations, treatment goals, and monitoring of therapies. The recommendations are based on the current Cochrane network meta-analysis, the results of which are also summarized. When selecting systemic therapies for psoriasis vulgaris, the guideline emphasizes consideration of efficacy, safety, comorbidities, and individual patient factors. The decision framework is presented in the treatment options overview, and in this updated version, the possibility of first-line therapy with biologics or novel targeted small molecules is more prominently highlighted. Standardized instruments for assessing disease severity, as well as patient-centered treatment goals, are underscored. A Psoriasis Area and Severity Index (PASI) 75 response is defined as the minimum therapeutic target, while PASI 90 or an absolute PASI <2 are considered desirable goals. Since the last version, two newly approved agents, bimekizumab and deucravacitinib, have been incorporated, accompanied by specific usage recommendations. Among the established therapies, guidance on methotrexate has been extensively revised, particularly regarding administration, dosing, and monitoring. This guideline aims to provide clinicians with an evidence-based framework for therapy selection and monitoring, while strengthening shared decision-making with patients.",
  "pub_date": "2026-01",
  "publication_types": [
    "Journal Article",
    "Practice Guideline"
  ],
  "affiliations": [
    "Division of Evidence-Based Medicine (dEBM), Department of Dermatology, Venereology and Allergology, Charité - Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany.",
    "Department of Dermatology, Venereology and Allergology, Dessau Municipal Hospital, Dessau, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany.",
    "Dermatology Center Berlin Siddi & Bachmann, Berlin, Germany.",
    "Service de Dermatologie et Vénéréologie, Hôpitaux Universitaires de Genève, Geneva, Switzerland.",
    "Department of Gastroenterology, Hepatology and Endocrinology, Hannover Medical School, Hannover, Germany.",
    "Department of Internal Medicine, Tropical Medicine and Infectious Diseases, Rostock University Medical Center, Rostock, Germany.",
    "German Central Committee against Tuberculosis (DZK), Berlin, Germany.",
    "Rheumatology Center in conformity with G-BA, Department of Rheumatology, Clinical Immunology and Physical Therapy, Marienhaus Hospital Mainz, Mainz, Germany.",
    "German Psoriasis Federation, Hamburg, Germany.",
    "Division of Rheumatology, Immunology - Inflammation Medicine, University Hospital Frankfurt Goethe University, Frankfurt am Main, Germany.",
    "Fraunhofer Institute for Translational Medicine and Pharmacology ITMP Frankfurt, Frankfurt am Main, Germany.",
    "Dermatology Office, Duisburg, Germany.",
    "Psoriasis Center, Department of Dermatology, Venereology, Allergology, University Hospital Schleswig-Holstein, Campus Kiel, Kiel, Germany.",
    "Department of Dermatology and Allergy, Hospital Hanau, Hanau, Germany.",
    "Division of Evidence-Based Medicine (dEBM), Department of Dermatology, Venereology and Allergology, Charité - Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany.",
    "Dermatology Office, Oranienburg, Germany.",
    "Helios Versorgungszentren GmbH, MVZ Gotha, Gotha, Germany.",
    "Dermatology Office, Osnabrück, Germany.",
    "German Central Committee against Tuberculosis (DZK), Berlin, Germany.",
    "Dermatology Office, Oldenburg, Germany.",
    "Berolina Hospital, Löhne, Germany.",
    "Dermatology Office, Mahlow, Germany.",
    "Department of Dermatology and Allergology, University Hospital Augsburg, Augsburg, Germany.",
    "Dermatology Office, Selters, Germany.",
    "German Psoriasis Federation, Hamburg, Germany.",
    "Division of Evidence-Based Medicine (dEBM), Department of Dermatology, Venereology and Allergology, Charité - Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41531416/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}