{
  "pmid": "41596733",
  "title": "Systemic Treatment Strategies for Patients with Psoriasis and Psoriatic Arthritis in the Setting of ANA Positivity or Lupus Spectrum Disease: A Comprehensive Systematic Review.",
  "abstract": "Psoriasis and psoriatic arthritis (PsA) occasionally coexist with antinuclear antibody (ANA) positivity, cutaneous lupus erythematosus (CLE), or systemic lupus erythematosus (SLE), creating one of the most challenging therapeutic overlap scenarios in immunodermatology. Divergent immune pathways-IL-23/Th17-driven psoriatic inflammation versus type I interferon-mediated autoimmunity-generate unique vulnerabilities when systemic treatments are used. To synthesize treatment outcomes, lupus-related safety signals, and mechanistic insights across systemic therapies in patients with psoriasis or PsA who also exhibit ANA positivity, CLE, or SLE. A systematic review following PRISMA 2020 guidelines was conducted across PubMed/MEDLINE, Embase, the Cochrane Library, Scopus, and ClinicalTrials.gov from database inception through 31 October 2025. Thirty-three eligible reports (29 unique clinical studies; 1429 patients) were included and organized into six prespecified overlap subgroups. Mechanistic and translational studies-including ustekinumab and deucravacitinib SLE trial data and reports of IL-17 inhibitor-associated CLE-were reviewed separately to provide contextual interpretation. IL-23 inhibitors were consistently associated with a favorable cross-disease safety profile, with no clear signal for CLE worsening, SLE flares, or drug-induced autoimmunity. IL-17 inhibitors maintained strong psoriatic efficacy but were associated with an increased frequency of de novo or exacerbated CLE. TNF-α inhibitors showed the strongest association with ANA seroconversion, anti-dsDNA induction, drug-induced lupus, and lupus flares. Ustekinumab demonstrated a stable safety profile across lupus-spectrum disease despite variable efficacy in formal SLE trials. TYK2 inhibition provided dual modulation of IL-23 and type I interferon pathways and showed emerging utility in psoriasis or PsA coexisting with CLE or SLE. Apremilast, methotrexate, and mycophenolate mofetil remained reliable non-biologic systemic options. Phototherapy was associated with potential risk in ANA-positive or lupus-susceptible populations and therefore requires careful consideration. Interpretation is limited by the predominantly observational nature and heterogeneity of the available evidence. IL-23 inhibition and TYK2 inhibition appear to offer a balanced profile of efficacy and lupus-related safety in psoriatic disease complicated by lupus-spectrum autoimmunity. IL-17 inhibitors and TNF-α inhibitors may be associated with higher risk in CLE- or SLE-prone patients and therefore warrant particular caution. Personalized treatment strategies should integrate the relative dominance of psoriatic versus lupus disease, ANA/ENA profile, CLE subtype, and underlying mechanistic considerations. Prospective, biomarker-driven studies are needed to guide therapy in this increasingly recognized overlap population (PROSPERO registration: CRD420251241279).",
  "pub_date": "2026-01-22",
  "publication_types": [
    "Journal Article",
    "Systematic Review",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, National Taiwan University Hospital and National Taiwan University College of Medicine, Taipei 100225, Taiwan.",
    "Department of Dermatology, National Taiwan University Hospital and National Taiwan University College of Medicine, Taipei 100225, Taiwan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41596733/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}