{
  "pmid": "41648065",
  "title": "Emerging Targets in Psoriatic Arthritis: Dual IL-17A/F and Selective TYK2 Inhibition in a Clinical Perspective.",
  "abstract": "Psoriatic arthritis (PsA) is a multifaceted immune-mediated inflammatory disease with several unmet therapeutic needs, and many patients fail to achieve comprehensive disease control with existing treatments. This has driven the exploration of novel therapeutic targets deriving from a better understanding of the immunopathogenetic cascade. Two of the most promising emerging targets are the dual inhibition of interleukin-17A and F (IL-17A/F) and the selective inhibition of tyrosine kinase 2 (TYK2). Bimekizumab, a monoclonal antibody that neutralises both IL-17A and IL-17F, has demonstrated superior efficacy over placebo and a standard-of-care TNF inhibitor in pivotal Phase III trials, achieving high rates of both joint and skin response. Its safety profile is characterised by a manageable increase in mild-to-moderate fungal infections, particularly oral candidiasis. Deucravacitinib, an oral, allosteric TYK2 inhibitor, represents a novel mechanism of action that modulates key cytokine pathways (IL-23, IL-12, Type I IFN) without inhibiting JAKs 1-3. Phase II and preliminary phase III data in PsA show significant improvements in joint and skin symptoms, with a safety profile from long-term psoriasis studies that appears favourable, showing minimal hematologic or laboratory abnormalities. The advent of bimekizumab and deucravacitinib enriches the PsA treatment arsenal and their introduction will help with more personalised management strategies for patients with PsA.",
  "pub_date": "2026-01-08",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Clinical Immunology - Rheumatology Unit, 2 Department of Medicine and Laboratory, National and Kapodistrian University of Athens, School of Medicine, \"Hippokration\" General Hospital of Athens, Greece.",
    "Clinical Immunology - Rheumatology Unit, 2 Department of Medicine and Laboratory, National and Kapodistrian University of Athens, School of Medicine, \"Hippokration\" General Hospital of Athens, Greece.",
    "Clinical Immunology - Rheumatology Unit, 2 Department of Medicine and Laboratory, National and Kapodistrian University of Athens, School of Medicine, \"Hippokration\" General Hospital of Athens, Greece."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41648065/",
  "snapshot_id": "2026-02-12T15-06-31Z",
  "ingested_at": "2026-02-12T15:06:35.632022+00:00"
}