{
  "pmid": "41343116",
  "title": "Effectiveness of Tofacitinib in Patients with Psoriatic Arthritis Initiating Monotherapy Versus Combination Therapy: Results from the CorEvitas Psoriatic Arthritis/Spondyloarthritis Registry.",
  "abstract": "This study evaluated the real-world effectiveness of tofacitinib monotherapy versus combination therapy in patients with psoriatic arthritis (PsA) enrolled in the CorEvitas PsA/Spondyloarthritis Registry.\nThis study (NCT05195814) included adult patients with PsA initiating tofacitinib (from December 14, 2017 to October 1, 2023) as monotherapy, or in combination with oral small molecules (OSMs: methotrexate, leflunomide, sulfasalazine, hydroxychloroquine, and apremilast). Patients with baseline and 6-month follow-up visits (± 3 months) were included.\nmean change from baseline (∆) in/proportions achieving, disease activity measures (including body surface area [BSA] = 0%), and patient-reported outcomes. Continuous endpoints at month 6 were analyzed as ∆ with an analysis of covariance model including treatment and baseline value as covariates. ∆ in least squares (LS) means and adjusted LS means/odds ratios are presented.\nThe study included 141 patients (66/141 monotherapy; 75/141 combination therapy). Patients were predominantly female (61.0%) and white (94.3%), and average age was 56.7 years. More monotherapy initiators were OSM treatment-naïve and had higher mean Patient Global Assessment of Arthritis, compared with combination therapy initiators. By 6 ± 3 months, 28.8% and 25.3% of monotherapy and combination therapy initiators, respectively, discontinued tofacitinib. At 6 ± 3 months, 15.0% of monotherapy initiators achieved minimal disease activity, and 27.1% had BSA = 0%. Corresponding data for combination therapy initiators were 20.7%, and 22.0%, respectively. Differences between groups were not significant. LS mean differences from baseline in overall work impairment/activity impairment were - 13.0/- 21.8 and 1.4/- 2.9 for monotherapy and combination therapy initiators, respectively.\nMonotherapy and combination therapy initiators demonstrated improvements across effectiveness outcomes. Tofacitinib monotherapy initiators experienced numerical improvements in overall work impairment/activity impairment. This highlights tofacitinib effectiveness as monotherapy/combination therapy for a diverse PsA population. However, the small sample size limited the statistical power, and so results should be interpreted cautiously.\nClinicalTrials.gov identifier, NCT05195814.",
  "pub_date": "2025-12-04",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Departments of Medicine/Rheumatology, Perelman School of Medicine, University of Pennsylvania, 3400 Spruce St., White Building, Rm 5023, Philadelphia, PA, 19104, USA. Alexis.Ogdie@pennmedicine.upenn.edu.",
    "CorEvitas, Waltham, MA, USA.",
    "CorEvitas, Waltham, MA, USA.",
    "CorEvitas, Waltham, MA, USA.",
    "Pfizer Inc, New York, NY, USA.",
    "Pfizer Inc, New York, NY, USA.",
    "Pfizer Inc, Montreal, QC, Canada.",
    "Pfizer Inc, Collegeville, PA, USA.",
    "Rheumatology Research, Swedish Medical Center/Providence St. Joseph Health, University of Washington School of Medicine, Seattle, WA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41343116/",
  "snapshot_id": "2026-02-12T15-21-04Z",
  "ingested_at": "2026-02-12T15:21:06.169368+00:00"
}