{
  "pmid": "41369155",
  "title": "Results from the 32-week, phase 3 DISCREET study of apremilast in patients with moderate to severe genital psoriasis.",
  "abstract": "Genital psoriasis is highly prevalent among patients with psoriasis, is often stigmatized, causes pain and discomfort and negatively impacts quality of life. Apremilast is an oral phosphodiesterase 4 inhibitor approved for treating psoriasis and has demonstrated safety and efficacy in treating genital psoriasis, as seen in the primary 16-week DISCREET results.\nTo assess the efficacy and safety of apremilast 30 mg twice daily in patients with moderate to severe genital psoriasis over the 32-week study duration.\nDISCREET was a phase 3, multicentre, randomized, double-blind trial that evaluated apremilast 30 mg twice daily versus placebo in a 16-week placebo-controlled phase (randomization 1:1) followed by a 16-week apremilast extension phase. Patients had moderate to severe genital psoriasis, defined as a modified static Physician's Global Assessment of Genitalia (genital PGA) score of ≥3. They also either had disease inadequately controlled by or were intolerant to topical therapy. We report the results through Week 32.\nOf 289 patients randomized, 229 continued to the apremilast extension phase (Weeks 16-32): 110 in the placebo/apremilast group and 119 in the apremilast/apremilast group. At 32 weeks, 51.8% (95% CI: 42.6, 60.9) of patients in the placebo/apremilast group and 40.3% (95% CI: 32.0, 49.3) of patients in the apremilast/apremilast group had achieved a modified genital PGA response (score of 0/1 with ≥2-point reduction from baseline). At Week 32, similar improvements in skin, genital signs and symptoms and quality of life were observed in patients who started apremilast at Week 16 or at randomization. Frequently reported treatment-emergent adverse events during all-apremilast exposure were diarrhoea (25.4%), nausea (19.4%) and headache (17.9%).\nApremilast is an effective oral systemic therapy in patients with moderate to severe genital psoriasis and has shown consistent clinical efficacy, lessening of symptoms and quality-of-life benefit in DISCREET.\nNCT03777436.",
  "pub_date": "2025-12-10",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Randomized Controlled Trial",
    "Multicenter Study"
  ],
  "affiliations": [
    "Division of Rheumatology, Department of Dermatology, UT Southwestern Medical Center, Dallas, Texas, USA.",
    "Division of Rheumatology, Department of Medicine, UT Southwestern Medical Center, Dallas, Texas, USA.",
    "Guenther Research Inc., London, Ontario, Canada.",
    "Lynde Institute for Dermatology, Markham, Ontario, Canada.",
    "Probity Medical Research, Markham, Ontario, Canada.",
    "Probity Medical Research, Waterloo, Ontario, Canada.",
    "Alliance Clinical Trials, Waterloo, Ontario, Canada.",
    "Division of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, Ontario, Canada.",
    "Paddington Testing Company, Inc., Philadelphia, Pennsylvania, USA.",
    "Dermatology Institute & Skin Care Center, Santa Monica, California, USA.",
    "Amgen Inc., Thousand Oaks, California, USA.",
    "Amgen Inc., Thousand Oaks, California, USA.",
    "Amgen Inc., Thousand Oaks, California, USA.",
    "Amgen Inc., Thousand Oaks, California, USA.",
    "Amgen Inc., Thousand Oaks, California, USA.",
    "University Hospital of the Goethe University, Frankfurt am Main, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41369155/",
  "snapshot_id": "2026-02-12T15-21-04Z",
  "ingested_at": "2026-02-12T15:21:06.169368+00:00"
}