{
  "pmid": "41645401",
  "title": "Real-world effectiveness and safety of guselkumab in adult patients with facial and/or genital psoriasis: a 52-week analysis from the Italian multicentric GULLIVER study.",
  "abstract": "Facial and genital plaques are common manifestations of psoriasis, are challenging to treat, and significantly impact patients' quality of life (QoL).\nGULLIVER is a prospective, non-interventional study conducted in 2020-2023 in Italy, aimed at examining the effectiveness, safety and QoL impact of guselkumab through 52 weeks of treatment in patients with facial and/or genital psoriasis. The primary endpoint was the percentage of patients achieving a static Physician Global Assessment (sPGA) score of ≤1 and a minimum 2-grade improvement in sPGA score at Week 52.\nOf 351 enrolled patients, 88.6% remained on guselkumab treatment at Week 52. The proportions of patients achieving the sPGA targets in the facial and genital groups, respectively, were 83.3% and 76.5% at week 12, increasing to 93.8% and 97.9% at Week 52. Mean Dermatology Life Quality Index score improved from 12.0 ± 7.5 at baseline to 1.1 ± 2.0 at Week 52 for patients with facial psoriasis (p-value <0.001) and from 12.0 ± 6.9 to 1.6 ± 3.5 for those with genital psoriasis (p-value <0.001). Guselkumab was well-tolerated and no new safety signals were identified.\nThis Italian real-world study demonstrated the high effectiveness and a good safety profile of guselkumab in treating facial and genital psoriasis.",
  "pub_date": "2026-02-05",
  "publication_types": [
    "Journal Article",
    "Multicenter Study"
  ],
  "affiliations": [
    "Department of Clinical Dermatology, San Gallicano Dermatological Institute, IRCCS, Rome, Italy.",
    "Unit of Dermatology, University of Campania Luigi Vanvitelli, Naples, Italy.",
    "Department of Medicine, Surgery and Dentistry \"Scuola Medica Salernitana\", University of Salerno, Salerno, Italy.",
    "Unit of Dermatology, Department of Internal and Anesthetic and Cardiovascular Sciences, Sapienza University of Roma, Rome, Italy.",
    "Department of Dermatology, University of Pisa, Pisa, Italy.",
    "Dermatology Unit (General and Specialist Medical Department), AO - University of Parma, Parma, Italy.",
    "Section of Dermatology, Department of Medical Sciences, University of Ferrara, Ferrara, Italy.",
    "Unit of Dermatology, Department of Medical Sciences and Public Health, University of Cagliari, Cagliari, Italy.",
    "Dermatology, Department of Specialized Medicine, AOU Policlinico di Modena, Modena, Italy.",
    "Department of Medical-Surgical Sciences and Biotechnologies, Dermatology Unit ASL LATINA, Sapienza University of Roma, Rome, Italy.",
    "Department of Health Science & IRCAD (Interdisciplinary Research Center of Autoimmune Diseases), Università del Piemonte Orientale, Novara, Italy.",
    "Unit of Dermatology, IRCCS Azienda Ospedaliero-Universitaria di Bologna, Bologna, Italy.",
    "Dermatology Unit, Azienda USL-IRCCS, Reggio Emilia, Italy.",
    "Department of Systems Medicine, University of Rome \"Tor Vergata\", Rome, Italy.",
    "Dermatology Unit, Fondazione Policlinico \"Tor Vergata\", Rome, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples \"Federico II\", Naples, Italy.",
    "U.O.C of Dermatology, Messina, Italy.",
    "Unit of Dermatology, San Antonio Abate Hospital, Trapani, Italy.",
    "Section of Dermatology, Department of Biomedical, Dental Sciences and Morphofunctional Imaging, University of Messina, Messina, Italy.",
    "Dermatology Department, IDI-IRCCS, Fondazione Luigi M. Monti, Rome, Italy.",
    "Department of Biotecnological and Applied Clinical Sciences, University of L'Aquila, L'Aquila, Italy.",
    "Department of Dermatology, University of Bari, Bari, Italy.",
    "Dermatological Unit, Department of Clinical and Molecular Sciences, Polytechnic Marche University, Ancona, Italy.",
    "DiSSal, Dermatology Clinic, San Martino Policlinic Hospital-Istituto di Ricovero e Cura a Carattere Scientifico, University of Genova, Genova, Italy.",
    "Dermatology Unit, Department of Medicine, University of Padua, Padua, Italy.",
    "Dermatologia, Dipartimento Universitario di Medicina e Chirurgia Traslazionale, Università Cattolica del Sacro Cuore, Rome, Italy.",
    "Dermatologia, Dipartimento Scienze Mediche e Chirurgiche, Fondazione Policlinico Universitario A. Gemelli IRCCS, Rome, Italy.",
    "Department of Medicine and Surgery, Dermatologic Clinic of Terni, University of Perugia, Perugia, Italy.",
    "Dermatology, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Section of Dermatology, Department of Dermatological Science, University of Florence, Florence, Italy.",
    "Section of Dermatology, Department of Health Promotion, Maternal-Infant, Internal Medicine and Specialization of Excellence \"G. D'Alessandro\" (PROMISE), University of Palermo, Palermo, Italy.",
    "ASO City of Health and Science, University Dermatological Clinic, Torino, Italy.",
    "Dermatology Section, Department of Medicine and Surgery, University of Perugia, Perugia, Italy.",
    "Department of Medicine, Dermatology Unit, Venezia, Italy.",
    "Dermatology Clinic, University of Catania, Catania, Italy.",
    "Section of Dermatology, IRCCS San Raffaele Hospital, Vita-Salute San Raffaele University, Milan, Italy.",
    "Institute of Dermatology, Department of Medicine, University of Udine, Udine, Italy.",
    "Johnson & Johnson, Milan, Italy.",
    "Johnson & Johnson, Milan, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital Rozzano (MI), Rozzano, MI, Italy.",
    "Dermatology, Humanitas Clinical and Research Center, IRCCS, Rozzano, Milan, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41645401/",
  "snapshot_id": "2026-02-12T15-21-04Z",
  "ingested_at": "2026-02-12T15:21:06.169368+00:00"
}