{
  "pmid": "41645692",
  "title": "Upadacitinib as a potential option for the management of paradoxical eczema induced by interleukin-23 inhibitors.",
  "abstract": "Dear Editor, Paradoxical eczema (PE) is defined as de novo onset or flare of eczematous lesions during biologic therapy for psoriasis, regardless of atopic diathesis. PE has been reported with anti-tumor necrosis factor (TNF)-α, anti-interleukin (IL)-17, and more recently with anti-IL-23 agents such as risankizumab, tildrakizumab, and guselkumab, with an estimated incidence of 1-3% among psoriatic patients treated with biologics, likely underestimated. Herein, we report the successful use of upadacitinib, an oral selective Janus kinase (JAK)-1 inhibitor approved for both psoriatic arthritis and atopic dermatitis, in the management of a PE induced by guselkumab. [...].",
  "pub_date": "2026-02-03",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Dermatology, Department of Translational Medicine and Surgery, Università Cattolica del Sacro Cuore, Rome; Dermatology Unit, Department of Medical and Surgical Sciences, A. Gemelli University Hospital Foundation - IRCCS, Rome.",
    "Dermatology, Department of Translational Medicine and Surgery, Università Cattolica del Sacro Cuore, Rome; Dermatology Unit, Department of Medical and Surgical Sciences, A. Gemelli University Hospital Foundation - IRCCS, Rome.",
    "Dermatology Unit, Department of Medical and Surgical Sciences, A. Gemelli University Hospital Foundation - IRCCS, Rome.",
    "Dermatology, Department of Translational Medicine and Surgery, Università Cattolica del Sacro Cuore, Rome; Dermatology Unit, Department of Medical and Surgical Sciences, A. Gemelli University Hospital Foundation - IRCCS, Rome.",
    "Dermatology, Department of Translational Medicine and Surgery, Università Cattolica del Sacro Cuore, Rome; Dermatology Unit, Department of Medical and Surgical Sciences, A. Gemelli University Hospital Foundation - IRCCS, Rome."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41645692/",
  "snapshot_id": "2026-02-12T15-21-04Z",
  "ingested_at": "2026-02-12T15:21:06.169368+00:00"
}