{
  "pmid": "41670439",
  "title": "Efficacy and Safety of Guselkumab in Participants with Active Psoriatic Arthritis After Inadequate Response to One Prior Tumor Necrosis Factor Inhibitor: Week-24 Results of the Phase 3, Randomized, Placebo-Controlled SOLSTICE Study.",
  "abstract": "Evaluate the efficacy and safety of guselkumab, an interleukin-23p19-subunit inhibitor, in participants with active psoriatic arthritis (PsA) and inadequate response (inadequate efficacy and/or intolerance) to one prior tumor necrosis factor inhibitor (TNFi-IR).\nIn SOLSTICE (phase 3b, randomized, multicenter, double-blind, placebo-controlled study), enrolled adults with active PsA (≥3 swollen joints;≥3 tender joints; C-reactive protein ≥0.3 mg/dL) and inadequate response to one prior TNFi were randomized to guselkumab 100mg every 4 weeks (Q4W); guselkumab 100mg at Weeks 0 and 4, then Q8W; or placebo➔guselkumab Q4W at Week24. The primary endpoint was ≥20% improvement in American College of Rheumatology criteria (ACR20) at Week24. Secondary endpoints included ACR50; ACR70; Investigator's Global Assessment of psoriasis (IGA) of 0/1 with ≥2-grade improvement; ≥90% improvement in Psoriasis Area and Severity Index (PASI 90); and minimal disease activity (MDA) at Week24 and were analyzed by intention-to-treat.\nAnalyses included 451 randomized participants (Q4W N=150; Q8W N=151; placebo N=150). At Week24, significantly greater proportions of guselkumab Q4W/Q8W-treated vs placebo-treated participants, respectively, achieved ACR20 (primary endpoint: 58.6%/62.2% vs 34.8%), ACR50 (31.4%/32.1% vs 12.2%), ACR70 (17.5%/17.3% vs 2.0%), IGA 0/1 response (50.0%/57.3% vs 17.4%, PASI 90 (49.4%/45.5% vs 12.0%), and MDA (18.8%/23.9% vs 5.4%) (all p<0.001). Through Week24, 46.7%, 53.6%, and 48.3% of participants receiving Q4W, Q8W, and placebo, respectively, had ≥1 adverse event. One death occurred (myocardial infarction).\nComparable efficacy was observed with both guselkumab regimens in TNFi-IR participants with active PsA; safety findings were consistent with the known profile of guselkumab in patients with psoriatic disease.",
  "pub_date": "2026-02-11",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "University of Pennsylvania School of Medicine, Philadelphia, PA, USA.",
    "UT Southwestern Medical Center and O'Donnell School of Public Health, Dallas, TX, USA.",
    "Rheumatology Research, Providence Swedish Medical Center, Seattle, WA, USA.",
    "University of Washington School of Medicine, Seattle, WA, USA.",
    "University of Rochester Medical Center, Rochester, NY, USA.",
    "New York University School of Medicine, New York, NY, USA.",
    "Johnson & Johnson, Horsham, PA, USA.",
    "Johnson & Johnson, Horsham, PA, USA.",
    "Johnson & Johnson, Horsham, PA, USA.",
    "Drexel University College of Medicine, Philadelphia, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Horsham, PA, USA.",
    "UT Southwestern Medical Center, Dallas, TX, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41670439/",
  "snapshot_id": "2026-02-12T15-21-04Z",
  "ingested_at": "2026-02-12T15:21:06.169368+00:00"
}