{
  "pmid": "37150952",
  "title": "Treatment of plaque psoriasis with deucravacitinib (POETYK PSO-1 study): a plain language summary.",
  "abstract": "This is a summary of a paper published in a medical journal that describes the results of a study called POETYK PSO-1, which looked at a new treatment called deucravacitinib for plaque psoriasis. Plaque psoriasis appears on the body as round or oval raised patches (called plaques) typically covered by scales. This can cause the skin to itch, crack or bleed, and the associated itching and pain can make it difficult to perform basic everyday tasks. Living with psoriasis can cause emotional distress. Treatments are available, but some do not always reduce the symptoms of psoriasis, some may need to be injected or taken multiple times a day, and some may have side effects. Researchers are looking for new treatments that are more effective, convenient to take, and have acceptable safety and tolerability.\nDeucravacitinib is a once-daily pill taken by mouth (orally) that was studied as a treatment for moderate to severe plaque psoriasis in adults in two large studies conducted globally, PSO-1 and PSO-2. The POETYK PSO-1 study compared deucravacitinib with placebo (an inactive pill designed to have no effect) and an approved psoriasis treatment called apremilast, which is a pill taken twice a day. These were tested in adults with moderate to severe plaque psoriasis, which involved 10% or more of their body (equal to 10 or more handprints). The aim of the study was to compare the ability of deucravacitinib with placebo or apremilast to improve psoriasis for the people in the study, and to compare side effects that people had.\nAfter 4 months of treatment, more people taking deucravacitinib had improvements in psoriasis plaques and skin appearance than those taking placebo or apremilast. The study also showed that people continued to see these improvements after taking deucravacitinib for up to 1 year. Side effects are events that happened during the study treatment phase that may or may not be caused by that treatment. Side effects for people taking deucravacitinib were generally mild and occurred in similar numbers overall to those in people taking placebo. The most common side effects in people taking deucravacitinib were inflammation or infection of the nasal (nose) passages and throat. Clinical Trial Registration: NCT03624127 (POETYK PSO-1 study) (ClinicalTrials.gov).",
  "pub_date": "2023-05-07",
  "publication_types": [
    "Journal Article",
    "Research Support, Non-U.S. Gov't",
    "Patient Education Handout"
  ],
  "affiliations": [
    "Department of Dermatology, Keck School of Medicine, University of Southern California, Los Angeles, CA, USA.",
    "SKiN Centre for Dermatology, Department of Dermatology, Queen's University, & Probity Medical Research, Peterborough, ON, Canada.",
    "Dermatology Centre, Salford Royal NHS Foundation Trust Hospital, Manchester NIHR Biomedical Research Centre, University of Manchester, Manchester, UK.",
    "Alliance Clinical Trials & Probity Medical Research, Waterloo, ON, Canada.",
    "Department of Dermatology, Yale University School of Medicine, New Haven, & Central Connecticut Dermatology Research, Cromwell, CT, USA.",
    "Department of Dermatology & Venereology, University of Lübeck, Lübeck, Germany.",
    "Department of Geriatric & Environmental Dermatology, Nagoya City University Graduate School of Medical Sciences, Nagoya City, Aichi, Japan.",
    "Department of Dermatology, Venereology & Allergology, Wroclaw Medical University, Wrocław, Poland.",
    "Department of Dermatology, Faculty of Medicine, Fukuoka University, Fukuoka, Japan.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Oregon Medical Research Center, Portland, OR, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37150952/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}