{
  "pmid": "38306122",
  "title": "Deucravacitinib for Moderate-to-Severe Psoriasis: A Systematic Review and Meta-Analysis of Randomized Controlled Trials.",
  "abstract": "There is contrasting evidence regarding the efficacy and safety of JAK (Janus kinase) inhibitors in the treatment of psoriasis. This systematic review and meta-analysis assessed deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, as the therapy of choice for moderate-to-severe psoriasis. PubMed, Embase, and Cochrane databases were searched for randomized controlled trials, including patients with moderate-to-severe psoriasis. Outcomes of interest were serious adverse events (SAEs), the severity of illness, as measured by the validated questionnaires: Psoriasis Area and Severity Index (PASI) and scalp-specific Physician's Global Assessment (ss-PGA); and quality of life, measured by the Dermatology Life Quality Index (DLQI). Four studies with 1663 patients were included in the meta-analysis, of whom 1123 (67.5%) were treated with deucravacitinib during a 12-to-16-week follow-up. The mean age was 45.4 &plusmn; 13.3 years, and 70.2% were male. Two-thirds had a history of scalp psoriasis. Achievement of PASI 75 was significantly higher in the deucravacitinib group, as compared with placebo (RR 5.7; 95% CI 4.32-7.53; P&lt;0.001). Similarly, ss-PGA 0/1 (RR 3.86; 95%CI 3.02-4.94; P&lt;0.001) and DLQI 0/1 (RR 3.89; 2.89-5.22; P&lt;0.001) were also significantly more frequent in the deucravacitinib group. The incidence of SAEs was similar between groups. These findings suggest that patients with moderate-to-severe psoriasis treated with deucravacitinib for 12 to 16 weeks had significantly decreased severity of illness and improved quality of life, without a concerning increase in the incidence of SAEs. J Drugs Dermatol. 2024;23(2):67-73.&nbsp; doi:10.36849/JDD.7539.",
  "pub_date": "2024-02-01",
  "publication_types": [
    "Meta-Analysis",
    "Systematic Review",
    "Journal Article"
  ],
  "affiliations": [],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38306122/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}