{
  "pmid": "38331098",
  "title": "Vaccination recommendations for adults receiving biologics and oral therapies for psoriasis and psoriatic arthritis: Delphi consensus from the medical board of the National Psoriasis Foundation.",
  "abstract": "For psoriatic patients who need to receive nonlive or live vaccines, evidence-based recommendations are needed regarding whether to pause or continue systemic therapies for psoriasis and/or psoriatic arthritis.\nTo evaluate literature regarding vaccine efficacy and safety and to generate consensus-based recommendations for adults receiving systemic therapies for psoriasis and/or psoriatic arthritis receiving nonlive or live vaccines.\nUsing a modified Delphi process, 22 consensus statements were developed by the National Psoriasis Foundation Medical Board and COVID-19 Task Force, and infectious disease experts.\nKey recommendations include continuing most oral and biologic therapies without modification for patients receiving nonlive vaccines; consider interruption of methotrexate for nonlive vaccines. For patients receiving live vaccines, discontinue most oral and biologic medications before and after administration of live vaccine. Specific recommendations include discontinuing most biologic therapies, except for abatacept, for 2-3 half-lives before live vaccine administration and deferring next dose 2-4 weeks after live vaccination.\nStudies regarding infection rates after vaccination are lacking.\nInterruption of antipsoriatic oral and biologic therapies is generally not necessary for patients receiving nonlive vaccines. Temporary interruption of oral and biologic therapies before and after administration of live vaccines is recommended in most cases.",
  "pub_date": "2024-02-07",
  "publication_types": [
    "Journal Article",
    "Consensus Statement"
  ],
  "affiliations": [
    "Department of Dermatology, Keck School of Medicine at USC, Los Angeles, California.",
    "Department of Dermatology, University of Pennsylvania Perelman School of Medicine, Philadelphia, Pennsylvania.",
    "Department of Dermatology, Keck School of Medicine at USC, Los Angeles, California.",
    "National Psoriasis Foundation, Portland, Oregon.",
    "National Psoriasis Foundation, Portland, Oregon.",
    "Department of Dermatology, University of California, San Francisco School of Medicine, San Francisco, California.",
    "Department of Dermatology, The University of Texas Southwestern Medical Center, Dallas, Texas; Innovative Dermatology, Plano, Texas.",
    "Department of Dermatology, University of Utah, Salt Lake City, Utah.",
    "Department of Dermatology, Wake Forest School of Medicine, Winston-Salem, North Carolina.",
    "Department of Dermatology, Donald and Barbara Zucker School of Medicine, Hempstead, New York.",
    "Department of Dermatology, University of Pennsylvania Perelman School of Medicine, Philadelphia, Pennsylvania.",
    "Schroeder Arthritis Institute, Krembil Research Institute, Toronto Western Hospital, Toronto, Ontario, Canada.",
    "Aesthetic & Dermatology Center, Rockville, Maryland.",
    "Department of Dermatology, University of Michigan, Ann Arbor, Michigan.",
    "Department of Dermatology, Donald and Barbara Zucker School of Medicine, Hempstead, New York.",
    "Department of Dermatology, University of California, Davis, Rocklin, California.",
    "Physicians Skin Care, Louisville, Kentucky.",
    "Department of Dermatology, University of California, San Francisco School of Medicine, San Francisco, California.",
    "Division of Clinical Dermatology & Cutaneous Science, Dalhousie University, Halifax, Nova Scotia, Canada.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Illinois Dermatology Institute, Chicago, Illinois.",
    "Department of Dermatology, University of California, San Francisco School of Medicine, San Francisco, California.",
    "Dr. George Martin Dermatology Associates, Kihei, Hawaii.",
    "Division of Rheumatology, Johns Hopkins University School of Medicine, Baltimore, Maryland.",
    "Division of Rheumatology, NYU Grossman School of Medicine, New York, New York.",
    "Department of Dermatology, University of Pennsylvania Perelman School of Medicine, Philadelphia, Pennsylvania.",
    "Division of Allergy, Immunology, and Rheumatology, University of Rochester Medical Center, Rochester, New York.",
    "Division of Rheumatology, Weill Cornell Medical Center, New York, New York.",
    "Department of Rheumatology, Arthritis and Rheumatism Associates, Rockville, Maryland.",
    "Department of Dermatology, Eastern Virginia Medical School, Norfolk, Virginia.",
    "Department of Dermatology, University of Colorado Anschutz Medical Campus, Aurora, Colorado.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Division of Infectious Diseases, Oregon Health and Science University, Portland, Oregon.",
    "Dermatology Institute & Skin Care Center, Santa Monica, California.",
    "Division of Dermatology, University of California Los Angeles, Los Angeles, California. Electronic address: armstrongpublication@gmail.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38331098/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}