{
  "pmid": "38699874",
  "title": "Efficacy and safety of deucravacitinib for the management of psoriasis: a drug safety evaluation.",
  "abstract": "Nowadays, despite the wide availability of biological drugs and apremilast for psoriasis management, there is always a need for new therapies to customize the therapeutic approach on the basis of the patient's clinical features and comorbidities, especially in order to achieve a prolonged therapeutic response. Thus, new treatment strategies are required to offer patients a personalized approach. In this scenario, major knowledge on psoriasis pathogenesis led to the development of deucravacitinib, an orally administered selective TYK2 inhibitor.\nThe aim of this manuscript is to review the current literature on the effectiveness and safety of deucravacitinib in psoriasis to offer readers a wide perspective. The current English literature was analyzed using the PubMed, Google Scholar, Embase, Cochrane Skin, and clinicaltrials.gov databases, selecting the most relevant manuscripts.\nDeucravacitinib appears to be an innovative weapon for the management of moderate to severe psoriasis. Despite its efficacy and safety profiles have been revealed by RCTs, real-life data are still scant. Certainly, deucravacitinib broadens the range of therapeutic alternatives for psoriasis patients, thus enhancing the holistic and personalized approaches required for the treatment of this disease.",
  "pub_date": "2024-05-06",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38699874/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}