{
  "pmid": "38892802",
  "title": "Therapeutic Potential of Targeting the JAK/STAT Pathway in Psoriasis: Focus on TYK2 Inhibition.",
  "abstract": "Psoriasis is an inflammatory skin disease with a chronic relapsing course and an often-detrimental impact on patients' quality of life. Thanks to incredible advances in research over the past few decades, the therapeutic armamentarium of psoriasis is now reasonably broad and structured, with several therapeutic agents that have demonstrated successful long-term control of this condition. However, there are still unfulfilled gaps resulting from the inherent limitations of existing therapies, which have paved the way for the identification of new therapeutic strategies or the improvement of existing ones. A great deal of attention has recently been paid to the JAK/STAT pathway, playing a crucial role in chronic inflammatory skin diseases, including psoriasis. Indeed, in a disease with such a complex pathogenesis, the possibility to antagonize multiple molecular pathways via JAK/STAT inhibition offers an undeniable therapeutic advantage. However, data from clinical trials evaluating the use of oral JAK inhibitors in immune-mediated disorders, such as RA, have arisen safety concerns, suggesting a potentially increased risk of class-specific AEs such as infections, venous thromboembolism, and malignancies. New molecules are currently under investigation for the treatment of psoriasis, such as deucravacitinib, an oral selective inhibitor that binds to the regulatory domain of TYK2, brepocitinib (PF-06700841) and PF-06826647 that bind to the active site in the catalytic domain. Due to the selective TYK2 blockade allowing the inhibition of key cytokine-mediated signals, such as those induced by IL-12 and IL-23, anti-TYK2 agents appear to be very promising as the safety profile seems to be superior compared with pan-JAK inhibitors. The aim of our review is to thoroughly explore the rationale behind the usage of JAK inhibitors in PsO, their efficacy and safety profiles, with a special focus on oral TYK2 inhibitors, as well as to provide a forward-looking update on novel therapeutic strategies targeting the TYK2 pathway in psoriasis.",
  "pub_date": "2024-05-24",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, 53100 Siena, Italy.",
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, 53100 Siena, Italy.",
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, 53100 Siena, Italy.",
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, 53100 Siena, Italy.",
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, 53100 Siena, Italy.",
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, 53100 Siena, Italy.",
    "Institute of Dermatology, Catholic University of the Sacred Heart, 00168 Rome, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38892802/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}