{
  "pmid": "39080153",
  "title": "Deucravacitinib Improves Patient-Reported Outcomes in Patients with Moderate to Severe Psoriasis: Results from the Phase 3 Randomized POETYK PSO-1 and PSO-2 Trials.",
  "abstract": "Deucravacitinib, a novel, oral, selective allosteric tyrosine kinase 2 inhibitor, demonstrated superiority versus placebo and apremilast in the POETYK PSO-1 and PSO-2 studies. We describe patient-reported outcomes with deucravacitinib treatment versus placebo and apremilast in these studies.\nTwo multicenter, global, double-blind, placebo- and active comparator-controlled studies randomized patients with moderate-to-severe plaque psoriasis 1:2:1 to placebo, deucravacitinib 6 mg once daily, or apremilast 30 mg twice daily. Score changes from baseline and meaningful within-patient change responses for Psoriasis Symptoms and Signs Diary (PSSD) and Dermatology Life Quality Index (DLQI) were assessed.\nIn POETYK PSO-1 (n = 666) and PSO-2 (n = 1020), respectively, improvement from baseline in PSSD total score was greater with deucravacitinib (- 27.8 and - 30.1) versus placebo (- 4.4 and - 5.9) and apremilast (- 18.9 and - 22.5) at Week 16 and versus apremilast at Week 24 (deucravacitinib: - 32.8 and - 30.7; apremilast: - 21.6 and - 22.8) (nominal p < 0.0001). Improvement from baseline in DLQI score was also greater with deucravacitinib (- 8.5 and - 7.6) versus placebo (- 3.3 and - 3.0) and apremilast (- 5.9 and - 5.8) at Week 16 and versus apremilast at Week 24 (deucravacitinib: - 8.6 and - 7.5; apremilast: - 5.6 and - 5.5) (nominal p < 0.0001). Achievement of meaningful within-patient change in PSSD total score and in DLQI score occurred more frequently with deucravacitinib than placebo and apremilast at Week 16 and versus apremilast at Week 24.\nDeucravacitinib demonstrated meaningful improvements in patient-reported outcomes in patients with moderate-to-severe plaque psoriasis compared with apremilast and placebo.\nNCT03624127, NCT03611751.",
  "pub_date": "2024-07-30",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Keck School of Medicine of University of Southern California, Los Angeles, CA, USA.",
    "Institute for Health Services Research in Dermatology and Nursing, University Medical Center Hamburg-Eppendorf, Hamburg, Germany.",
    "Clinical Outcomes Solutions, Tucson, AZ, USA.",
    "Clinical Outcomes Solutions, Tucson, AZ, USA.",
    "Clinical Outcomes Solutions, Tucson, AZ, USA.",
    "Medical College of Wisconsin, Milwaukee, WI, USA.",
    "Bristol Myers Squibb, 3401 Princeton Pike, Princeton, NJ, 08648, USA. joe.zhuo@bms.com.",
    "Bristol Myers Squibb, 3401 Princeton Pike, Princeton, NJ, 08648, USA.",
    "Bristol Myers Squibb, 3401 Princeton Pike, Princeton, NJ, 08648, USA.",
    "Bristol Myers Squibb, 3401 Princeton Pike, Princeton, NJ, 08648, USA.",
    "Bristol Myers Squibb, 3401 Princeton Pike, Princeton, NJ, 08648, USA.",
    "Alliance Clinical Trials and Probity Medical Research, Waterloo, ON, Canada.",
    "University of Toronto, Toronto, ON, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39080153/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}