{
  "pmid": "39149635",
  "title": "Paradoxical Eczema Associated With Interleukin-17A Inhibitor Use in a Patient With Generalized Pustular Psoriasis Accompanied by Asthma.",
  "abstract": "Although rare, paradoxical eczema (PE) is an adverse event associated with the use of biological agents to treat psoriasis, particularly in patients with atopic predispositions. We report the first case of severe PE induced by secukinumab in a patient with generalized pustular psoriasis (GPP) and asthma. A woman in her 50s with a history of interstitial nephritis attributable to Sjogren's syndrome experienced a flare-up of GPP after discontinuing mycophenolate mofetil and was hospitalized. Treatment with secukinumab accompanied by an increased prednisolone level afforded rapid improvement, but she subsequently developed widespread, itchy, serous papules and erythema. A biopsy confirmed that the erythema was an eczematous reaction, thus PE. Her condition improved after switching from secukinumab to deucravacitinib with a temporary increase in the prednisolone level; no recurrence of GPP or PE was observed for 11 months. Elevated serum levels of interleukin (IL)-17A, IL-22, and the Th2 chemokine TARC recorded at the onset time of PE suggested that these mediators contributed to the observed pathology. Our case highlights the need for careful consideration when prescribing IL-17 inhibitors to patients with GPP, particularly those with atopic predispositions, given the potential activation of the Th2 axis and thus severe eczematous reactions. Further research is required to understand the essential nature of PE in patients with GPP and the roles of IL-17A and IL-22 in this context.",
  "pub_date": "2024-07-16",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Ehime University Graduate School of Medicine, Toon, JPN.",
    "Department of Dermatology, Ehime University Graduate School of Medicine, Toon, JPN.",
    "Department of Dermatology, Ehime University Graduate School of Medicine, Toon, JPN.",
    "Department of Dermatology, Ehime University Graduate School of Medicine, Toon, JPN.",
    "Department of Dermatology, Ehime University Graduate School of Medicine, Toon, JPN."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39149635/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}