{
  "pmid": "39349269",
  "title": "Tyrosine kinase 2 inhibitors in autoimmune diseases.",
  "abstract": "Tyk2 is a member of the JAK kinase family. It is an important mediator in pro-inflammatory signalling, implicated in both innate and adaptive immune system. Activation of Tyk2 is believed to be integral to cellular processes that contribute to the development and progression of autoimmune disorders. Selective targeting of Tyk2 may reduce the number of adverse events as compared to non-selective JAK inhibitors. Therefore, in recent years there has been a growing body of research examining the inhibition of Tyk2 as a therapeutic intervention in autoimmune disease. Deucravacitinib has been approved for the treatment of moderate to severe skin psoriasis. This drug and other novel Tyk2 inhibitors are now being explored as therapies for multiple autoimmune diseases, including psoriatic arthritis, SLE, Sjogren's, dermatomyositis, inflammatory bowel disease, uveitis, hidradenitis suppurativa and others. Tyk2 inhibitors offer a potentially exciting new treatment option across a wide range of autoimmune diseases. We discuss Tyk2 inhibition, the current evidence for its usage to date, ongoing trials and what the future might hold.",
  "pub_date": "2024-09-29",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Rheumatology, University Hospital Southampton NHS Foundation Trust, Tremona Road, Southampton SO16 6YD, UK. Electronic address: chethana.ramakrishna1@nhs.net.",
    "Department of Rheumatology, University Hospital Southampton NHS Foundation Trust, Tremona Road, Southampton SO16 6YD, UK.",
    "Department of Rheumatology, University Hospital Southampton NHS Foundation Trust, Tremona Road, Southampton SO16 6YD, UK; NIHR Southampton clinical research facility, University Hospitals Southampton NHS Foundation Trust, Southampton, UK."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39349269/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}