{
  "pmid": "40045918",
  "title": "Deucravacitinib in plaque psoriasis: Four-year safety and efficacy results from the Phase 3 POETYK PSO-1, PSO-2 and long-term extension trials.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 (TYK2) inhibitor, is approved in multiple countries for treatment of adults with moderate to severe plaque psoriasis who are candidates for systemic therapy.\nTo evaluate the safety and efficacy of deucravacitinib through 4 years in the Phase 3 POETYK PSO-1, PSO-2 and long-term extension (LTE) trials in psoriasis.\nPSO-1 and PSO-2 (parent trials) randomized patients 1:2:1 to oral placebo, deucravacitinib 6 mg once daily (QD) or apremilast 30 mg twice daily. At 52 weeks, patients enrolled in the LTE trial received open-label deucravacitinib 6 mg QD. Safety was evaluated in patients who received ≥1 dose of deucravacitinib at any time. Clinical and patient-reported outcomes (PASI, PGA and DLQI) were analysed in patients who received continuous deucravacitinib from Day 1 of the parent trials and enrolled in the LTE trial.\nIn total, 1519 patients received ≥1 dose of deucravacitinib, with cumulative exposure of 4392.8 person-years (PY) through the data cut-off of 1 November 2023. Exposure-adjusted incidence rates (EAIRs)/100 PY of noted safety measures were comparable or decreased from the 1-year to 4-year cumulative period, respectively, for adverse events (AEs) (229.23, 131.68), serious AEs (including COVID-19) (5.68, 5.01), deaths (0.20, 0.25), discontinuation due to AEs (4.38, 2.20), herpes zoster (0.81, 0.55), malignancies (1.02, 0.89), major adverse cardiovascular events (0.30, 0.32) and venous thromboembolism (0.20, 0.07). In patients who received continuous deucravacitinib (n = 513), clinical and patient-reported outcome rates were well maintained from 1 year through 4 years (e.g. PASI 90, 1 year, 45.6% [95% CI, 41.3%-50.0%], 4 years, 47.5% [42.6%-52.4%]; DLQI 0/1, 1 year, 51.5% [47.1%-55.9%], 4 years, 49.4% [44.4%-54.4%]).\nDeucravacitinib demonstrated a consistent safety profile and durable efficacy through 4 years of treatment in patients with moderate to severe plaque psoriasis.",
  "pub_date": "2025-03-06",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Randomized Controlled Trial",
    "Multicenter Study"
  ],
  "affiliations": [
    "University of California Los Angeles, Los Angeles, California, USA.",
    "Icahn School of Medicine at Mount Sinai, New York, New York, USA.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust, Manchester, UK.",
    "NIHR Manchester Biomedical Research Centre, Manchester University NHS Foundation Trust, Manchester Academic Health Science Centre, Manchester, UK.",
    "University of California Los Angeles, Los Angeles, California, USA.",
    "Dermatology Research Associates, Los Angeles, California, USA.",
    "Nagoya City University Graduate School of Medical Sciences, Nagoya, Japan.",
    "Paul Sabatier University and CHU Larrey, Toulouse, France.",
    "Alliance Clinical Trials and Probity Medical Research, Waterloo, and the University of Toronto, Toronto, Ontario, Canada.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Yale University School of Medicine, New Haven, and Central Connecticut Dermatology Research, Cromwell, Connecticut, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40045918/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}