{
  "pmid": "40095888",
  "title": "The Expanding Therapeutic Potential of Deucravacitinib Beyond Psoriasis: A Narrative Review.",
  "abstract": "Deucravacitinib is an allosteric, selective tyrosine kinase 2 (TYK2) inhibitor that has demonstrated significant efficacy in the treatment of psoriasis. TYK2, a member of the Janus kinase (JAK) family, plays a critical role in intracellular signaling pathways for pro-inflammatory cytokines. Unlike traditional JAK inhibitors, which target active domains, deucravacitinib selectively binds to the pseudokinase domain of TYK2. This binding induces a conformational change that locks the enzyme in an inactive state, ensuring superior selectivity for TYK2 over JAK 1/2/3. This unique mechanism specifically inhibits key pro-inflammatory cytokines, including IL-12, IL-23, and type I interferons, critical in the pathogenesis of psoriasis and other immune-mediated diseases. As a result, deucravacitinib represents a promising option for targeted therapy in immune-mediated diseases and may reduce adverse events commonly associated with broader immunosuppressive treatments. Furthermore, its oral administration offers a convenient alternative to injectable biologics, potentially improving patient adherence and treatment satisfaction. This review highlights recent studies suggesting that deucravacitinib may also have therapeutic benefits in psoriatic arthritis, palmoplantar pustulosis, systemic lupus erythematosus, Sjogren's disease, and inflammatory bowel disease. Given its expanding therapeutic potential, deucravacitinib may provide a safer and more effective alternative to current therapies, offering a tailored approach to treatment.",
  "pub_date": "2025-03-05",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Seoul St. Mary's Hospital, College of Medicine, The Catholic University of Korea, Seoul 06591, Republic of Korea.",
    "Department of Dermatology, Bucheon St. Mary's Hospital, College of Medicine, The Catholic University of Korea, Seoul 14647, Republic of Korea.",
    "Department of Dermatology, Bucheon St. Mary's Hospital, College of Medicine, The Catholic University of Korea, Seoul 14647, Republic of Korea."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40095888/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}