{
  "pmid": "40304108",
  "title": "Deucravacitinib, an Oral, Selective, Allosteric Tyrosine Kinase 2 Inhibitor, in Japanese Patients With Plaque Psoriasis: In-Depth Analysis of Efficacy and Safety in the Phase 3 POETYK PSO-4 Trial.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, is approved in Japan for adults with plaque, generalized pustular, and erythrodermic psoriasis who have inadequate response to conventional systemic therapies. In the Phase 3, open-label POETYK PSO-4 (NCT03924427) trial, deucravacitinib was efficacious and well tolerated in Japanese patients with moderate to severe plaque psoriasis. This post hoc analysis of PSO-4 evaluated deucravacitinib efficacy and safety in greater detail in this patient population. Absolute Psoriasis Area and Severity Index (PASI), achievement of PASI thresholds of ≤ 1, ≤ 2, and ≤ 5, and PASI body region (head, trunk, upper limbs, lower limbs) and plaque characteristic (erythema, induration, desquamation) scores were evaluated over 52 weeks. Response rates (PASI 75, PASI 90, and static Physician Global Assessment score of 0 [clear] or 1 [almost clear]) were evaluated based on prior use of systemic (biologic and nonbiologic) therapy and phototherapy. Efficacy was also evaluated in patients with scalp, fingernail, and palmoplantar psoriasis. Select safety events were reviewed. Deucravacitinib improved absolute PASI from Week 1, with improvements maintained through Week 52. Deucravacitinib-treated patients achieved clinically meaningful improvements in PASI thresholds, with nearly half (47.6%) achieving PASI ≤ 1 at Week 52. Deucravacitinib also improved PASI body region and plaque characteristic scores, with improvements that occurred as early as Week 1 maintained through Week 52. Deucravacitinib was efficacious through Week 52 regardless of prior use of systemic therapy or phototherapy. Deucravacitinib was also efficacious in patients with scalp and fingernail psoriasis, and in the limited number with palmoplantar psoriasis. Serious adverse events, adverse events resulting in discontinuation, and shifts to Grade ≥ 3 laboratory abnormalities were rare over 52 weeks. This analysis provides a more detailed characterization of Japanese patients with plaque psoriasis appropriate for deucravacitinib treatment and confirms that deucravacitinib is efficacious and well tolerated in this patient population. Trial Registration: www.ClinicalTrials.gov identifier: NCT03924427.",
  "pub_date": "2025-04-30",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Multicenter Study"
  ],
  "affiliations": [
    "Department of Dermatology, Tokyo Medical University, Tokyo, Japan.",
    "Department of Geriatric and Environmental Dermatology, Nagoya City University Graduate School of Medical Sciences, Nagoya, Japan.",
    "Department of Dermatology, Faculty of Medicine, Fukuoka University Hospital, Fukuoka, Japan.",
    "Department of Dermatology, Teikyo University School of Medicine, Tokyo, Japan.",
    "Immunology Medical Strategy, Bristol Myers Squibb K.K., Tokyo, Japan.",
    "Biometrics, Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Clinical Development, Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "WW Medical I&F, Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Biometrics, Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Immunology Medical Strategy, Bristol Myers Squibb K.K., Tokyo, Japan.",
    "Department of Dermatology, Jichi Medical University, Tochigi, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40304108/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}