{
  "pmid": "40439875",
  "title": "Systematic review of comparative studies on emerging psoriasis treatments: comparing biologics with biologics, small molecule inhibitors with small molecule inhibitors, and biologics with small molecule inhibitors.",
  "abstract": "Psoriasis is a chronic inflammatory skin condition driven by immune dysregulation, significantly diminishing patients' quality of life. The advent of targeted biological therapies and small molecule inhibitors has transformed the treatment landscape for moderate-to-severe Psoriasis. Nevertheless, there remains a scarcity of comparative efficacy and safety data between these therapeutic classes, highlighting the need for a systematic review to evaluate their relative performance.\nThis systematic review seeks to consolidate evidence from comparative studies that assess the effectiveness and safety of biologic agents and small molecule inhibitors in managing moderate-to-severe Psoriasis. The aim is to provide a well-founded, evidence-based perspective on the most effective therapeutic approaches by analysing their efficacy, safety profiles, and long-term treatment durability.\nAn extensive literature search was conducted across Web of Science, PubMed, and Scopus to identify randomised clinical trials (RCTs) comparing biologics and small molecule inhibitors. Inclusion criteria required that the RCTs be published in English, with full-text availability and a primary focus on treatment efficacy and safety outcomes. Studies were excluded if they were retrospective, observational, case reports, or non-English publications. Study selection and data extraction were carried out independently by two reviewers, with disagreements resolved by a third reviewer.\nA total of 22 head-to-head RCTs, encompassing over 50,000 patients, met the inclusion criteria. Biologic therapies targeting IL-17 (Secukinumab, Ixekizumab, Brodalumab), IL-23 (Guselkumab, Risankizumab, Tildrakizumab), and TNF-α (Adalimumab, Etanercept) exhibited superior efficacy compared to conventional systemic treatments. Secukinumab consistently surpassed Ustekinumab in achieving PASI 90 and PASI 100 responses. Guselkumab demonstrated sustained superiority over Adalimumab, yielding higher rates of skin clearance at Week 48. Similarly, Risankizumab delivered superior long-term PASI 90 responses when compared to Secukinumab. Among small molecule inhibitors, Deucravacitinib proved more effective than Apremilast in achieving PASI 75 and static Physician Global Assessment responses. Safety profiles were generally comparable across the treatment groups, although IL-17 inhibitors were associated with a higher incidence of Candida infections.\nThis systematic review highlights the enhanced efficacy of IL-17 and IL-23 inhibitors compared to TNF-α inhibitors, with IL-23-targeting agents demonstrating superior long-term disease control. Small molecule inhibitors, particularly Deucravacitinib, present a promising alternative as effective oral therapies. Although newer biologics offer improved treatment outcomes, further head-to-head trials comparing TYK2, JAK, and PDE4 inhibitors with IL-17 and IL-23 agents are warranted. These findings provide valuable insights to inform clinical decision-making and optimise Psoriasis management strategies.",
  "pub_date": "2025-05-29",
  "publication_types": [
    "Journal Article",
    "Systematic Review",
    "Comparative Study"
  ],
  "affiliations": [
    "School of Medicine, Iran University of Medical Sciences, Asadabadi Street, 21 Street, Next to Shafaq Park, Tehran, 1445613131, Iran.",
    "Department of Dermatology, Hazrat Fatemeh Hospital, School of Medicine, Iran University of Medical Sciences, Asadabadi Street, 21 Street, Next to Shafaq Park, Tehran, 1445613131, Iran.",
    "Department of Dermatology, Hazrat Fatemeh Hospital, School of Medicine, Iran University of Medical Sciences, Asadabadi Street, 21 Street, Next to Shafaq Park, Tehran, 1445613131, Iran. azadeh_goodarzi1984@yahoo.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40439875/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}