{
  "pmid": "40616721",
  "title": "Efficacy and Safety of Deucravacitinib, a Selective, Allosteric TYK2 Inhibitor, by Baseline DMARD Use in a Phase 2 Psoriatic Arthritis Study: A Post Hoc Analysis.",
  "abstract": "This study aimed to evaluate the influence of background conventional synthetic disease-modifying antirheumatic drug (csDMARD) use on efficacy and safety of deucravacitinib, a first-in-class, oral, selective, allosteric tyrosine kinase 2 (TYK2) inhibitor, in patients with psoriatic arthritis (PsA).\nThis phase 2, double-blind trial randomized 203 patients with active PsA 1:1:1 to oral placebo, deucravacitinib 6 mg, or deucravacitinib 12 mg once daily for 16 weeks. Patients had failed or were intolerant to ≥ 1 non-steroidal anti-inflammatory drug (NSAID), glucocorticoid, csDMARD and/or one tumour necrosis factor inhibitor. Patients were not stratified by csDMARD use and were allowed one background csDMARD if used for ≥ 3 months with stable dose for > 28 days prior to day 1; patients could not initiate new csDMARD treatment. This post hoc analysis evaluated the influence of background csDMARD use on efficacy outcomes, which included American College of Rheumatology (ACR) 20 responses and ACR scoring components; Psoriasis Area and Severity Index (PASI) scores; Psoriatic Arthritis Disease Activity Scores (PASDAS); and on safety measures.\nBaseline clinical characteristics and disease activity were generally similar among subgroups regardless of csDMARD use. At baseline, 65.0% of patients were taking background csDMARDs and among these 84.1% were taking methotrexate; percentages of methotrexate use were similar across groups. Similar ACR 20 response rates at week 16 were observed with deucravacitinib treatment in patients with vs without baseline csDMARD use compared with placebo (deucravacitinib 6 mg: 57.8% vs 44.0%; deucravacitinib 12 mg: 62.8% vs 62.5%; and placebo: 31.8% vs 31.8%, respectively). Similar responses with deucravacitinib compared with placebo, regardless of background csDMARD use, were observed in individual ACR components, PASI score, and PASDAS. The safety profile of deucravacitinib treatment was similar in patients with and without csDMARD use.\nBackground csDMARD use did not affect the efficacy or safety of deucravacitinib in this phase 2 PsA study. Graphical Abstract available for this article.\nClinicalTrials.gov ( https://clinicaltrials.gov ): NCT03881059.",
  "pub_date": "2025-07-05",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Division of Arthritis and Rheumatic Diseases, Oregon Health & Science University, 3181 SW Sam Jackson Park Road, Portland, OR, 97239, USA. deodhara@ohsu.edu.",
    "Clinical R&D, Bristol Myers Squibb, Princeton, NJ, USA.",
    "Medical Affairs, Bristol Myers Squibb, Princeton, NJ, USA.",
    "WW Medical Immunology, Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Department of Rheumatology, Swedish Medical Center/Providence St. Joseph Health, University of Washington School of Medicine, Seattle, WA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40616721/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}