{
  "pmid": "41489170",
  "title": "The Maintenance of Early Responses and Achievement of Delayed Responses to Deucravacitinib Treatment in Psoriais: A 104-Week Real-World Study in Japan.",
  "abstract": "The tyrosine kinase 2 inhibitor deucravacitinib is effective for psoriasis. However, it is unclear whether early responses to deucravacitinib in real-world practice are maintained for 2 years and whether patients without early responses can achieve delayed responses. This study is aimed to evaluate the sustainability of week 16 responses to deucravacitinib treatment for psoriasis and to evaluate delayed responses in week 16 poor responders. This prospective study included 117 Japanese patients with moderate-to-severe psoriasis treated with deucravacitinib. Patients who achieved psoriasis area and severity index (PASI) 75, PASI 90, PASI 100, absolute PASI ≤ 2, absolute PASI ≤ 1, static physician's global assessment (sPGA) 0/1, or dermatology life quality index (DLQI) 0/1 at week 16 were evaluated for maintenance of each outcome. Patients who did not achieve these outcomes at week 16 were evaluated for delayed achievement of each outcome through week 104. In week 16 achievers, week 104 maintenance rates of PASI 75, PASI 90, PASI 100, absolute PASI ≤ 2, and absolute PASI ≤ 1 were 95.2%, 87.5%, 66.7%, 100%, and 91.7%, respectively, while those of sPGA 0/1 and DLQI 0/1 were 100% and 88.9%, respectively. In week 16 non-achievers, week 104 achievement rates for PASI 75, PASI 90, PASI 100, absolute PASI ≤ 2, and absolute PASI ≤ 1 were 25.0%, 15.4%, 7.7%, 50.0%, and 23.5%, respectively, and those for sPGA 0/1 and DLQI 0/1 were 60.0% and 50.0%, respectively. Improvements of rash and quality of life achieved at week 16 of deucravacitinib treatment were mostly sustained through week 104. Some patients without week 16 responses could achieve delayed responses at later time points.",
  "pub_date": "2026-01-05",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Fujimoto Dermatology Clinic, Funabashi, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41489170/",
  "snapshot_id": "2026-02-12T15-09-21Z",
  "ingested_at": "2026-02-12T15:09:25.497525+00:00"
}