{
  "pmid": "36882942",
  "title": "Efficacy and safety of the selective TYK2 inhibitor, deucravacitinib, in Japanese patients with moderate to severe plaque psoriasis: Subgroup analysis of a randomized, double-blind, placebo-controlled, global phase 3 trial.",
  "abstract": "Deucravacitinib is an oral, selective, allosteric tyrosine kinase 2 (TYK2) inhibitor that demonstrated superior efficacy versus placebo and apremilast in a global phase 3 trial (POETYK PSO-1; NCT03624127) in patients with moderate to severe plaque psoriasis (N = 666). This report describes efficacy and safety in Japanese patients from this study (N = 66) who were randomly assigned to treatment with deucravacitinib 6 mg once daily (n = 32), placebo (n = 17), or apremilast 30 mg twice daily (n = 17). Patients randomized to placebo crossed over to deucravacitinib at Week 16. Patients randomized to apremilast who did not achieve ≥50% reduction from baseline in Psoriasis Area and Severity Index (PASI 50) score at Week 24 switched to deucravacitinib. The proportion of Japanese patients achieving ≥75% reduction from baseline in PASI (PASI 75) score was numerically higher with deucravacitinib versus placebo and apremilast at Week 16 (78.1% vs. 11.8% and 23.5%, respectively) and versus apremilast at Week 24 (78.1% vs. 29.4%). A numerically higher proportion of patients achieved a static Physician's Global Assessment score of 0 or 1 (clear or almost clear) with at least a two-point improvement from baseline (sPGA 0/1) with deucravacitinib versus placebo or apremilast at Week 16 (75.0% vs. 11.8% and 35.3%) and versus apremilast at Week 24 (75.0% vs. 29.4%). Findings for other clinical and patient-reported outcomes also favored deucravacitinib. Response rates were maintained through 52 weeks in the deucravacitinib group. Incidence rates for adverse events per 100 person-years (PY) in the Japanese patients were comparable across treatment groups through Week 52 (deucravacitinib, 336.8/100 PY; placebo, 321.0/100 PY; apremilast, 358.6/100 PY). The most frequently reported adverse event with deucravacitinib was nasopharyngitis. The efficacy and safety of deucravacitinib in Japanese patients was consistent with those in the global population in POETYK PSO-1.",
  "pub_date": "2023-03-07",
  "publication_types": [
    "Clinical Trial, Phase III",
    "Comparative Study",
    "Journal Article",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "Fukuoka University, Fukuoka, Japan.",
    "Teikyo University, Tokyo, Japan.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Nagoya City University Graduate School of Medical Sciences, Nagoya, Aichi, Japan.",
    "Jichi Medical University, Shimotsuke, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/36882942/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}