{
  "pmid": "37132187",
  "title": "English version of Japanese guidance for the use of oral Janus kinase inhibitors (JAK1 and TYK2 inhibitors) in the treatments of psoriasis.",
  "abstract": "This is the English version of Japanese guidance for the use of oral Janus kinase (JAK) inhibitors (JAK1 and tyrosine kinase 2 [TYK2] inhibitors) in the treatments of psoriasis. Several cytokines, such as interleukin (IL)-6, IL-7, IL-12, IL-21, IL-22, IL-23, interferon (IFN)-α, and IFN-γ, are involved in the pathogenesis of psoriasis (including psoriatic arthritis). As oral JAK inhibitors hinder the JAK-signal transducers and activators of transcription signal transduction routes involved in the signal transduction of these cytokines, they may be effective for the treatment of psoriasis. JAK has four types: JAK1, JAK2, JAK3, and TYK2. Regarding the use of oral JAK inhibitors for the treatment of psoriasis in Japan, indications of the JAK1 inhibitor upadacitinib were extended also to psoriatic arthritis in 2021, and the use of the TYK2 inhibitor deucravacitinib for plaque-type psoriasis, pustular psoriasis, and erythrodermic psoriasis became covered by health insurance in 2022. This guidance was developed for board-certified dermatologists who specialize in the treatment of psoriasis and to promote the proper use of oral JAK inhibitors. In the package inserts and guides for appropriate use, upadacitinib and deucravacitinib are classified as a \"JAK inhibitor\" and a \"TYK2 inhibitor\", respectively, and it is possible that there may be differences in safety between the two drugs. The safety of these drugs will be evaluated for the future by the postmarketing surveillance for molecularly targeted drugs for psoriasis of the Japanese Dermatological Association.",
  "pub_date": "2023-04-01",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Department of Dermatology, Tokai University School of Medicine, Isehara, Japan.",
    "Department of Dermatology, The Jikei University School of Medicine, Tokyo, Japan.",
    "Kojinkai Sapporo Skin Clinic, Sapporo, Japan.",
    "Department of Dermatology, NTT Medical Center Tokyo, Tokyo, Japan.",
    "Department of Dermatology, Faculty of Medicine, Fukuoka University, Fukuoka, Japan.",
    "Department of Dermatology, Tokyo Medical University, Tokyo, Japan.",
    "Department of Dermatology, Jichi Medical University, Shimotsuke, Japan.",
    "Department of Dermatology, University of the Ryukyus Graduate School of Medicine, Okinawa, Japan.",
    "Division of Dermatology, Tokyo Yamate Medical Center, Tokyo, Japan.",
    "Department of Geriatric and Environmental Dermatology, Nagoya City University Graduate School of Medical Sciences, Nagoya, Japan.",
    "Division of Infectious Diseases, Advanced Clinical Research Center, Institute of Medical Science, The University of Tokyo, Tokyo, Japan.",
    "Research Division for Development of Anti-Infective Agents, Faculty of Medical Science and Welfare, Tohoku Bunka Gakuen University, Sendai, Japan.",
    "Department of Dermatology, Jichi Medical University, Shimotsuke, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37132187/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}