{
  "pmid": "37841017",
  "title": "The efficacy and safety of tyrosine kinase 2 inhibitor deucravacitinib in the treatment of plaque psoriasis: a systematic review and meta-analysis of randomized controlled trials.",
  "abstract": "Orally effective therapeutics for plaque psoriasis with improved response rates, lower toxicity and costs are needed in clinical practices. This study aims to assess the efficacy and safety of the recently approved TYK2 inhibitor deucravacitinib in adults with moderate to severe plaque psoriasis through meta-analysis.\nA systematic search was performed for eligible studies using electronic databases, including PubMed, Embase, Cochrane Library, Clinical Trials, the EU Clinical Trials Register, and the International Clinical Trials Registry Platform (ICTRP). Randomized controlled trials (RCTs) comparing the efficacy and safety of deucravacitinib vs. placebo or active comparators in adult patients with plaque psoriasis were included. The effectiveness of deucravacitinib was evaluated using a 75% improvement in Psoriasis Area and Severity Index (PASI 75) from baseline and the proportion of patients achieving the static Physician's Global Assessment (sPGA) response. The secondary endpoint was the proportion of patients achieving PASI 90, PASI 100, ssPGA 0/1, and Dermatology Life Quality Index 0/1 (DLQI). The incidence of adverse events (AEs), serious AEs (SAEs), and AE-related treatment discontinuation were statistically analyzed to determine the safety of deucravacitinib.\nThe systematic review and meta-analysis included five RCTs involving 2,198 patients with moderate to severe plaque psoriasis. Results showed that deucravacitinib was superior to placebo as well as active comparator apremilast in multiple key endpoints, including PASI 75, sPGA 0/1, PASI 90, PASI 100, DLQI 0/1 at week 16. Moreover, a durable response was seen in the two 52-week studies. Safety assessment showed that deucravacitinib was generally well tolerated, and the incidence of AEs, SAEs, and AE-related treatment discontinuation was low and balanced across groups.\nDeucravacitinib demonstrated superior efficacy to apremilast in adult patients with moderate to severe plaque psoriasis with an acceptable safety profile and has the potential to be used as the first-line oral therapy for plaque psoriasis.",
  "pub_date": "2023-09-29",
  "publication_types": [
    "Systematic Review",
    "Journal Article"
  ],
  "affiliations": [
    "Pharmaceutical Department, PLA Strategic Support Force Medical Center, Beijing, China.",
    "Pharmaceutical Department, PLA Strategic Support Force Medical Center, Beijing, China.",
    "Shandong Provincial Center for ADR Monitoring, Jinan, China.",
    "Department of Pharmacy, The First Affiliated Hospital of Chengdu Medical College, Chengdu, China.",
    "Clinical Medical College, Chengdu Medical College, Chengdu, China.",
    "Pharmaceutical Department, PLA Strategic Support Force Medical Center, Beijing, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37841017/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}