{
  "pmid": "38007038",
  "title": "Nail psoriasis and nail lichen planus: Updates on diagnosis and management.",
  "abstract": "Inflammatory diseases of the nail, including nail psoriasis and nail lichen planus, are associated with significant disease burden and have a negative impact on quality of life. Diagnosis is often delayed, especially when patients present without cutaneous findings. Therefore, recognizing clinical signs and symptoms of inflammatory nail diseases, and initiating timely and appropriate treatment, is of utmost importance.\nWe review recent studies on diagnostic techniques, discuss severity grading and scoring systems, and describe consensus treatment recommendations for nail psoriasis and nail lichen planus.\nAn updated literature review was performed using the PubMed database on studies assessing diagnostic techniques or treatment modalities for nail psoriasis and nail lichen planus.\nRecent studies on diagnostic techniques for inflammatory nail disease have focused on use of dermoscopy, capillaroscopy, and ultrasound modalities. Treatment of these conditions is dichotomized into involvement of few (≤3) or many (>3) nails. Recent psoriatic therapeutics studied for nail outcomes include brodalumab, tildrakizumab, risankizumab, deucravacitinib, and bimekizumab, while emerging treatments for nail lichen planus include JAK inhibitors and intralesional platelet rich plasma injections.\nWe emphasize the need for increased awareness and expanded management strategies for inflammatory nail diseases to improve patient outcomes.",
  "pub_date": "2023-11-24",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Weill Cornell Medicine, New York, New York.",
    "Department of Dermatology, University College of Medical Sciences, New Delhi, India.",
    "Dermatology Practice, Lugano/Bellinzona, Switzerland.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Dermatology Unit, IRCCS Azienda Ospedaliero-Universitaria di Bologna, Bologna, Italy; Department of Medical and Surgical Sciences, University of Bologna, Bologna, Italy.",
    "1st Department of Dermatology-Venereology, National and Kapodistrian University of Athens, Athens, Greece.",
    "Department of Dermatology, Weill Cornell Medicine, New York, New York. Electronic address: shl9032@med.cornell.edu."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38007038/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}