{
  "pmid": "38268101",
  "title": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, in Japanese patients with moderate to severe plaque, erythrodermic, or generalized pustular psoriasis: Efficacy and safety results from an open-label, phase 3 trial.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, is approved in Japan for adult patients with plaque (PP), generalized pustular (GPP), and erythrodermic (EP) psoriasis who have had an inadequate response to conventional systemic therapies. This approval is based on results from the global phase 3 POETYK PSO-1 and PSO-2 trials in which deucravacitinib was associated with significantly improved efficacy outcomes compared with placebo in adults with moderate to severe plaque psoriasis, and results described here from POETYK PSO-4, an open-label, single-arm, phase 3 trial (NCT03924427), which evaluated the efficacy and safety of deucravacitinib 6 mg once daily in adult Japanese patients with PP, GPP, or EP. The coprimary endpoints were the proportion of patients achieving a ≥75% reduction from baseline in the Psoriasis Area and Severity Index (PASI 75) and a static Physician's Global Assessment score of 0 (clear) or 1 (almost clear) (sPGA 0/1) with at least a two-point improvement from baseline at week 16. Nonresponder imputation was used for missing data. Efficacy responses, adverse events (AEs), and serious AEs (SAEs) were recorded for up to 52 weeks. Seventy-four patients were treated (PP, n = 63; GPP, n = 3; EP, n = 8). At week 16, 76.2%, 66.7%, and 37.5% of patients with PP, GPP, and EP, respectively, had achieved PASI 75, and 82.5%, 0.0%, and 50.0% had achieved sPGA 0/1. Responses were overall maintained through week 52. AEs occurred in 74.6% of patients with PP, 100% of patients with GPP, and 87.5% of patients with EP. The most common AEs were nasopharyngitis and acne. Rates of SAEs and discontinuations were low. There were no deaths. Deucravacitinib was effective and well tolerated in Japanese patients with moderate to severe PP and in a limited number of patients with GPP or EP.",
  "pub_date": "2024-01-24",
  "publication_types": [
    "Clinical Trial, Phase III",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Fukuoka University Faculty of Medicine, Fukuoka, Japan.",
    "Department of Dermatology, Tokyo Medical University, Tokyo, Japan.",
    "Department of Dermatology, Teikyo University School of Medicine, Tokyo, Japan.",
    "Department of Dermatology, Jichi Medical University, Tochigi, Japan.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Department of Geriatrics and Environmental Dermatology, Nagoya City University Graduate School of Medical Sciences, Nagoya, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38268101/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}