{
  "pmid": "38529623",
  "title": "Clinical pharmacokinetics and pharmacodynamics of oral systemic nonbiologic therapies for psoriasis patients.",
  "abstract": "Psoriasis is a chronic inflammatory immune condition. Treatments for psoriasis vary with disease severity, ranging from topicals to systemic biologic agents. The pharmacokinetic (PK) and pharmacodynamic (PD) properties of these therapies establish drug efficacy, toxicity, and optimal dosing to ensure therapeutic drug levels are sustained and adverse effects are minimized.\nA literature search was performed on PubMed, Google Scholar, and Ovid MEDLINE for PK and PD, efficacy, and safety data regarding oral systemic nonbiologic therapies utilized for moderate-to-severe plaque psoriasis. The findings were organized into sections for each drug: oral acitretin, methotrexate, cyclosporine, apremilast, tofacitinib, and deucravacitinib.\nSome psoriasis patients may not respond to initial therapy. Ongoing research is evaluating genetic polymorphisms that may predict an improved response to specific medications. However, financial and insurance barriers, as well as limited genetic polymorphisms correlated with treatment response, may restrict the implementation of genetic testing necessary to personalize treatments. How well psoriasis patients adhere to treatment may contribute greatly to variation in response. Therapeutic drug monitoring may help patients adhere to treatment, improve clinical response, and sustain disease control.",
  "pub_date": "2024-03-28",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "University of Louisville School of Medicine, Louisville, KY, USA.",
    "Virginia Commonwealth University School of Medicine, Richmond, VA, USA.",
    "Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, NC, USA.",
    "University of Louisville School of Medicine, Louisville, KY, USA.",
    "Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, NC, USA.",
    "Department of Pathology, Wake Forest University School of Medicine, Winston-Salem, NC, USA.",
    "Department of Social Sciences & Health Policy, Wake Forest University School of Medicine, Winston-Salem, NC, USA.",
    "Department of Dermatology, University of Southern Denmark, Odense, Denmark."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38529623/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}