{
  "pmid": "38731900",
  "title": "Inhibition of the JAK-STAT Pathway in the Treatment of Psoriasis: A Review of the Literature.",
  "abstract": "Psoriasis is a highly prevalent dermatological disease associated with an increased systemic inflammatory response. In addition, joint involvement is also present in around 20% of patients. Therefore, treatment modalities used in this condition should be simultaneously effective at improving skin manifestations, reducing inflammation, and addressing psoriatic arthritis when present. Twenty years ago, the introduction of biologic treatments for psoriasis was a turning point in the management of this condition, offering an effective and reasonably safe option for patients whose disease could not be adequately controlled with conventional therapies. At the moment, Janus Kinase inhibitors (JAKis) are a new class of promising molecules in the management of psoriasis. They are orally administered and can show benefits in patients who failed biologic therapy. We conducted a scoping review in order to identify randomized-controlled trials that investigated different JAKis in patients with plaque psoriasis and psoriatic arthritis, with an emphasis on molecules that have been approved by the European Medicines Agency and the Food and Drug Administration. The added value of this study is that it collected information about JAKis approved for two different indications, plaque psoriasis and psoriatic arthritis, in order to provide an integrated understanding of the range of effects that JAKis have on the whole spectrum of psoriasis manifestations.",
  "pub_date": "2024-04-25",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, \"Carol Davila\" University of Medicine and Pharmacy, 020021 Bucharest, Romania.",
    "Department of Dermatology, \"Victor Babes\" Clinical Hospital for Infectious Diseases, 030303 Bucharest, Romania.",
    "Department of Dermatology, \"Carol Davila\" University of Medicine and Pharmacy, 020021 Bucharest, Romania.",
    "Department of Dermatology, \"Victor Babes\" Clinical Hospital for Infectious Diseases, 030303 Bucharest, Romania.",
    "Department of Dermatology, \"Carol Davila\" University of Medicine and Pharmacy, 020021 Bucharest, Romania.",
    "Department of Dermatology, \"Victor Babes\" Clinical Hospital for Infectious Diseases, 030303 Bucharest, Romania.",
    "Department of Dermatology, \"Carol Davila\" University of Medicine and Pharmacy, 020021 Bucharest, Romania."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38731900/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}