{
  "pmid": "38945549",
  "title": "Deucravacitinib onset of action and maintenance of response in phase 3 plaque psoriasis trials.",
  "abstract": "In the global phase 3 POETYK PSO-1 and PSO-2 trials, significantly greater proportions of deucravacitinib-treated patients met the coprimary endpoints (PASI 75, sPGA 0/1) at Week 16 versus placebo or apremilast-treated patients. This analysis evaluated onset of action and maintenance of response in patients randomized to deucravacitinib and placebo only.\nAdults with moderate to severe plaque psoriasis at baseline were randomized 1:2:1 to oral placebo, deucravacitinib, or apremilast. Onset of action was determined through changes from baseline in mean PASI, BSA, BSA × sPGA, and DLQI. Maintenance of response was assessed using PASI 75, PASI 90, PASI 100, sPGA 0/1, and sPGA 0 response rates through Week 52 in patients who were treated continuously with deucravacitinib, crossed over from placebo to deucravacitinib at Week 16, or received deucravacitinib and achieved PASI 75 by Week 24.\nDeucravacitinib showed significantly higher increases in mean percent change from baseline in PASI versus placebo by Week 1. Significant improvement versus placebo was observed in all other efficacy measures by Week 8. Efficacy with deucravacitinib was maintained through Week 52.\nDeucravacitinib displayed efficacy as early as 1 week and clinical responses were maintained over 52 weeks in patients with moderate to severe plaque psoriasis.",
  "pub_date": "2024-06-30",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "Case Western Reserve University School of Medicine and University Hospitals Cleveland Medical Center, Cleveland, OH, USA.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust, Manchester, UK.",
    "NIHR Manchester Biomedical Research Centre, Manchester University NHS Foundation Trust, Manchester Academic Health Science Centre, Manchester, UK.",
    "Psoriasis Treatment Center of New Jersey, East Windsor, NJ, USA.",
    "University of California Los Angeles, Los Angeles, CA, USA.",
    "SKiN Centre for Dermatology, Peterborough, Queen's University, Kingston, and Probity Medical Research, Waterloo, ON, Canada.",
    "Yale University School of Medicine, New Haven, and Central Connecticut Dermatology Research, Cromwell, CT, USA.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Graduate School of Medical Sciences, Nagoya City University, Nagoya, Japan.",
    "Faculty of Medicine, Fukuoka University Hospital, Fukuoka, Japan.",
    "The University of Melbourne, Parkville, St. Vincent's Hospital Melbourne, Fitzroy, and Probity Medical Research and Skin Health Institute, Carlton, VIC, Australia.",
    "University of California Los Angeles, Los Angeles, CA, USA.",
    "Dermatology Research Associates, Los Angeles, CA, USA.",
    "The Second Affiliated Hospital and Zhejiang University School of Medicine, Hangzhou, China.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Oregon Medical Research Center, Portland, OR, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38945549/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}