{
  "pmid": "38976593",
  "title": "Deucravacitinib: moderate-to-severe plaque psoriasis preventable?",
  "abstract": "Psoriasis is a persistent, inflammatory, and autoimmune condition that is difficult to treat. Estimates of the prevalence of psoriasis in people range from 0.27 % (95 % confidence interval 0.17 to 0.36) to 11.4 %, depending on factors such as age, sex, geography, ethnicity, genetics, and environmental factors. While systemic treatments are typically required for patients with moderate-to-severe instances of psoriasis, topical therapies are frequently effective for treating minor forms. In fact, phototherapy is frequently constrained by logistical considerations, and conventional systemic therapies are frequently avoided due to contraindications or the danger of adverse outcomes. In order to better serve the patient and achieve a greater level of quality of life, especially in order to sustain long-term efficacy, there is still a need for innovative therapies, which are always welcomed. Deucravacitinib is a first-in-class oral tyrosine kinase 2 (TYK2) inhibitor that is extremely selective. Through an allosteric mechanism, it stabilises an inhibitory connection between the regulatory and catalytic domains of TYK2's pseudokinase regulatory domain, which is catalytically inactive. This can be used to treat a variety of immune-mediated conditions, such as inflammatory bowel disease, lupus, psoriatic arthritis, and psoriasis. US-FDA has approved this drug on 9 September 2022 for the treatment of adults with moderate-to-severe plaque psoriasis who are candidates for systemic therapy or phototherapy. This article aims to review the current knowledge on the efficacy and safety of deucravacitinib for the management of psoriasis.",
  "pub_date": "2024-07-09",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Pharmacology, Kalpana Chawla Government Medical College, Karnal, Haryana, India.",
    "Department of Pharmacology, Kalpana Chawla Government Medical College, Karnal, Haryana, India."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38976593/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}