{
  "pmid": "39131603",
  "title": "New and emerging oral therapies for psoriasis.",
  "abstract": "Psoriasis is a chronic inflammatory skin disease affecting 2-3% of the global population. Traditional systemic treatments, such as methotrexate, cyclosporine, acitretin and fumaric acid esters, have limited efficacy and are associated with significant adverse effects, necessitating regular monitoring and posing risks of long-term toxicity. Recent advancements have introduced biologic drugs that offer improved efficacy and safety profiles. However, their high cost and the inconvenience of parenteral administration limit their accessibility. Consequently, there is a growing interest in developing new, targeted oral therapies. Small molecules, such as phosphodiesterase 4 inhibitors (e.g. apremilast) and TYK2 inhibitor (e.g. deucravacitinib), have shown promising results with favourable safety profiles. Additionally, other novel oral agents targeting specific pathways, including IL-17, IL-23, TNF, S1PR1 and A3AR, are under investigation. These treatments aim to combine the efficacy of biologics with the convenience and accessibility of oral administration, addressing the limitations of current therapies. This narrative review synthesizes the emerging oral therapeutic agents for psoriasis, focusing on their mechanisms of action, stages of development and clinical trial results.",
  "pub_date": "2024-08-01",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "College of Medicine, University of Saskatchewan, Saskatoon, Saskatchewan, Canada.",
    "Instituto de Ciências Biomédicas Abel Salazar, University of Porto, Porto, Portugal.",
    "Instituto de Ciências Biomédicas Abel Salazar, University of Porto, Porto, Portugal.",
    "Department of Dermatology, Centro Hospitalar Universitário do Porto, Porto, Portugal."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39131603/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}