{
  "pmid": "39201826",
  "title": "Biologics and Small Molecule Targeted Therapies for Pediatric Alopecia Areata, Psoriasis, Atopic Dermatitis, and Hidradenitis Suppurativa in the US: A Narrative Review.",
  "abstract": "The management of pediatric dermatological conditions such as alopecia areata (AA), psoriasis, atopic dermatitis (AD), and hidradenitis suppurativa (HS) has significantly evolved with the introduction of biologics and small molecule targeted therapies. The advancement in understanding the immunopathogenesis of these chronic skin conditions has led to the development and approval of novel biologics and small molecule therapies. Initially approved by the United States Food and Drug Administration (FDA) for adults, most of these therapies are now being evaluated in clinical trials for safety and efficacy in adolescents and children, expanding new treatment options for pediatric patients. The role of the FDA in drug approval is multifaceted from drug inception, ensuring that research, data, and evidence show that the proposed drug is effective and safe for the intended use.\nThe goal of this review article is to provide an overview of the recently FDA-approved and potential biologic and oral small molecule therapies in clinical trials for AA, psoriasis, AD, and HS in pediatric patients.\nThe search for this review included keywords in ClinicalTrials.gov, PubMed, and Google Scholar for the latest research and clinical trials relevant to these conditions and treatments without the PRISMA methodology.\nFor pediatric AA, ritlecitinib is FDA-approved, while baricitinib and updacitinib are in phase 3 clinical trials for pediatric approval. The FDA-approved drugs for pediatric psoriasis include secukinumab, ustekinumab, ixekizumab, etanercept, and apremilast. Other phase 3 clinical trials for pediatric psoriasis include risankizumab, guselkumab, tildrakizumab, brodalumab, and deucravacitinib. For pediatric AD, the FDA-approved drugs are dupilumab, tralokinumab, abrocitinib, and upadacitinib, with many other drugs in phase 3 trials. Adalimumab is an FDA-approved biologic for pediatric HS, with various clinical trials ongoing for adults. The approved biologics and small molecule therapies had higher efficacy and improved safety profiles compared to traditional medications.\nWith numerous ongoing trials, the success of these clinical trials could lead to their inclusion in treatment guidelines for these chronic skin conditions. Biologics and small molecule therapies offer new avenues for effective disease management, enabling personalized therapeutic interventions and improving pediatric health outcomes.",
  "pub_date": "2024-07-25",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, NC 27157, USA.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, NC 27157, USA.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, NC 27157, USA.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, NC 27157, USA.",
    "Center for Dermatology Research, Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, NC 27157, USA.",
    "Department of Pathology, Wake Forest University School of Medicine, Winston-Salem, NC 27157, USA.",
    "Department of Social Sciences & Health Policy, Wake Forest University School of Medicine, Winston-Salem, NC 27157, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39201826/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}