{
  "pmid": "39437312",
  "title": "Deucravacitinib, an oral selective allosteric tyrosine kinase 2 inhibitor, in patients from China mainland, Taiwan and South Korea with moderate-to-severe plaque psoriasis: a phase III randomized clinical trial.",
  "abstract": "Deucravacitinib, an oral selective allosteric tyrosine kinase 2 inhibitor, is approved in the USA, the European Union, Japan, South Korea, China and other countries for the treatment of moderate-to-severe plaque psoriasis.\nTo evaluate the efficacy and safety of deucravacitinib in Asian patients with moderate-to-severe plaque psoriasis.\nIn the 52-week blinded phase III POETYK PSO-3 trial (NCT04167462), patients were randomized 1 : 2 to placebo (n = 74) or deucravacitinib 6 mg once daily (n = 146) for 16 weeks followed by deucravacitinib alone. Co-primary endpoints were the achievement of a ≥75% reduction from baseline in Psoriasis Area and Severity Index (PASI 75) and static Physician Global Assessment score of 0 (clear) or 1 (almost clear; sPGA 0/1) at week 16. Efficacy and safety were evaluated throughout.\nAt week 16, significantly higher proportions of patients receiving deucravacitinib compared with placebo achieved PASI 75 (68.8% vs. 8.1%; P < 0.001) and sPGA 0/1 (55.6% vs. 6.8%; P < 0.001). Response rates with deucravacitinib were maintained through week 52. Common adverse events (AEs) included upper respiratory tract infection and nasopharyngitis. Serious AE and discontinuation rates were low.\nDeucravacitinib was efficacious and well tolerated in Asian patients with moderate-to-severe plaque psoriasis.",
  "pub_date": "2025-02-18",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase III",
    "Multicenter Study"
  ],
  "affiliations": [
    "Peking University People's Hospital, Beijing, China.",
    "Shanghai Skin Disease Hospital, Shanghai, China.",
    "The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Beijing Friendship Hospital, Beijing, China.",
    "People's Hospital of Zhejiang Province, Hangzhou, China.",
    "Jiangsu Province Hospital, Nanjing, China.",
    "Sir Run Shaw Hospital, Zhejiang University School of Medicine, Hangzhou, China.",
    "West China Hospital of Sichuan University, Chengdu, China.",
    "Kaohsiung Chang Gung Memorial Hospital, Kaohsiung, China.",
    "First Hospital of Shanxi Medical University, Taiyuan, China.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39437312/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}