{
  "pmid": "39641509",
  "title": "Deucravacitinib in Japanese patients with plaque, generalized pustular, or erythrodermic psoriasis: Patient-reported outcomes in the POETYK PSO-4 study.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, is approved in Japan for adult patients with plaque, generalized pustular, or erythrodermic psoriasis. POETYK PSO-4 (NCT03924427), an open-label, single-arm, phase 3 trial, showed that deucravacitinib was effective and well tolerated in Japanese patients with plaque (n = 63), generalized pustular (n = 3), or erythrodermic (n = 8) psoriasis. Additional end points in POETYK PSO-4 included change measured by the patient-reported outcome measures Psoriasis Symptoms and Signs Diary and Dermatology Life Quality Index. Mean changes from baseline in score on each measure and the response rate for achieving Dermatology Life Quality Index scores of 0 or 1 were assessed in each patient group over 52 weeks. All assessments were reported as observed, without imputation, in the as-treated population. Each group reported week 16 score improvements from baseline for both patient-reported outcome measures that were maintained or numerically improved at week 52. At week 52, approximately two-thirds of patients in each group achieved a Dermatology Life Quality Index score of 0 or 1, indicating no impact of disease on quality of life. These results demonstrate improvements in psoriasis symptoms and signs and in quality of life with deucravacitinib treatment in Japanese patients with plaque, generalized pustular, or erythrodermic psoriasis. The small number of patients with generalized pustular or erythrodermic psoriasis limits the generalized interpretability of the findings in these groups.",
  "pub_date": "2024-12-06",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Multicenter Study"
  ],
  "affiliations": [
    "Department of Dermatology, Teikyo University School of Medicine, Tokyo, Japan.",
    "Department of Dermatology, Keck School of Medicine, University of Southern California, Los Angeles, California, USA.",
    "Division of Dermatology, University of California Los Angeles, Los Angeles, California, USA.",
    "Department of Dermatology, Fukuoka University Hospital Faculty of Medicine, Fukuoka, Japan.",
    "Department of Dermatology, Tokyo Medical University, Tokyo, Japan.",
    "Department of Geriatrics and Environmental Dermatology, Nagoya City University Graduate School of Medical Science, Nagoya, Japan.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Bristol Myers Squibb, Princeton, New Jersey, USA.",
    "Jichi Medical University, Tochigi, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39641509/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}