{
  "pmid": "39918727",
  "title": "Deucravacitinib: Adverse Events of Interest Across Phase 3 Plaque Psoriasis Trials.",
  "abstract": "Deucravacitinib, an oral, selective, allosteric tyrosine kinase 2 inhibitor, is approved in multiple countries for adults with moderate to severe plaque psoriasis who are candidates for systemic therapy. The safety and efficacy of deucravacitinib in psoriasis has been demonstrated through 3 years in the phase 3 POETYK PSO-1, PSO-2, and long-term extension (LTE) trials enrolling adults with moderate to severe plaque psoriasis.\nTo review the effect of deucravacitinib treatment on adverse events of interest (AEIs) over 3 years in POETYK PSO-1, PSO-2, and LTE, cumulative exposure-adjusted incidence rates (EAIRs) of AEIs were recorded through 3 years.\nAEIs and 3-year EAIRs of select infections included serious infections (2.5/100 person-years [PY]), COVID-19 (1.6/100 PY), and herpes zoster (0.6/100 PY). Excluding COVID-19, the serious infections EAIR was 0.9/100 PY. Major adverse cardiovascular event (MACE) and venous thromboembolism EAIRs were 0.3/100 PY and 0.1/100 PY, respectively. The EAIRs for malignancies were 0.9/100 PY overall and 0.5/100 PY, excluding nonmelanoma skin cancer (NMSC). Cutaneous events included acne (EAIR, 1.3/100 PY) and folliculitis (EAIR, 1.1/100 PY). Three-year cumulative EAIRs generally remained stable or decreased relative to 1-year rates. EAIRs of non-COVID-19 serious infections, malignancies excluding NMSC, and MACE through 3 years were consistent with rates for other antipsoriatic agents from clinical trials, disease registries, and real-world claims data.\nIn adults with plaque psoriasis treated with deucravacitinib, the cumulative incidence of AEIs remained comparable or decreased over 3 years of follow-up and aligned with comparison data for other antipsoriatic therapies.",
  "pub_date": "2025-02-07",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Medicine and Rheumatology, UT Southwestern Medical Center, 5323 Harry Hines Boulevard, Dallas, TX, 75390, USA. Joseph.Merola@UTSouthwestern.edu.",
    "Department of Dermatology, University of North Carolina, Chapel Hill, NC, USA.",
    "Department of Dermatology, Tufts Medical Center, Boston, MA, USA.",
    "Division of Dermatology, University of California Los Angeles, and Dermatology Research Associates, Los Angeles, CA, USA.",
    "State of the Heart Cardiology, Southlake, TX, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Kimberly and Eric J. Waldman Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39918727/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}