{
  "pmid": "40742181",
  "title": "Conversion of Conjunctival Nevus to Melanoma in a Patient Taking the TYK2 Inhibitor Deucravacitinib.",
  "abstract": "To describe a case of a patient with a preexisting conjunctival nevus giving rise to conjunctival melanoma as a potential adverse effect of the new selective Janus kinase-signal transducer and activator of transcription (JAK-STAT) inhibitor deucravacitinib.\nSingle case report.\nA 50-year-old woman with a medical history of psoriasis, for which she was 6 months into treatment with deucravacitinib, presented with 3 months of progressive enlargement and darkening of a brown-pigmented lesion in the left eye. This lesion evolved in the place of a pigmented nodule in the left eye that had been present and unchanging for at least several years prior. Urgent surgical excision, cryotherapy, and ocular surface reconstruction were performed without complication. Biopsy of the lesion confirmed the presence of a conjunctival melanoma, invasive to a depth of 0.7 mm, arising from a precursor conjunctival nevus. The patient was subsequently referred to an oncologist, who recommended discontinuing deucravacitinib.\nDeucravacitinib-mediated inhibition of tyrosine kinase 2 (TYK-2) disrupts signaling of cytokines interferon alpha (IFN-α), interleukin (IL)-12 and IL-23, providing a theoretical mechanism for increased risk of malignancy while taking the drug. In this case, the temporal relation between starting deucravacitinib treatment and the rapid growth of a conjunctival melanoma arising from a nevus is concerning for a protumor effect of this immunomodulatory drug. Patients with ocular lesions at risk of malignant transformation should perhaps be closely monitored while on deucravacitinib therapy until more is known regarding the degree of risk of malignant transformation because of immunomodulation from TYK2 inhibition.",
  "pub_date": "2025-07-31",
  "publication_types": [
    "Journal Article",
    "Case Reports"
  ],
  "affiliations": [
    "Boston University Chobanian & Avedision School of Medicine, Boston, MA, USA; and.",
    "Department of Ophthalmology, Massachusetts Eye and Ear, Harvard Medical School, Boston, MA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40742181/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}