{
  "pmid": "41350512",
  "title": "Deucravacitinib in Plaque Psoriasis After Inadequate Response to Apremilast: Phase 3 POETYK Analysis.",
  "abstract": "Moderate-to-severe plaque psoriasis can be difficult to treat; not all patients respond to treatment. POETYK PSO-1 and PSO-2 were 52-week, phase 3, multinational, double-blinded trials in plaque psoriasis. We determined deucravacitinib efficacy in PSO-1/PSO-2 patients who did not respond to apremilast.\nPSO-1/PSO-2 were conducted between July 2018 and November 2020; this analysis includes data from both trials. Adults with moderate-to-severe plaque psoriasis (baseline Psoriasis Area and Severity Index [PASI] ≥ 12, static Physician Global Assessment [sPGA] ≥ 3, body surface area involvement ≥ 10%) were included and randomized 1:2:1 to oral placebo, deucravacitinib 6 mg once daily, or apremilast 30 mg twice daily. Clinical endpoints included ≥ 75%/90% reduction from baseline PASI (PASI 75/90), sPGA score of 0 (clear) or 1 (almost clear) (sPGA 0/1) response rates, and mean percent change from baseline PASI and BSA involvement. Patient-reported outcomes included Dermatology Life Quality Index 0 (no effect) or 1 (little effect) (DLQI 0/1) and mean change from baseline Psoriasis Symptoms and Signs Diary (PSSD) symptom score.\nOf 168 (PSO-1) and 254 (PSO-2) patients randomized to apremilast, 54 (32.1% [PSO-1]) and 111 (43.7% [PSO-2]) did not achieve PASI 50 (PSO-1) and PASI 75 (PSO-2) at Week 24 and were switched to deucravacitinib. PASI 75 response rates improved from 0% at Week 24 to 46.3% (PSO-1) and 42.3% (PSO-2) at Week 52. From Weeks 24-52, PASI 90, sPGA 0/1, and DLQI 0/1 response rates increased; mean percent change from baseline PASI decreased by 60% (PSO-1) and 26% (PSO-2); mean change from baseline in PSSD symptom score decreased by ≈20% in both studies; mean percent change from baseline BSA involvement decreased by 65% (PSO-1) and 25% (PSO-2).\nDeucravacitinib was efficacious in patients with moderate-to-severe plaque psoriasis who did not respond to apremilast.\nClinicalTrials.gov identifier, NCT03624127, NCT03611751.",
  "pub_date": "2025-12-05",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Division of Dermatology, University of California Los Angeles David Geffen School of Medicine, 200 Medical Plaza, Suite 450, Los Angeles, CA, 90095, USA. armstrongpublication@gmail.com.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust and Division of Musculoskeletal and Dermatological Sciences, Manchester NIHR Biomedical Research Centre, Manchester Academic Health Science Centre, University of Manchester, Manchester, UK.",
    "Division of Dermatology, University of California Los Angeles David Geffen School of Medicine, 200 Medical Plaza, Suite 450, Los Angeles, CA, 90095, USA.",
    "Veracity Clinical Research, Brisbane, QLD, Australia.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Harvard Medical School and Harvard Medical Faculty Physicians, Beth Israel Deaconess Medical Center, Boston, MA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41350512/",
  "snapshot_id": "2026-02-12T15-10-27Z",
  "ingested_at": "2026-02-12T15:10:32.228780+00:00"
}