{
  "pmid": "40546629",
  "title": "Successful Treatment of Adalimumab-Induced Pustular Psoriasis With Guselkumab in a Patient With Hidradenitis Suppurativa.",
  "abstract": "Pustular psoriasis is a rare and severe form of psoriasis, characterized by the presence of desquamative plaques with pustules on an erythematous base. Psoriasis is thought to result from plasmacytoid dendritic cell (PDC)-mediated T-cell activation, which stimulates keratinocyte proliferation via type 1 interferon signaling. Studies suggest that TNF-alpha inhibition can paradoxically enhance interferon-alpha activity, leading to the development of pustular psoriasis in some cases. A 58-year-old patient with hidradenitis suppurativa began adalimumab therapy. One month later, she presented with a diffuse pustular rash. A punch biopsy revealed pustular psoriasis with negative direct immunofluorescence (DIF) and periodic acid-Schiff (PAS) stain. Despite treatment with topical steroids, the rash worsened. Her therapy was switched to guselkumab, alongside continued topical steroids. This resulted in significant improvement within a week, with continued resolution at the one-month follow-up. Psoriasis and hidradenitis suppurativa are driven by chronic inflammation involving TNF-alpha and the IL-23/IL-17 axis. While TNF-alpha inhibitors like adalimumab reduce inflammation, paradoxical reactions like pustular psoriasis can occur due to enhanced interferon-alpha activity. In patients on this therapy who develop a new-onset diffuse pustular rash, an index of suspicion for this condition should be maintained. TNF-alpha inhibitors should be discontinued if pustular psoriasis develops, with IL-23 inhibitors providing a viable alternative.",
  "pub_date": "2025-05-22",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Dermatology, University of Missouri School of Medicine, Columbia, USA.",
    "Dermatology, University of Missouri School of Medicine, Columbia, USA.",
    "Dermatology, University of Missouri School of Medicine, Columbia, USA.",
    "Dermatology, University of Missouri School of Medicine, Columbia, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40546629/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}