{
  "pmid": "40545752",
  "title": "Switching biologic agent in patients with psoriasis: a systematic review and meta-analysis.",
  "abstract": "Multiple biologics are available for psoriasis treatment, but switching treatments is often necessary at some point. The choice between intraclass or interclass biologic switching has not been extensively investigated.\nTwo independent authors searched the databases PubMed and EMBASE for studies reporting on biologic switching in psoriasis patients. Our study was performed in line with the Preferred Reporting Items for Systematic Reviews and Meta Analyses (PRISMA) guidelines.\nA total of 19 publications, comprising 679 patients, were included. The intraclass switching group consisted of 519 patients, while the interclass switching group included 139 patients. For intraclass switching, there are respectively 160, 326 and 33 patients switched of TNF-α, IL-17, IL-23. For interclass switching, 11 patients switched from TNF-α to IL-17, 6 from IL-17 to IL-23, 41 from IL-17 to IL-12/23, 29 from IL-17 to TNF-α, 15 from IL-12/23 to IL-17, 8 from IL-12/23 to IL-23. After 12 weeks, the proportion of patients achieving Psoriasis Area and Severity Index (PASI)75 was significantly higher in the intraclass switching group compared to the interclass switching group. However, after 16-52 weeks, the PASI75 proportions were comparable between the groups.\nIntraclass switching shows better short-term efficacy than interclass switching. However, in the long term, both switching strategies are effective and safe. This study also shows that adalimumab, ixekizumab, and risankizumab are the preferred agents for intraclass switching, whereas guselkumab serves as the primary agent for interclass transitions.",
  "pub_date": "2025-06-22",
  "publication_types": [
    "Journal Article",
    "Systematic Review",
    "Meta-Analysis"
  ],
  "affiliations": [
    "Dermatology Hospital of Shandong First Medical University, Jinan, P.R. China.",
    "Shandong Provincial Institute of Dermatology and Venereology, Shandong Academy of Medical Sciences, Jinan, P.R. China.",
    "Dermatology Hospital of Shandong First Medical University, Jinan, P.R. China.",
    "Shandong Provincial Institute of Dermatology and Venereology, Shandong Academy of Medical Sciences, Jinan, P.R. China.",
    "Dermatology Hospital of Shandong First Medical University, Jinan, P.R. China.",
    "Shandong Provincial Institute of Dermatology and Venereology, Shandong Academy of Medical Sciences, Jinan, P.R. China.",
    "Dermatology Hospital of Shandong First Medical University, Jinan, P.R. China.",
    "Shandong Provincial Institute of Dermatology and Venereology, Shandong Academy of Medical Sciences, Jinan, P.R. China.",
    "Dermatology Hospital of Shandong First Medical University, Jinan, P.R. China.",
    "Shandong Provincial Institute of Dermatology and Venereology, Shandong Academy of Medical Sciences, Jinan, P.R. China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40545752/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}