{
  "pmid": "40557966",
  "title": "Prevalence of Asthma and Asthma Severity Among Patients with Moderate-Severe Atopic Dermatitis Treated with Advanced Systemics.",
  "abstract": "",
  "pub_date": "2025-06-25",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology and Venereology, Bispebjerg and Frederiksberg Hospital, University of Copenhagen, Copenhagen NV, Denmark. maria.oberlaender.christensen@regionh.dk.",
    "Department of Dermatology and Venereology, Bispebjerg and Frederiksberg Hospital, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Denmark; Department of Clinical Medicine, Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Denmark; Department of Clinical Medicine, Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy Centre, Odense University Hospital, University of Southern Denmark, Odense, Denmark.",
    "Department of Clinical Medicine, Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark; Department of Dermatology, Zealand University Hospital, Roskilde, Denmark.",
    "Department of Dermatology, Aalborg University Hospital, Aalborg, Denmark.",
    "Department of Dermatology and Venereology, Bispebjerg and Frederiksberg Hospital, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology and Venereology, Bispebjerg and Frederiksberg Hospital, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology and Venereology, Bispebjerg and Frederiksberg Hospital, University of Copenhagen, Copenhagen, Denmark; Department of Biomedical Sciences, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology, Aarhus University Hospital, Aarhus, Denmark."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40557966/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}