{
  "pmid": "40560559",
  "title": "Guselkumab for Moderate to Severe Psoriasis Across All Skin Tones: Cohort A of the VISIBLE Randomized Clinical Trial.",
  "abstract": "Data and educational gaps in populations with skin of color contribute to racial and ethnic disparities in psoriasis treatment. Cohort A of the VISIBLE study includes participants with psoriasis who self-identify as belonging to a racial or ethnic category other than White, across the entire skin-tone spectrum.\nTo evaluate efficacy, quality of life, and adverse event outcomes among participants with moderate to severe psoriasis and skin of color who received guselkumab, 100 mg, for up to 48 weeks.\nThis ongoing phase 3b, randomized clinical trial at 39 sites in the US and Canada enrolled adults with skin of color and moderate to severe psoriasis (body surface area [BSA] ≥10%; Psoriasis Area and Severity Index [PASI] ≥12; Investigator's Global Assessment [IGA] ≥3). Data were collected from August 2022 to June 2024.\nRandomized participants (3:1) received guselkumab, 100 mg, at weeks 0 and 4, then every 8 weeks, or placebo with crossover to guselkumab at weeks 16 and 20, then every 8 weeks.\nCoprimary end points were IGA score of 0 or 1 (IGA 0/1) and PASI improvement of 90% or more (PASI 90) at week 16 (guselkumab vs placebo). Major secondary end points included IGA 0; PASI 100; percentage changes from baseline in PASI and BSA; changes from baseline in Dermatology Life Quality Index (DLQI) and Psoriasis Symptoms and Signs Diary (PSSD) symptoms; and at least a 4-point reduction in PSSD itch.\nOf 103 participants (77 randomized to guselkumab; 26 randomized to placebo), 94 (91.3%) completed 48 weeks of treatment. The mean (SD) age overall was 44.1 (12.9) years, and 74 participants (71.8%) were male. At week 16, coprimary end points were achieved by greater proportions of guselkumab- vs placebo-treated participants (IGA 0/1: 57 of 77 [74.0%] vs 0 of 26; P < .001; PASI 90: 44 of 77 [57.1%] vs 1 of 26 [3.8%]; P < .001); 25 of 77 (32.5%) vs 0 of 26 achieved IGA 0 (P < .001), and 23 of 77 (29.9%) vs 0 of 26 achieved PASI 100 (P = .002). DLQI and PSSD symptoms score least-squares mean changes from baseline were -12.1 (95% CI, -13.1 to -10.9) vs -2.5 (95% CI, -4.4 to -0.6) (P < .001), and -49.4 (95% CI, -54.0 to -44.9) vs -8.2 (95% CI, -15.8 to -0.6) (P < .001), respectively. A 4-point or greater reduction in PSSD itch score was achieved by 48 (66.7%) vs 4 (16.7%) participants with a baseline score of at least 4 (P < .001). Efficacy increased and was maintained through week 48, with guselkumab-randomized participants achieving mean percentage improvements in PASI and BSA of more than 94%, and more than 50% of participants achieving complete clearance. Infections were the most common adverse events in the guselkumab (16 [20.8%]) and placebo (3 [11.5%]) groups through week 16, predominantly upper respiratory tract infection and nasopharyngitis.\nIn this randomized clinical trial, after 3 doses of guselkumab, significant skin clearance and quality of life improvements were observed in this cohort of participants with moderate to severe psoriasis and skin of color across the range of objectively measured skin tones. Improvements increased and were maintained through week 48.\nClinicalTrials.gov Identifier: NCT05272150.",
  "pub_date": "2025-09-01",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase III",
    "Multicenter Study"
  ],
  "affiliations": [
    "Department of Dermatology, Weill Cornell Medicine, New York, New York.",
    "Department of Dermatology, Wake Forest University School of Medicine, Winston-Salem, North Carolina.",
    "Southern California Dermatology Inc, Santa Ana.",
    "Johnson & Johnson, Horsham, Pennsylvania.",
    "Johnson & Johnson, Horsham, Pennsylvania.",
    "Driven Research LLC, Coral Gables, Florida.",
    "Department of Dermatology, Yale University School of Medicine, New Haven, Connecticut.",
    "Central Connecticut Dermatology, Cromwell.",
    "Nashville Skin Comprehensive Dermatology Center, Nashville, Tennessee.",
    "Synergy Dermatology, San Francisco, California.",
    "Johnson & Johnson, Horsham, Pennsylvania.",
    "Johnson & Johnson, Horsham, Pennsylvania.",
    "Probity Medical Research, Waterloo, Ontario, Canada.",
    "Department of Medicine, University of Toronto, Ontario, Canada.",
    "Department of Dermatology and Skin Science, University of British Columbia, Vancouver, British Columbia, Canada.",
    "Dr Chih-ho Hong Medical Inc, Surrey, British Columbia, Canada.",
    "Probity Medical Research, Surrey, British Columbia, Canada.",
    "Department of Medicine, University of Toronto, Ontario, Canada.",
    "FACET Dermatology, Toronto, Ontario, Canada.",
    "Department of Medicine, University of Toronto, Ontario, Canada.",
    "Johnson & Johnson, Spring House, Pennsylvania.",
    "Johnson & Johnson, Spring House, Pennsylvania.",
    "Johnson & Johnson, Spring House, Pennsylvania.",
    "Johnson & Johnson, Toronto, Ontario, Canada.",
    "Department of Dermatology, George Washington University School of Medicine, Washington, DC.",
    "Aesthetic & Dermatology Center, Rockville, Maryland.",
    "Lee Medical Associates, San Antonio, Texas.",
    "Department of Dermatology, Boston University School of Medicine, Boston, Massachusetts.",
    "Kindred Hair & Skin Center, Marriottsville, Maryland.",
    "Department of Dermatology, Howard University, Washington, DC.",
    "The Grimes Center for Medical and Aesthetic Dermatology, Vitiligo and Pigmentation Institute of Southern California, Los Angeles.",
    "Department of Dermatology, University of Pennsylvania, Philadelphia.",
    "Innovative Dermatology, Plano, Texas.",
    "Department of Dermatology, University of Texas Southwestern Medical Center, Dallas."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40560559/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}