{
  "pmid": "40577587",
  "title": "Early response is a strong predictor of the long-term response in psoriasis patients receiving risankizumab or guselkumab in the real-world: a retrospective analysis.",
  "abstract": "Recognizing early treatment indicators that forecast the long-term effectiveness of maintenance therapy in psoriasis (PsO) could support the optimization of personalized treatments. We aimed to evaluate whether an early response can predict long-term outcomes in patients receiving risankizumab or guselkumab, and to explore the factors associated with responses.\nThis retrospective study included PsO patients who received risankizumab or guselkumab continuously at least 1 year. The study measured disease severity using the Psoriasis Area Severity Index (PASI) and determined the percentage of patients treated with risankizumab or guselkumab who showed PASI50 at the 3rd month (early response), and assessed whether early response was associated with maintaining long-term response (PASI75 response at the 1st year).\nA total of 102 patients, including 60 who received risankizumab and 42 who received guselkumab, were enrolled. Early response at the 3rd month strongly predicted treatment outcomes at 12 months. Among early responders, the likelihood of achieving a long-term response was found to be 94.9%.\nIn patients with PsO treated with risankizumab or guselkumab, early response was a significant factor in maintaining stable long-term response. Therefore, early response is a clinically relevant factor to consider when optimizing individual therapeutic strategies.",
  "pub_date": "2025-07-02",
  "publication_types": [
    "Journal Article",
    "Comparative Study"
  ],
  "affiliations": [
    "School of Medicine, Department of Dermatology and Venereology, Hacettepe University, Ankara, Turkey.",
    "School of Medicine, Department of Dermatology and Venereology, Hacettepe University, Ankara, Turkey.",
    "School of Medicine, Department of Dermatology and Venereology, Hacettepe University, Ankara, Turkey.",
    "School of Medicine, Department of Dermatology and Venereology, Hacettepe University, Ankara, Turkey.",
    "School of Medicine, Department of Dermatology and Venereology, Hacettepe University, Ankara, Turkey.",
    "School of Medicine, Department of Dermatology and Venereology, Hacettepe University, Ankara, Turkey."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40577587/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}