{
  "pmid": "40605963",
  "title": "Patient-Reported Well-Being in Value-Based Routine Care Using Tildrakizumab: 52-week Interim Data of the Phase IV Positive Study.",
  "abstract": "Psoriasis profoundly impairs patients' social, emotional, and physical condition, impacting on their overall well-being. Tildrakizumab is an interleukin-23p19 inhibitor labelled for the treatment of moderate-to-severe plaque psoriasis. The main objective of this study was to assess the effect of tildrakizumab on the overall well-being of people with psoriasis. Effectiveness, quality of life (QoL), symptomatology, treatment satisfaction, and the impact of psoriasis on the patients' partners were also evaluated.\nPOSITIVE is a 24-month observational study in adults with moderate-to-severe psoriasis treated with tildrakizumab in a real-world setting (ClinicalTrials.gov ID: NCT04823247). Outcome measurements included the 5-item WHO Well-being Index (WHO-5), Psoriasis Area and Severity Index (PASI), Dermatology Life Quality Index-Relevant (DLQI-R), Treatment Satisfaction Questionnaire for Medication (TSQM-9), and FamilyPso. We report 52-week (W52) interim data (N = 400; observed cases).\nMean ± 95% CI WHO-5 score increased from 53.8 ± 2.2 at baseline to 66.0 ± 2.3/65.7 ± 2.7 at W28/W52 (p < 0.0001, both). Mean ± 95% CI PASI decreased from 13.1 ± 0.8 at baseline to 1.7 ± 0.3/1.5 ± 0.3 at W28/W52 (p < 0.0001, both). At W28 and W52, 85.8%/54.8% and 88.4%/56.8% of patients achieved PASI ≤ 3/≤ 1. Mean ± 95% CI DLQI-R score decreased from 12.6 ± 0.8 at baseline to 3.3 ± 0.6/3.1 ± 0.6 at W28/W52 (p < 0.0001, both). At W52, mean ± 95% CI TSQM-9 domain scores were 77.4 ± 3.2 for effectiveness, 81.5 ± 2.6 convenience, and 81.1 ± 2.6 global satisfaction. Mean ± 95% CI total FamilyPso decreased from 1.3 ± 0.1 at baseline to 0.7 ± 0.2 at W52 (p < 0.0001). At the point of this analysis, 24.0% of patients had ≥1 adverse event (AE). Only one patient discontinued due to a treatment-related AE.\nTildrakizumab successfully contributes to value-based long-term health care for moderate-to-severe psoriasis by increasing patient wellbeing, QoL and clinical outcomes while showing very good safety and tolerability.",
  "pub_date": "2025-06-28",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Psoriasis-Center, Department of Dermatology, University Medical Center Schleswig-Holstein, Campus Kiel, Kiel, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany.",
    "Psoriasis-Center, Department of Dermatology, University Medical Center Schleswig-Holstein, Campus Kiel, Kiel, Germany.",
    "Dermatology Department, Polyclinic Courlancy-Bezannes, Reims, France.",
    "Department of Dermatology and Venereology, Medical University of Graz, Graz, Austria.",
    "Dermatology Department, La Princesa University Hospital - Instituto de Investigación Sanitaria La Princesa (IIS-IP), Madrid, Spain.",
    "Department of Dermatology, University Hospital Zurich, Zurich, Switzerland.",
    "Faculty of Medicine, University of Zurich, Zurich, Switzerland.",
    "Department of Dermatology, Cliniques Universitaires Saint-Luc, Université Catholique de Louvain, Brussels, Belgium.",
    "Leeds Centre for Dermatology, Leeds Teaching Hospitals NHS Trust, Leeds, UK.",
    "Division of Dermatology, San Bortolo Hospital, Vicenza, Italy.",
    "Department of Dermatology, Radboud University Medical Center (Radboudumc), Nijmegen, the Netherlands.",
    "International Federation of Psoriasis Associations, Stockholm, Sweden.",
    "Almirall S.A, Barcelona, Spain.",
    "Almirall S.A, Barcelona, Spain.",
    "Almirall S.A, Barcelona, Spain.",
    "Almirall S.A, Barcelona, Spain.",
    "Almirall S.A, Barcelona, Spain.",
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40605963/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}