{
  "pmid": "40608253",
  "title": "Guselkumab Retention, Effectiveness, and Safety in Psoriasis: A 260-Week Real-World Multicenter Retrospective Study Exploring the Role of Concomitant PsA-IL PSO (Italian Landscape Psoriasis).",
  "abstract": "Guselkumab is a monoclonal antibody targeting the p19 subunit of interleukin (IL)-23, approved for the treatment of moderate-to-severe plaque psoriasis and psoriatic arthritis (PsA). While patients with psoriasis often achieve high clinical response rates (Psoriasis Area and Severity Index [PASI] 90 and PASI 100), the presence of PsA may influence long-term outcomes. We conducted a 260-week, multicenter, retrospective study to compare the effectiveness, safety, and drug survival of guselkumab in patients with and without concomitant PsA.\nA total of 1765 patients were enrolled, including 352 with a concomitant diagnosis of PsA and 1413 with isolated skin involvement. All patients were treated with guselkumab following the approved dosing schedule for moderate-to-severe plaque psoriasis for at least 1 year. Treatment effectiveness was evaluated in terms of PASI 90, PASI 100, and absolute PASI ≤ 2 at weeks 16, 28, 52, 104, 156, 204, and 260. Guselkumab drug survival was assessed using the Kaplan-Meier method at the same time points. The safety profile was evaluated by analyzing adverse events recorded in medical charts at each follow-up visit.\nThroughout the study period, response rates remained comparable between the two cohorts of patients, with a significant difference at 2 years of follow-up in terms of PASI 90 (80.51% versus 74.02%). Drug survival overall remained stable and similar, with 79.5% (95% confidence interval (CI) 76.9-81.9) of patients without PsA and 78.5% (95% CI 72.9-83.1) of patients with PsA still receiving guselkumab treatment after 5 years.\nOur results confirm the long-term effectiveness, persistence, and favorable safety profile of guselkumab in patients with moderate-to-severe psoriasis, regardless of the presence of concomitant PsA.",
  "pub_date": "2025-07-03",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy. mario.valenti@hunimed.eu.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy. mario.valenti@hunimed.eu.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy.",
    "Dermatologic Clinic, Department of Clinical Medicine, University of Turin, Turin, Italy.",
    "Department of Dermatology, Dermatology Unit Azienda Ospedaliera San Donato Milanese, Milan, Italy.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Department of Pathophysiology and Transplantation, Università Degli Studi di Milano, Milan, Italy.",
    "Department of Dermatology, University of Bari, Piazza Umberto I, 1, 70121, Bari, Italy.",
    "Department of Dermatology, Dipartimento di Scienze della Salute (DISSal), University of Genoa, IRCCS Ospedale Policlinico San Martino, Genoa, Italy.",
    "Dermatology Unit, University of Campania L. Vanvitelli, Naples, Italy.",
    "Department of Dermatology, University of Pisa, Pisa, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Department of Medicine, Section of Dermatology, University of Verona, Verona, Italy.",
    "Unit of Dermatology, Department of Medical, Surgical and Neurological Sciences, University of Siena, Siena, Italy.",
    "Dermatological Clinic, Department of Specialized Medicine, University of Modena, Modena, Italy.",
    "U.O.S.D. Dermatologica-Centro per la Cura della Psoriasi, Ospedale Perrino, Brindisi, Italy.",
    "Department of Biomedical and Dental Sciences and Morphofunctional Imaging, University of Messina, Messina, Italy.",
    "Dermatology Unit, Department of Medicine and Surgery, University of Insubria, Varese, Italy.",
    "Dermatologic Clinic, Department of Clinical Medicine, University of Turin, Turin, Italy.",
    "Department of Dermatology, Dermatology Unit Azienda Ospedaliera San Donato Milanese, Milan, Italy.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Department of Dermatology, Dipartimento di Scienze della Salute (DISSal), University of Genoa, IRCCS Ospedale Policlinico San Martino, Genoa, Italy.",
    "Department of Dermatology, Dermatology Unit Azienda Ospedaliera San Donato Milanese, Milan, Italy.",
    "Department of Dermatology, University of Pisa, Pisa, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Department of Medicine, Section of Dermatology, University of Verona, Verona, Italy.",
    "Unit of Dermatology, Department of Medical, Surgical and Neurological Sciences, University of Siena, Siena, Italy.",
    "Dermatologic Clinic, Department of Clinical Medicine, University of Turin, Turin, Italy.",
    "Dermatologic Clinic, Department of Clinical Medicine, University of Turin, Turin, Italy.",
    "Department of Dermatology, Dermatology Unit Azienda Ospedaliera San Donato Milanese, Milan, Italy.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    ", Rome, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40608253/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}