{
  "pmid": "40600112",
  "title": "Evolution of Drug Supply for Psoriasis from 2010 to 2022 - Real-World Claims Data Analysis in Germany.",
  "abstract": "The management of psoriasis has undergone substantial evolution; however, the long-term prescription trends remain ambiguous. This study utilised a comprehensive data set of psoriasis drug prescriptions in Germany from 2010 to 2022, with the objective of evaluating the evolution of treatment modalities over time.\nA retrospective longitudinal claims data analysis on systemic biologicals, non-biologicals, and topical treatments for psoriasis was conducted covering prescription rates, medical costs from the payer's perspective, and defined daily doses (DDDs).\nPsoriasis prevalence increased slightly from 2.6% in 2010 to 2.7% in 2022. During this period, the proportion of persons receiving prescriptions rose from 55.0% in 2010 to 57.4% in 2022. By 2022, 46.2% of these persons received topical treatments, 13.0% systemic glucocorticosteroids (SCS), 6.7% non-biologicals, and 6.2% biologicals. Compared to 2010, the use of biologicals increased by 449.8%, SCS by 12.6%, non-biologicals by 13.9%, while topical treatments decreased by 3.2%. The annual cost per person treated with a biologic decreased from €16,315 to €13,412, while non-biologic and topical therapy costs increased slightly. Adalimumab was the most frequently prescribed systemic drug, followed by ustekinumab and secukinumab. The highest mean costs per-person were for ustekinumab (€19,717) and risankizumab (€16,986).\nIn more than a decade, the use of innovative systemic drugs, especially biologicals, in Germany has increased substantially. Despite their high cost, biologic expenses per person have slightly decreased over time.",
  "pub_date": "2025-06-27",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany.",
    "Institute for Health Services Research in Dermatology and Nursing (IVDP), University Medical Center Hamburg-Eppendorf (UKE), Hamburg, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40600112/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}