{
  "pmid": "40615297",
  "title": "Highly selective tyrosine kinase 2 inhibition with zasocitinib (TAK-279) improves outcomes in patients with active psoriatic arthritis: a randomised phase 2b study.",
  "abstract": "To assess the efficacy, safety, and tolerability of the investigational, oral, allosteric, highly selective, and potent tyrosine kinase 2 inhibitor zasocitinib (TAK-279) in patients with active psoriatic arthritis (PsA).\nIn this phase 2b, randomised, multicentre, double-blind, placebo-controlled, multiple-dose study, patients (≥18 years, with PsA symptoms for ≥6 months) received 30 mg, 15 mg, or 5 mg zasocitinib or placebo (1:1:1:1) once daily for 12 weeks, with a 4-week safety follow-up. The primary endpoint was American College of Rheumatology (ACR)20 response at week 12. Secondary efficacy endpoints included ACR50 response, ACR70 response, Psoriasis Area and Severity Index (PASI) 75 response among those with ≥3% body surface area at baseline and minimal disease activity (MDA) at week 12.\nOverall, 290 patients (mean [SD] age, 49.9 [11.6] years; 57.2% female) received treatment. At week 12, 30 mg or 15 mg zasocitinib treatment resulted in significantly higher ACR20 responses (54.2%; P = .002 and 53.3%; P = .002, respectively) than placebo (29.2%). A numerically higher number of ACR50 responses were achieved at week 12 with 30 mg (26.4%; nominal P = .009) or 15 mg (26.7%; nominal P = .005) zasocitinib than placebo (9.7%). In addition, 30 mg zasocitinib demonstrated a numerically higher number of ACR70 responses (13.9% versus 5.6%, respectively; nominal P = .158), PASI 75 responses (45.7% versus 15.4%, respectively; nominal P = .002), and MDA (29.2% versus 12.5%, respectively; nominal P = .014) at week 12 versus placebo. In this small study of limited duration, most adverse events were mild/moderate and were more frequently observed in the higher dose group. In this small sample size, no new safety signals or clear dose-dependent laboratory parameter changes were identified.\nHere, 30 mg and 15 mg zasocitinib demonstrated efficacy across core domains in patients with active PsA with no new safety signals. These findings will be confirmed in ongoing larger studies of longer duration.",
  "pub_date": "2025-07-04",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Multicenter Study",
    "Clinical Trial, Phase II"
  ],
  "affiliations": [
    "Altoona Center for Clinical Research, Duncansville, PA, USA.",
    "Rheumazentrum Ruhrgebiet Herne, Ruhr-University Bochum, Germany.",
    "Takeda Development Center Americas, Inc, Cambridge, MA, USA. Electronic address: elena.muensterman@takeda.com.",
    "Division of Rheumatology, Autoimmunity and Inflammation, University of California San Diego Medical School, San Diego, CA, USA.",
    "Leiden University Medical Center, Leiden, Netherlands.",
    "Department of Rheumatology and Internal Diseases, Medical University of Bialystok and Inter Clinic Piotr Adrian Klimiuk, Białystok, Poland.",
    "Integral Rheumatology & Immunology Specialists, Plantation, FL, USA.",
    "Department of Pharmaceutical Technology, Faculty of Pharmacy, Masaryk University, Brno, Czech Republic and MEDICAL PLUS, s.r.o., Uherské Hradiště, Czech Republic.",
    "Nimbus Discovery, Inc, Boston, MA, USA.",
    "Nimbus Discovery, Inc, Boston, MA, USA.",
    "Nimbus Discovery, Inc, Boston, MA, USA.",
    "Nimbus Discovery, Inc, Boston, MA, USA.",
    "Takeda Development Center Americas, Inc, Cambridge, MA, USA.",
    "Takeda Development Center Americas, Inc, Cambridge, MA, USA.",
    "Takeda Development Center Americas, Inc, Cambridge, MA, USA.",
    "HW MedAdvice LLC, San Diego, CA, USA.",
    "Takeda Development Center Americas, Inc, Cambridge, MA, USA.",
    "Takeda Development Center Americas, Inc, Cambridge, MA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40615297/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}