{
  "pmid": "40625381",
  "title": "A successful combination of upadacitinib and guselkumab in refractory psoriasis and psoriatic arthritis: A case report.",
  "abstract": "Monotherapy may not be sufficient for the complete control of the psoriatic disease in selected patients. In refractory patients, combining two drugs with different mechanisms of action may result in improved efficacy. Data regarding the combination of biologics and Janus kinase inhibitors are lacking. A 61-year-old man affected by severe chronic plaque psoriasis and peripheral psoriatic arthritis affecting hands and feet, dactylitis, and enthesitis was successfully treated with a combination of upadacitinib and guselkumab. The combination of the two drugs was needed because upadacitinib was effective on psoriatic arthritis, but not on the skin lesions, while responding to guselkumab, which, vice versa, was not effective on psoriatic arthritis. Notably, the patients failed different conventional synthetic and biologic drugs. At a follow-up of 12 months, he had not experienced adverse events or laboratory alterations. Other studies are necessary to confirm the efficacy and safety profile of upadacitinib associated with guselkumab.",
  "pub_date": "2025-07-01",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Section of Rheumatology, Department of Medicine, University of Verona, Italy.",
    "Section of Rheumatology, Department of Medicine, University of Verona, Italy.",
    "Section of Rheumatology, Department of Medicine, University of Verona, Italy.",
    "Section of Rheumatology, Department of Medicine, University of Verona, Italy.",
    "Section of Rheumatology, Department of Medicine, University of Verona, Italy.",
    "Section of Dermatology and Venereology, Department of Medicine, University of Verona, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40625381/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}