{
  "pmid": "40621465",
  "title": "Case Report: Guselkumab treatment for sintilimab-exacerbated psoriasis in a cancer patient.",
  "abstract": "Psoriasis is a chronic inflammatory skin disease associated with multisystem comorbidities and impaired mental health. The lesions are typically characterized by sharply demarcated, erythematous plaques covered with silvery scales. Treatment options include topical agents, phototherapy, systemic therapies, and biologic agents. Traditional systemic treatments are generally contraindicated in patients with cancer due to their immunosuppressive effects. Although biologics are widely used in the management of psoriasis, their safety in patients with malignancy remains insufficiently evaluated, as individuals with cancer are typically excluded from clinical trials due to concerns about cancer progression. We report the case of a 61-year-old man whose psoriasis markedly worsened following treatment with sintilimab for pulmonary metastases secondary to colon cancer. The patient was successfully treated with guselkumab, an interleukin (IL)-23 inhibitor, resulting in significant improvement in psoriasis symptoms, while the pulmonary condition remained stable during follow-up after completion of standard cancer therapy. This case highlights the potential utility of IL-23 inhibitors as safe and effective treatment options for patients with concomitant psoriasis and malignancy.",
  "pub_date": "2025-06-20",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Shanghai Sixth People's Hospital Affiliated to Shanghai Jiao Tong University School of Medicine, Shanghai, China.",
    "Department of Dermatology, Shanghai Sixth People's Hospital Affiliated to Shanghai Jiao Tong University School of Medicine, Shanghai, China.",
    "Department of Dermatology, Shanghai Sixth People's Hospital Affiliated to Shanghai Jiao Tong University School of Medicine, Shanghai, China.",
    "Department of Dermatology, Shanghai Sixth People's Hospital Affiliated to Shanghai Jiao Tong University School of Medicine, Shanghai, China.",
    "Department of Dermatology, Shanghai Sixth People's Hospital Affiliated to Shanghai Jiao Tong University School of Medicine, Shanghai, China.",
    "Department of Dermatology, Shanghai Sixth People's Hospital Affiliated to Shanghai Jiao Tong University School of Medicine, Shanghai, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40621465/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}