{
  "pmid": "40649154",
  "title": "Systemic Biologic Treatment for Psoriasis in Elderly Patients.",
  "abstract": "Approximately 3-13% of patients with psoriasis are first affected after age 60 years. Numerous studies have investigated the use of biologic agents for the treatment of psoriasis, but the routine exclusion of elderly adults from clinical trials has limited our knowledge about their effects in this age group. Background/Objectives: This study aimed to investigate the efficacy and safety of biologic drugs for the treatment of psoriasis in elderly patients. Methods: A single-center-based retrospective cohort study design was used. A total of 149 elderly patients with psoriasis were divided into two groups by age at initiation of biologic treatment: <65 years (adult-start group) and >65 years (elderly-start group). Data on patient characteristics were collected and analyzed, and drug survival was evaluated. Results: Demographics, comorbidities, and treatment turnover were similar in the adult-start and elderly-start groups. Drug survival of adalimumab as first-line treatment, and of guselkumab in any treatment sequence, was significantly better in the elderly-start group (p = 0.029 and p = 0.032, respectively). There was no between-group difference in drug safety, as reflected in hospitalizations for infection or death. Conclusions: Biologic treatments for psoriasis demonstrate both efficacy and safety in elderly patients. Some agents exhibited better drug survival when initiated after age 65 years.",
  "pub_date": "2025-07-07",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Division of Dermatology, Rabin Medical Center, Beilinson Hospital, Petach Tikva 49100, Israel.",
    "Faculty of Medical and Health Sciences, Tel Aviv University, Tel Aviv 69978, Israel.",
    "Division of Dermatology, Rabin Medical Center, Beilinson Hospital, Petach Tikva 49100, Israel.",
    "Faculty of Medical and Health Sciences, Tel Aviv University, Tel Aviv 69978, Israel.",
    "Division of Dermatology, Rabin Medical Center, Beilinson Hospital, Petach Tikva 49100, Israel.",
    "Faculty of Medical and Health Sciences, Tel Aviv University, Tel Aviv 69978, Israel.",
    "Division of Dermatology, Rabin Medical Center, Beilinson Hospital, Petach Tikva 49100, Israel.",
    "Faculty of Medical and Health Sciences, Tel Aviv University, Tel Aviv 69978, Israel."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40649154/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}