{
  "pmid": "40645621",
  "title": "European, multicentre, prospective observational phase IV clinical study to assess the impact of lebrikizumab on health-related well-being and control of skin manifestations in patients with moderate-to-severe atopic dermatitis (ADTrust): study protocol.",
  "abstract": "Atopic dermatitis (AD) is a chronic, relapsing, heterogeneous skin disease affecting 2%-7% of adults, with roughly 30% having moderate-to-severe disease. AD symptoms, like intense itching and skin pain, carry a substantial disease burden that negatively impacts patients' quality of life (QoL) and psychosocial well-being. Lebrikizumab is a novel, high-affinity monoclonal antibody that selectively binds to and neutralises interleukin-13 with high potency. Three clinical trials with lebrikizumab (ADvocate 1 and 2; ADhere) demonstrated significant clinical benefit in patients with AD, while the 3-year long-term extension study of lebrikizumab (ADjoin) further demonstrated long-term efficacy and safety in patients with AD. The ADTrust study will evaluate patient well-being, their relationship with their skin, long-term effectiveness, and safety of lebrikizumab, treatment satisfaction, and long-term effect of lebrikizumab treatment on different aspects of patients' lives, including itch, pain, sleep, fatigue, work impairment and overall QoL among adult patients with moderate-to-severe AD in a real-world setting.\nThis non-interventional, prospective, observational, real-world evidence study will involve approximately 150 sites across Europe and approximately 1200 adults with moderate-to-severe AD treated with lebrikizumab for 2 years. The primary endpoint is patient well-being assessed by the 5-item WHO Well-Being Index (WHO-5) questionnaire. Key secondary endpoints include clinical effectiveness (Eczema Area and Severity Index and Investigator's Global Assessment Scale), disease symptomatology and control (Patient-Oriented Eczema Measure, 24-hour peak pruritus, skin pain, fatigue and sleep quality Numerical Rating Scale, and safety and tolerability. Other validated endpoints will evaluate physician-reported and patient-reported QoL and treatment satisfaction (Dermatology Life Quality Index, Treatment Satisfaction Questionnaire-9), patients' work productivity and impairment (Work Productivity and Activity Impairment (WPAI)-AD) and disease control (AD Control Tool). Novel experimental endpoints will also be evaluated with the aim to assess patients' relationship with their skin (SkinLove questionnaire), disease control (intensity and frequency of flares) and an Effectiveness Diary+© (a brief monthly survey on a voluntary basis with the aim to assess the long-term impact of lebrikizumab on three fundamental aspects of the patients' life: the well-being (WHO-5), the itch intensity (24 hours peak pruritus) and the frequency and intensity of flares). Statistical analyses will be descriptive and explorative and based on observed cases. Missing data imputation may be used to handle missing data for primary endpoints and secondary effectiveness endpoints.\nThis study will be conducted according to the protocol, which has ethics committee approval (Hamburg Ethic Committee in Germany: 2024-101358-BO-ff), and all applicable laws and regulatory requirements for each participating country. The results will be disseminated through scientific publications and congress presentations.\nNCT06815380 (Pre-results).",
  "pub_date": "2025-07-11",
  "publication_types": [
    "Journal Article",
    "Clinical Trial Protocol"
  ],
  "affiliations": [
    "Institute for Health Services Research in Dermatology and Nursing, University Medical Center Hamburg-Eppendorf, Hamburg, Germany m.augustin@uke.de.",
    "Whipps Cross University Hospital, Whitechapel, London, UK.",
    "Royal London Hospital, Whitechapel, London, UK.",
    "Department of Dermatology, University Hospital Zurich, Zürich, Switzerland.",
    "University of Zurich, Zürich, Switzerland.",
    "Christine Kühne-Center for Allergy Research and Education, Davos, Switzerland.",
    "Department of Dermatology and Allergology, National Expertise Center for Atopic Dermatitis, University Medical Center Utrecht, Utrecht, Netherlands.",
    "Department of Dermatology, EpiDermE, Henri Mondor Hospital, Université Paris-Est Créteil, Créteil, France.",
    "Department of Dermatology, Université Paris-Est Créteil Val de Marne-Université Paris, Créteil, France.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Department of Dermatovenereology, Third Faculty of Medicine, Charles University and Kralovske Vinohrady University Hospital, Prague, Czech Republic.",
    "Dermatology Department, Hospital Universitario La Paz, Madrid, Spain.",
    "Division of Dermatology and Venereology, Department of Medicine Solna, Karolinska Institute, Stockholm, Sweden.",
    "Department of Dermatology and Venereology, Karolinska University Hospital, Stockholm, Sweden.",
    "Department of Dermatovenerology, University Hospital Luis Pasteur, Košice, Slovakia.",
    "Department of Dermatology, Ghent University Hospital, Ghent, Belgium.",
    "Abteilung für Dermatologie und Venerologie, Medizinische Universität Graz, Graz, Austria.",
    "Department of Dermatology, Oslo University Hospital, Oslo, Norway.",
    "Faculty of Medicine, Institute of Clinical Medicine, University of Oslo, Oslo, Norway.",
    "Department of Dermato-Venereology, 4th Military Hospital, Faculty of Medicine, University of Science and Technology, Wroclaw, Poland.",
    "Department of Dermatology, CAC ICBAS-CHP, Porto, Portugal.",
    "Unit for Multidisciplinary Research in Biomedicine, Instituto de Ciências Biomédicas Abel Salazar, University of Porto, Porto, Portugal.",
    "Department of Dermatology, Aarhus University Hospital, Aarhus, Denmark.",
    "Department of Dermatology and Allergy, Hannover Medical School, Hannover, Germany.",
    "Almirall S.A, Barcelona, Spain.",
    "Almirall S.A, Barcelona, Spain.",
    "Almirall S.A, Barcelona, Spain.",
    "Avant Health LLC, Bethesda, Maryland, USA.",
    "Almirall S.A, Barcelona, Spain.",
    "Department of Dermatology, Vrije Universiteit Brussel, Universitair Ziekenhuis Brussels, Jette, Belgium."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40645621/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}