{
  "pmid": "40672772",
  "title": "Gaps in Documentation of Psoriatic Domains in General Rheumatologic Practices Compared to Rheumatology-Dermatology Combined Clinics.",
  "abstract": "In order to apply current treatment recommendations for psoriatic arthritis (PsA), a complete assessment of psoriatic disease domains must be completed by the clinician. This includes a musculoskeletal examination (including tender and swollen joints, dactylitis, enthesitis, and axial disease) as well as skin and nail examination. Documentation in the clinician's note serves as a proxy for disease assessment.\nTo explore differences in documentation of psoriatic domains between PsA specialist and general rheumatologists at 2 academic centers.\nWe identified PsA patients seen by either general rheumatologists or by PsA combined clinic specialist providers at 2 established PPACMAN (Psoriasis and Psoriatic Arthritis Clinics Multicenter Advancement Network) sites. Records were assessed for the presence (and extent) of documentation for musculoskeletal and cutaneous PsA domains. We also examined accuracy of ICD coded diagnoses to understand the extent to which discrete data from the electronic medical record can be used to evaluate completeness of assessment.\nPsA combined clinic specialist providers documented disease domains significantly more consistently compared to generalists, including tender and swollen joint counts (P < 0.001), assessment of spondyloarthritis (P = 0.017), and presence/extent of skin involvement (P < 0.001). Additionally, PsA specialists more consistently coded for both psoriasis (PsO) and PsA.\nIn this multicenter, retrospective study, compared to generalists, PsA combined-clinic specialist providers more thoroughly documented both musculoskeletal and cutaneous psoriatic disease domains and ICD coding of PsO for patients, highlighting gaps in assessment and documentation. These findings underscore the need for improved training in psoriatic disease assessment and simplified modalities for documentation.",
  "pub_date": "2025-07-14",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "NYU Grossman School of Medicine, New York, NY, USA.",
    "Department of Medicine, NYU Grossman School of Medicine, New York, NY, USA.",
    "Department of Medicine and Rheumatology, University of Pennsylvania Perelman School of Medicine, Philadelphia, PA, USA.",
    "Department of Medicine and Rheumatology, University of Pennsylvania Perelman School of Medicine, Philadelphia, PA, USA.",
    "NYU Grossman School of Medicine, New York, NY, USA.",
    "Department of Medicine, NYU Grossman School of Medicine, New York, NY, USA.",
    "Division of Rheumatology, Department of Dermatology and Department of Medicine, UT Southwestern Medical Center and O'Donnell School of Public Health, Dallas, TX, USA.",
    "NYU Grossman School of Medicine, New York, NY, USA.",
    "Department of Medicine, NYU Grossman School of Medicine, New York, NY, USA.",
    "Department of Medicine and Rheumatology, University of Pennsylvania Perelman School of Medicine, Philadelphia, PA, USA.",
    "NYU Grossman School of Medicine, New York, NY, USA.",
    "Department of Medicine, NYU Grossman School of Medicine, New York, NY, USA.",
    "NYU Judith and Stewart Colton Center for Autoimmunity, New York, NY, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40672772/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}