{
  "pmid": "40676461",
  "title": "Time to Onset of Action for Biologics and Targeted Treatments in Psoriasis: Systematic Targeted Literature Review and Network Meta-Analysis.",
  "abstract": "For some patients with plaque psoriasis (PsO), a rapid response (i.e. short interval to time to onset of action [TOA]) is desired. The primary objective was to determine average time to achieve a Psoriasis Area and Severity Index (PASI) 90 response (50% of patients) for individual biologics or targeted therapies. Secondary outcomes included the average time to achieve a PASI 75 response (50% of patients), as well as PASI 90 and PASI 75 responses over the first 16 weeks of therapy.\nA systematic targeted literature review was conducted to identify phase III and IV randomised, double-blinded trials according to pre-specified eligibility criteria that investigated interleukin (IL)-12/23 inhibitors, IL-17 inhibitors, IL-23 inhibitors, Janus kinase (JAK) inhibitors, and phosphodiesterase (PDE) inhibitors. Using proportions of patients achieving PASI 90 or 75 responses over 16 weeks, network meta-analyses were conducted to estimate response over time. This was presented as curves, and TOA was summarized as median time to reach the 50th percentile.\nForty-five trials were included in the main analyses. The IL-17 inhibitors bimekizumab, ixekizumab, brodalumab, and secukinumab 300 mg were estimated to provide the earliest onset of PASI 90 response at approximately 6 to 8 weeks. This was followed by the IL-23 inhibitors risankizumab and guselkumab at approximately 9-10 weeks, and the IL-12/23 inhibitor at 11-12 weeks. Although wide and overlapping credible intervals and similar point estimates were observed, these results suggest onset of action does not vary greatly across biologics in these classes. Onset of PASI 90 response could not be estimated by the model for tildrakizumab, and JAK and PDE4 inhibitors. Onset of PASI 75 response showed similar trends to PASI 90 response.\nIL-17 inhibitors, followed by IL-23 inhibitors, have the most rapid TOA among PsO biologics evaluated; any differences in onset of action between specific agents within the same drug class are not statistically or clinically significant. These analyses will allow clinicians to make more informed treatment decisions for their patients.",
  "pub_date": "2025-07-17",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Alliance Clinical Trials, Waterloo, ON, Canada.",
    "Division of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "McMaster University, Hamilton, ON, Canada.",
    "Dermatrials Research Inc, Hamilton, ON, Canada.",
    "Dalhousie University, Halifax, NS, Canada.",
    "Western University, London, ON, Canada.",
    "University of Saskatchewan, Saskatoon, SK, Canada.",
    "University of Alberta, Edmonton, AB, Canada.",
    "Division of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Sunnybrook Health Sciences Centre, Toronto, ON, Canada.",
    "Johnson & Johnson, Toronto, ON, Canada.",
    "Johnson & Johnson, Toronto, ON, Canada.",
    "Johnson & Johnson, Horsham, USA.",
    "EVERSANA, Burlington, ON, Canada.",
    "EVERSANA, Burlington, ON, Canada.",
    "EVERSANA, Burlington, ON, Canada.",
    "Dalhousie University, Halifax, NS, Canada. richardgblangley@gmail.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40676461/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}