{
  "pmid": "40685883",
  "title": "Systemic treatment of immune checkpoint inhibitor-induced psoriasis: Inference-based guidance.",
  "abstract": "Immune checkpoint inhibitors (ICIs) are increasingly used to treat various cancers. Their use may result in immune-related adverse events, including psoriasis. When managing psoriasis, induced or exacerbated by an ICI, there are concerns regarding immunosuppression from systemic agents for the treatment of psoriasis (saPs) and the potential impact on ICI efficacy. No direct, high-level evidence exists to address these concerns.\nTo address clinically relevant questions regarding the management of ICI-mediated psoriasis (ICI-Ps) with saPs.\nWe convened a multidisciplinary panel of 15 international specialists in dermatology, oncology, immunology, and rheumatology. A Delphi process defined clinical concerns related to the systemic treatment of ICI-Ps, focusing on the potential of saPs to impact ICI effectiveness. The saPs considered included biologics targeting tumour necrosis factor, interleukin (IL)-17, IL-12/23 and IL-23, traditional systemic therapies (cyclosporine, methotrexate), small molecules targeting phosphodiesterase-4 or tyrosine kinase 2, systemic retinoids (acitretin), and systemic corticosteroids. A systematic review of the literature was supplemented with evidence supporting an inference-based methodology to derive conclusions on the use of systemic therapies in patients with ICI-Ps. The specialist panel rated the strength of the conclusions using a probabilistic scale.\nAfter reviewing the totality of direct and indirect evidence, we drafted inference-based conclusions and ascribed a level of support, focusing on the potential impact of saPs on ICI efficacy. This work provides a structured framework informing healthcare professional and patient discussions on the risks and benefits of using saPs in patients with cancer who experience ICI-Ps.\nAlthough there is no direct evidence, we support the following conclusions: saPs may be used to treat ICI-Ps without an appreciable loss of ICI effectiveness. Generally, it is not necessary to interrupt ICI therapy. When available, non-steroid saPs are preferred over systemic corticosteroids for the treatment of psoriasis.",
  "pub_date": "2025-07-21",
  "publication_types": [
    "Journal Article",
    "Systematic Review"
  ],
  "affiliations": [
    "Probity Medical Research Inc., Waterloo, Ontario, Canada.",
    "Alliance Clinical Research, Waterloo, Ontario, Canada.",
    "Department of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, Ontario, Canada.",
    "Department of Dermatology, Hospital de la Santa Creu i Sant Pau, Barcelona, Spain.",
    "Institut de Recerca Sant Pau (IR SANT PAU), Barcelona, Spain.",
    "Faculty of Medicine, Universitat Autònoma de Barcelona, Barcelona, Spain.",
    "Probity Medical Research Inc., Waterloo, Ontario, Canada.",
    "University of Ottawa, Ottawa, Ontario, Canada.",
    "Division of Dermatology, The Ottawa Hospital, Ottawa, Ontario, Canada.",
    "Ottawa Hospital Research Institute, Ottawa, Ontario, Canada.",
    "Gladman-Krembil Psoriatic Arthritis Research Program, Centre for Prognosis Studies in the Rheumatic Diseases, Schroeder Arthritis Institute, Krembil Research Institute, University Health Network, Toronto, Ontario, Canada.",
    "Division of Rheumatology, Department of Medicine, University of Toronto, Toronto, Ontario, Canada.",
    "Department of Laboratory Medicine and Pathobiology, University of Toronto, Toronto, Ontario, Canada.",
    "Institute of Medical Science, University of Toronto, Toronto, Ontario, Canada.",
    "Melanoma and Skin Cancer Clinic, Hôtel-Dieu de Québec, et Centre Intégré de Cancérologie, Centre Hospitalier Universitaire de Québec, Quebec City, Quebec, Canada.",
    "Medica Scientia Innovation Research (MEDSIR), Barcelona, Spain.",
    "Medica Scientia Innovation Research (MEDSIR), Ridgewood, New Jersey, USA.",
    "Pangaea Oncology, Quiron Group, International Breast Cancer Center (IBCC), Barcelona, Spain.",
    "Department of Medicine, Faculty of Biomedical and Health Sciences, Universidad Europea de Madrid, Madrid, Spain.",
    "IOB Madrid, Institute of Oncology, Hospital Beata María Ana, Madrid, Spain.",
    "Oncology Department, Ribera Group, Hospital Universitario Torrejón, Madrid, Spain.",
    "Department of Dermatology and Skin Science, Faculty of Medicine, University of British Columbia, Vancouver, British Columbia, Canada.",
    "Arthritis Research Canada, Vancouver, British Columbia, Canada.",
    "Division of Rheumatology, Vancouver General Hospital, Vancouver, British Columbia, Canada.",
    "BC Children's Hospital Research Institute, Vancouver, British Columbia, Canada.",
    "Department of Dermatology, Oregon Health & Science University, Portland, Oregon, USA.",
    "Department of Oncology, Juravinski Cancer Centre, McMaster University, Hamilton, Ontario, Canada.",
    "Department of Medical Oncology, BC Cancer, Vancouver, British Columbia, Canada.",
    "Faculty of Medicine, University of British Columbia, Vancouver, British Columbia, Canada.",
    "Department of Dermatology, MD Anderson Cancer Center, University of Texas, Houston, Texas, USA.",
    "Department of Dermatology, Health Science Center, University of Texas, Houston, Texas, USA.",
    "Probity Medical Research Inc., Waterloo, Ontario, Canada.",
    "Department of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, Ontario, Canada.",
    "The Ottawa Hospital Cancer Centre, Ottawa, Ontario, Canada.",
    "Division of Medical Oncology, The Ottawa Hospital, University of Ottawa, Ottawa, Ontario, Canada.",
    "Department of Oncodermatology, Oncopole Claudius Regaud, Toulouse, France.",
    "Division of Medical Oncology, Department of Medicine, Dalhousie University, Halifax, Nova Scotia, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40685883/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}