{
  "pmid": "40704660",
  "title": "Improvement and maintenance of clinical outcome assessments in atopic dermatitis with amlitelimab.",
  "abstract": "Amlitelimab, a fully human, nondepleting, anti-OX40 ligand monoclonal antibody, demonstrated reductions in lesional and pruritic endpoints in adults with moderate-to-severe atopic dermatitis (AD) in phase 2a and 2b trials.\nHere, we examined the effect and durability of amlitelimab on clinical outcome assessments (COAs) in the randomized STREAM-AD phase 2b trial.\nAdults with moderate-to-severe AD with prior inadequate response to or inadvisability of topical medications received subcutaneous amlitelimab (250 mg with 500-mg loading dose, 250 mg, 125 mg or 62.5 mg) or placebo every 4 weeks in Part 1 (Weeks 0-24; 1:1:1:1:1 randomization). In Part 2, Week 24 clinical responders (defined as patients achieving Investigator Global Assessment [IGA] 0/1 and/or ≥ 75% reduction in the Eczema Area and Severity Index [EASI-75]) were rerandomized 3:1 to withdraw or continue amlitelimab pre-Week 24 dose through Week 52. COAs, including SCORing Atopic Dermatitis, affected body surface area, Patient-Oriented Eczema Measure, Dermatology Life Quality Index and Atopic Dermatitis Control Tool, were evaluated.\nOf the 390 randomized patients in Part 1, 190 were rerandomized in Part 2. Significant improvements in COAs were observed with all amlitelimab doses versus placebo at Week 24 (p < 0.05 for all COAs). At Week 24, the majority of clinical responders achieved meaningful changes in COAs. At Week 52, these improvements were maintained in the majority of patients who achieved COA improvements at Week 24, regardless of treatment continuation or withdrawal during the 28-week Part 2 period.\nAmlitelimab treatment led to clinically meaningful improvements in COAs by Week 24 versus placebo. COA improvements were maintained at Week 52 in patients continuing amlitelimab, as well as in patients who withdrew from amlitelimab, supporting the durable response of amlitelimab and the viability of extended drug dosing, which may ease treatment burden.\nClinicalTrials.gov Identifier: NCT05131477.",
  "pub_date": "2025-07-24",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase II",
    "Multicenter Study"
  ],
  "affiliations": [
    "Blauvelt Consulting LLC, Annapolis, Maryland, USA.",
    "Chicago Medical School, Rosalind Franklin University of Medicine and Science, North Chicago, Illinois, USA.",
    "Center for Medical Dermatology and Immunology Research, Chicago, Illinois, USA.",
    "Department of Dermatology and Department of Medicine, Division of Rheumatology, University of Texas Southwestern Medical Center, O'Donnell School of Public Health, Dallas, Texas, USA.",
    "Department of Dermatology and Allergy, University Hospital Schleswig-Holstein, Kiel, Germany.",
    "Department of Dermatology, Dokkyo Medical University, Tochigi, Japan.",
    "Sanofi, Reading, UK.",
    "Sanofi, Paris, France.",
    "Sanofi, Boston, Massachusetts, USA.",
    "Sanofi, Boston, Massachusetts, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40704660/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}