{
  "pmid": "40717537",
  "title": "Mild psoriasis as a suitable model for proof-of-mechanism in a phase 1B setting: Results from a double-blind placebo-controlled trial with guselkumab.",
  "abstract": "Early clinical development of novel psoriasis therapies is hampered by a decreasing number of moderate-to-severe psoriasis patients eligible for participation in trials since efficacious treatments, such as biologics, have become widely available. The aim of this study was to establish mild psoriasis patients as a suitable alternative trial population since these patients are generally not eligible for these treatments.\nA randomized double-blind controlled trial was performed in 20 mild psoriasis patients (psoriasis area and severity index ≤5), randomized 3:1 to guselkumab 100 mg or placebo, and 5 moderate-to-severe psoriasis patients (psoriasis area and severity index ≥10) on guselkumab 100 mg. Clinical scoring was performed over 24 weeks and substantiated with multimodal imaging comprising multispectral imaging, optical coherence tomography and laser speckle contrast imaging.\nClinician-reported outcomes demonstrated significant treatment effects compared to placebo in mild patients. Focusing on a target plaque, severity scores significantly decreased during treatment with guselkumab only. Imaging demonstrated significant decreases in erythema, maximal height within-lesion and cutaneous perfusion compared to placebo. Plaques of mild and moderate-to-severe patients did not differ at baseline and showed similar treatment responses.\nClinical scoring and multimodal lesion monitoring enabled the detection of a clear treatment effect of guselkumab in mild psoriasis patients. Although this trial was not powered to demonstrate equivalence between the severity groups, our results indicate that the treatment responses follow the same trend in mild and moderate-to-severe patients with a high degree of similarity. Therefore, mild patients can be considered a suitable study population for early phase proof-of-concept trials.",
  "pub_date": "2025-07-28",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase I"
  ],
  "affiliations": [
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Leiden Academic Centre for Drug Research, Leiden University, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Leiden Academic Centre for Drug Research, Leiden University, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Leiden Academic Centre for Drug Research, Leiden University, Leiden, the Netherlands.",
    "Leiden University Medical Centre, Leiden, the Netherlands.",
    "Centre for Human Drug Research, Leiden, the Netherlands.",
    "Erasmus Medical Centre, Rotterdam, the Netherlands."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40717537/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}