{
  "pmid": "40721287",
  "title": "Systematic review of the use of the Dermatology Life Quality Index in routine clinical practice: evidence from 287 articles across 56 countries.",
  "abstract": "Although quality of life instruments are widely used in research, it is challenging to find evidence of their use in routine clinical use. The most widely used measure for skin disease burden is the Dermatology Life Quality Index (DLQI), and its scores have validated clinical meaning.\nTo identify evidence of the use of the DLQI in routine clinical practice and explore the nature of its use.\nThe study followed PRISMA guidelines, and the protocol was registered with PROSPERO. MEDLINE (Ovid), Embase, Scopus and CINAHL (EBSCO) databases were systematically searched for articles describing studies using the DLQI in routine clinical practice. Studies were excluded if participants were aged < 16 years and if there were predetermined treatment interventions, as in a clinical trial. Information was extracted on publications' authors' opinions on the use of the DLQI in their routine practice.\nIn total, 2178 publications were screened and 287 articles met the inclusion criteria, reporting on 112 diseases and describing 66 434 patients from 56 countries, using the DLQI in at least 29 languages. Of the studies, 121 (42.2%) were reported as retrospective and 63 (22.0%) as observational. Fifty-two (18.1%) stated DLQI data were retrieved from patient records, 29 (10.1%) as 'real life', 39 (13.6%) reported 'real-world data' and 47 (16.4%) used consecutive patient recruitment. In total, 264 (92.0%) studies were conducted in a single country; 96 (33.4%) were multicentred studies, whereas 171 (59.6%) were conducted at a single site. There were 93 (32.4%) that were conducted in hospitals, 66 (23.0%) specified outpatient clinics, 38 (13.2%) tertiary care, 33 (11.5%) clinics, 4 (1.4%) in the community, 18 (6.3%) in other settings and 35 (12.2%) were unspecified. The most common diseases in the study settings were psoriasis (106 studies, 36.9%), atopic dermatitis (32, 11.1%), urticaria (24, 8.4%), hidradenitis suppurativa (22, 7.7%) and vitiligo (17, 5.9%). Thirty studies (10.5%) used Hongbo et al.'s (J Invest Dermatol 2005; 125:659-64) DLQI score banding.\nThe DLQI was widely used in routine care locations internationally, informing clinical decisions and monitoring of treatment. The DLQI was embedded into some clinics' continuing routine practice.",
  "pub_date": "2025-11-25",
  "publication_types": [
    "Journal Article",
    "Systematic Review"
  ],
  "affiliations": [
    "Centre for Medical Education, School of Medicine, Cardiff University, Cardiff, UK.",
    "Division of Infection and Immunity, School of Medicine, Cardiff University, Cardiff, UK.",
    "Colchester Hospital, East Suffolk and North Essex NHS Foundation Trust, Colchester, UK.",
    "Division of Infection and Immunity, School of Medicine, Cardiff University, Cardiff, UK.",
    "Division of Infection and Immunity, School of Medicine, Cardiff University, Cardiff, UK.",
    "School of Health, Medicine and Life Sciences, University of Hertfordshire, Hatfield, UK.",
    "Division of Infection and Immunity, School of Medicine, Cardiff University, Cardiff, UK."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40721287/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}