{
  "pmid": "40728772",
  "title": "Long-Term Safety and Efficacy of Risankizumab to Treat Moderate-to-Severe Plaque Psoriasis: Final LIMMitless Phase 3, Open-Label Extension Trial Results.",
  "abstract": "Psoriasis is a chronic, inflammatory disease requiring long-term therapy. Risankizumab, an anti-interleukin-23 monoclonal antibody, is approved to treat moderate-to-severe plaque psoriasis in adults.\nThe aim was to assess the long-term safety and efficacy of continuous risankizumab treatment through 6 years in adults with moderate-to-severe plaque psoriasis.\nLIMMitless, a phase 3, open-label extension study, evaluated the long-term safety and efficacy of risankizumab in patients with moderate-to-severe plaque psoriasis following multiple phase 2/3 base studies. Patients randomized to risankizumab 150 mg at baseline of the base studies (≤ 52 weeks) were eligible to enroll in the LIMMitless study, in which they received risankizumab 150 mg subcutaneously every 12 weeks for an additional 252 weeks. This final analysis assessed safety (treatment-emergent adverse events [TEAEs]) through 324 weeks and efficacy (including proportions of patients who achieved ≥ 90%/100% improvement from baseline in Psoriasis Area and Severity Index [PASI 90/PASI 100], static Physician's Global Assessment of clear or almost clear [sPGA 0/1], or Dermatology Life Quality Index of no effect on patient's quality of life [DLQI 0/1]) through 304 weeks.\nOf 897 patients enrolled in the LIMMitless study, 661 completed the study for a total of 4921.2 patient years of exposure to risankizumab. Rates of TEAEs, TEAEs leading to discontinuation, and TEAEs of safety interest were low and consistent with rates observed in previous studies. During the base studies, risankizumab treatment demonstrated high rates of rapid and durable efficacy through 52 weeks; risankizumab treatment also maintained or further improved efficacy and quality-of-life outcomes in the LIMMitless study. At week 304, 86.0% of patients achieved PASI 90, 54.2% achieved PASI 100, 84.7% achieved sPGA 0/1, and 76.3% achieved DLQI 0/1 (using modified nonresponder imputation).\nLong-term risankizumab was well tolerated and demonstrated high and durable efficacy through 6 years of continuous treatment.\nNCT03047395.",
  "pub_date": "2025-07-29",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Randomized Controlled Trial",
    "Multicenter Study"
  ],
  "affiliations": [
    "Alliance Clinical Trials and Probity Medical Research, Inc., 135 Union Street East, Waterloo, ON, N2J 1C4, Canada. kapapp@probitymedical.com.",
    "Division of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, ON, Canada. kapapp@probitymedical.com.",
    "Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "Hospital de la Santa Creu i Sant Pau, Barcelona, Spain.",
    "Jichi Medical University, Tochigi, Japan.",
    "Department of Dermatology, University Hospital Carl Gustav Carus, TU Dresden, Dresden, Germany.",
    "SKiN Centre for Dermatology, Probity Medical Research, Peterborough, ON, Canada.",
    "Department of Medicine, Queen's University, Kingston, ON, Canada.",
    "Department of Dermatology, Northwestern University Feinberg School of Medicine, Chicago, IL, USA.",
    "AbbVie Inc., North Chicago, IL, USA.",
    "AbbVie Inc., North Chicago, IL, USA.",
    "AbbVie Inc., North Chicago, IL, USA.",
    "AbbVie Inc., North Chicago, IL, USA.",
    "AbbVie Inc., North Chicago, IL, USA.",
    "AbbVie Inc., North Chicago, IL, USA.",
    "Blauvelt Consulting, LLC, Lake Oswego, OR, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40728772/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}