{
  "pmid": "40748696",
  "title": "Practical considerations for the use of IL-23p19 inhibitors in inflammatory bowel disease: how to choose between them and why it matters?",
  "abstract": "A wide range of advanced therapies has become available in recent years for the treatment of moderate-to-severe inflammatory bowel disease (IBD). Among these, monoclonal antibodies targeting the interleukin 23 p19 subunit (anti-IL23p19) have emerged as a promising therapeutic class. Pivotal Phase 3 trials have demonstrated their favorable clinical efficacy and safety in both Crohn's disease (CD) and ulcerative colitis (UC). Three such agents, Risankizumab, Mirikizumab, and Guselkumab, have now been approved in CD and UC. For gastroenterologists, the ability to rationally select among these options to personalize treatment and maximize patient benefit is critical. Key factors to consider when selecting an anti-IL23p19 agent include patient preference regarding mode of administration, IBD phenotype, presence of coexisting extra-intestinal manifestations, concomitant immune-mediated diseases, and previous advanced-therapy exposure. Our review summarizes the current clinical evidence on anti-IL23p19 therapies and provides practical guidance on their use in IBD clinical management, including dosing strategies, choice of dose in CD and UC, and clinical positioning across patients. Finally, anti-IL23p19 inhibition may represent a future first-line therapy option for moderate-to-severe IBD, particularly in patients with concomitant IL-23 driven comorbidities such as psoriasis. Its use in combination with other advanced therapies in selected patients is being explored to enhance therapeutic efficacy and improve long-term outcomes. Further real-world studies are needed to assess its effectiveness and benefits in complex disease phenotypes, including perianal fistulizing Crohn's disease.",
  "pub_date": "2025-09-07",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "APC Microbiome Ireland, College of Medicine and Health, University College Cork, Cork, Ireland.",
    "APC Microbiome Ireland, College of Medicine and Health, University College Cork, Cork, Ireland.",
    "APC Microbiome Ireland, College of Medicine and Health, University College Cork, Cork, Ireland.",
    "APC Microbiome Ireland, College of Medicine and Health, University College Cork, Cork, Ireland.",
    "APC Microbiome Ireland, College of Medicine and Health, University College Cork, Cork, Ireland."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40748696/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}