{
  "pmid": "40755064",
  "title": "Sun Protection Advice for the South African Population for the Prevention and Management of Skin Diseases.",
  "abstract": "Sun protection is critical for the prevention and management of skin cancer and other photosensitive dermatoses in South Africa's diverse population. This review expands on previously published sun protection advice for skin cancer prevention by providing tailored advice for individuals with specific dermatological conditions. Recent advances in sunscreen technology, including enhanced protection for long-wave UVA1, visible light, and infrared radiation; inorganic sunscreens with more cosmetic acceptability; and the addition of other active ingredients unrelated to sun protection, are discussed in the context of specific dermatoses. Visible light protection, particularly tinted sunscreens, is particularly relevant for dark to medium skin tones prone to pigmentary disorders, such as melasma and postinflammatory pigmentation. Practical advice is provided for optimizing sun protection in inflammatory conditions, such as acne, rosacea, eczema, and psoriasis, where formulation and tolerability are important for compliance. Photoprotection for photodermatoses and human immunodeficiency virus (HIV)-associated dermatoses is also discussed. Recognizing the economic barriers to sunscreen access, the paper emphasizes the critical role of sun avoidance behaviors, such as sun-protective clothing and seeking shade, in resource-limited settings.",
  "pub_date": "2025-08-04",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Division of Dermatology, Department of Medicine, University of Cape Town, Cape Town, South Africa.",
    "Private Practice, Pretoria, South Africa.",
    "Private Practice, Cape Town, South Africa.",
    "Division of Dermatology, Department of Medicine, Faculty of Medicine and Health Sciences, Stellenbosch University, Cape Town, South Africa.",
    "LOréal Dermatological Beauty, Johannesburg, South Africa.",
    "Dermatology Department, Nelson R. Mandela School of Medicine, University of KwaZulu-Natal, Durban, South Africa.",
    "Climate Change and Health Research Programme, Environment and Health Research Unit, South African Medical Research Council, Pretoria, South Africa.",
    "Department of Geography, Geoinformatics and Meteorology, University of Pretoria, Pretoria, South Africa.",
    "Division of Dermatology, Department of Medicine, Faculty of Medicine and Health Sciences, Stellenbosch University, Cape Town, South Africa."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40755064/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}