{
  "pmid": "40773600",
  "title": "Two-Year Treatment Persistence of Guselkumab vs Other Biologics in Plaque Psoriasis Patients.",
  "abstract": "The study objective was to compare long-term treatment persistence between patients initiating guselkumab vs 3 commonly prescribed biologics in the United States.\nAdult plaque psoriasis patients enrolled in the CorEvitas Psoriasis Registry initiating guselkumab, adalimumab, secukinumab, or ixekizumab (July 2017 - January 2022) were divided into biologic-na&iuml;ve and biologic-experienced cohorts. The primary outcome measure was average 2-year treatment persistence, estimated as restricted mean survival time (RMST), comparing guselkumab with adalimumab, secukinumab, and ixekizumab. Standardized mortality ratio weighting was used to adjust for confounding.\n1,007 biologic-na&iuml;ve and 1,584 biologic-experienced treatment initiations were included. For biologic-na&iuml;ve initiators, the weighted-average treatment persistence for guselkumab was 20.3 months (95% CI: 19.4, 21.3), 14.6 months (13.5, 15.7) for adalimumab; 17.5 months (16.5, 18.6) for secukinumab, and 18.9 months (17.8, 20.1) for ixekizumab. The RMST difference for guselkumab was 24.9 weeks (95% CI: 18.4, 31.3) vs adalimumab, 12.1 weeks (5.9, 18.2) vs secukinumab and 6.0 weeks (0.4, 12.4) vs ixekizumab. For biologic-experienced initiators, the weighted-average treatment persistence for guselkumab was 17.6 months (95% CI: 16.9, 18.4), 13.5 months (11.6, 15.5) for adalimumab, 16.5 months (15.7, 17.3) for secukinumab, and 16.9 months (16.1, 17.8) for ixekizumab. The RMST difference for guselkumab was 17.7 weeks (95% CI: 8.7, 26.7) vs adalimumab, 5.0 weeks (0.2, 9.1) vs secukinumab and 2.9 weeks (-1.9, 7.7) vs ixekizumab.\nIn both biologic-na&iuml;ve and biologic-experienced cohorts in this real-world study, average treatment persistence was significantly longer for guselkumab compared to adalimumab and secukinumab and numerically longer compared to ixekizumab.",
  "pub_date": "2025-08-01",
  "publication_types": [
    "Journal Article",
    "Comparative Study"
  ],
  "affiliations": [],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40773600/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}