{
  "pmid": "40784330",
  "title": "No Change in HbA1c Levels during Treatment with Biologics or Methotrexate in Patients with Psoriasis.",
  "abstract": "Biological treatment has been associated with changes in blood glucose levels in different populations of patients with immunological diseases, although studies report conflicting results. This study aimed to investigate changes in blood glucose levels during treatment with biologics and methotrexate as the control, through changes in hemoglobin A1c (HbA1c) levels.\nIn this study, the HbA1c levels at baseline and after 1 year of treatment were compared using Wilcoxon's signed-rank test. The following treatments were considered: TNF-α inhibitors (TNFi) (adalimumab and infliximab), IL-17 inhibitors (IL-17i) (brodalumab, ixekizumab, and secukinumab), IL-12/23 inhibitor (IL-12/23i) (ustekinumab), IL-23 inhibitors (IL-23i) (guselkumab and risankizumab), and methotrexate.\nIn total, 386 patients with psoriasis were included: adalimumab (n = 166), infliximab (n = 7), brodalumab (n = 19), ixekizumab (n = 35), secukinumab (n = 44), ustekinumab (n = 42), guselkumab (n = 11), risankizumab (n = 7), and methotrexate (n = 55). For all groups of biologics and methotrexate, no statistically or clinically significant changes in HbA1c levels were observed. In a sensitivity analysis including only patients in the upper quartile of baseline HbA1c (36-47 mmol/mol) treated with TNFi, IL-17i, or methotrexate, no significant change in HbA1c levels was observed after 1 year of treatment.\nIn a group of patients with psoriasis and normal baseline glucose levels, treatment with biologics or methotrexate for 1 year did not appear to affect blood glucose levels as measured by HbA1c. This could indicate that the treatments lack antidiabetic properties.",
  "pub_date": "2025-08-08",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark.",
    "Copenhagen Research Group for Inflammatory Skin, Herlev and Gentofte Hospital, Hellerup, Denmark.",
    "Department of Clinical Medicine, Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark.",
    "Department of Clinical Medicine, Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark, lone.skov.02@regionh.dk.",
    "Copenhagen Research Group for Inflammatory Skin, Herlev and Gentofte Hospital, Hellerup, Denmark, lone.skov.02@regionh.dk.",
    "Department of Clinical Medicine, Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark, lone.skov.02@regionh.dk."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40784330/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}