{
  "pmid": "40781906",
  "title": "Long-Term Impact of Guselkumab on Skin, Sexuality, and Perceived Stigmatization in Patients With Psoriasis in Routine Clinical Practice: Week 76 Effectiveness and Safety Results From the Prospective German Multicenter G-EPOSS Study.",
  "abstract": "G-EPOSS is a prospective, non-interventional, German multicenter study evaluating the effects of guselkumab, an interleukin-23 inhibitor, in patients with moderate-to-severe plaque psoriasis in real-world clinical practice.\nTo evaluate the effectiveness of guselkumab in psoriasis and its impact on quality of life (QoL), sexual impairment, and perceived stigmatization.\nAdult patients received guselkumab according to routine clinical practice. Primary endpoint (Psoriasis Area and Severity Index [PASI] ≤ 3 at week [W]28) data are published. Secondary endpoints over 76 weeks include PASI, Nail Psoriasis Severity Index (NAPSI), anogenital Physician's Global Assessment (aPGA), Dermatology Life Quality Index (DLQI), Relationship and Sexuality Scale (RSS), Perceived Stigmatization Questionnaire (PSQ), Patient Benefit Index (PBI), and drug survival assessments. Outcomes were evaluated in the overall population and subgroups defined by body mass index (BMI), age, disease duration, sex, anogenital psoriasis, depression, and super-response to guselkumab (PASI = 0 at W20 and W28).\nA total of 295 patients were included in these analyses. Baseline mean disease duration, PASI, and aPGA scores were 17.4 years, 15.3, and 2.7, respectively. In total, 26.4% of patients had received prior biologic therapy. At W76, 87.5% of patients achieved PASI ≤ 3, and 47.3% achieved PASI = 0; response rates were higher with shorter disease duration. Overall, 18.3% of patients were super-responders. Among patients with NAPSI ≥ 1 or aPGA ≥ 1 at baseline, NAPSI = 0 and aPGA = 0 were achieved by 52.2% and 75.8% of patients at W76, respectively. A high aPGA = 0 response rate was observed in all BMI subgroups. Improvements were observed through W76 across individual items of the DLQI, RSS, and PSQ and across all subgroups evaluated. A shorter disease duration was associated with additional benefit for some outcomes. At W76, PBI > 3 was documented for 88.1% of patients, and the probability of drug survival was 88.7%. No new safety signals were detected.\nGuselkumab treatment provided sustained improvements over 76 weeks in psoriasis, sexual impairment, QoL, and perceived stigmatization, irrespective of BMI, age, disease duration, sex, presence of anogenital psoriasis, or depression.",
  "pub_date": "2025-08-09",
  "publication_types": [
    "Journal Article",
    "Multicenter Study"
  ],
  "affiliations": [
    "Psoriasis Center Kiel, Department of Dermatology, University Medical Center Schleswig-Holstein, Campus Kiel, Kiel, Germany.",
    "Dermatologikum Hamburg, Hamburg, Germany.",
    "Dermatology Practice Dr. Med. Durdana Groß, Potsdam, Germany.",
    "ZENTderma, Mönchengladbach, Germany.",
    "Dermatology Practice Hautmedizin Saar, Merzig, Germany.",
    "MediCorium, Oberursel, Germany.",
    "Taut Science and Service GmbH, Konstanz, Germany.",
    "Janssen-Cilag GmbH, a Johnson & Johnson Company, Neuss, Germany.",
    "Janssen-Cilag GmbH, a Johnson & Johnson Company, Neuss, Germany.",
    "Janssen-Cilag GmbH, a Johnson & Johnson Company, Neuss, Germany.",
    "Janssen-Cilag GmbH, a Johnson & Johnson Company, Neuss, Germany.",
    "Dermatology Practice Dariusch Mortazawi, Remscheid, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40781906/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}