{
  "pmid": "40782277",
  "title": "Difficult-to-Manage Axial Spondyloarthritis According to ASAS Criteria in Reuma-Check Cohort: Frequency, Predictive Factors, and Treatment Patterns.",
  "abstract": "The concept of difficult-to-manage axial spondyloarthritis (D2M-axSpA), recently defined by ASAS, identifies patients with persistent active disease despite failure of ≥ 2 b/tsDMARDs with different mechanisms of action. Refractory axSpA (TR) represents a more severe subset with objective signs of inflammation.\nTo estimate the frequency of D2M in the Reuma-Check axSpA cohort, describe treatment trajectories, and identify baseline characteristics associated with D2M.\nThis prospective observational study (2017-2024) included axSpA patients ≥ 18 years old assessed via the structured Reuma-Check protocol. Baseline data included demographics, sacroiliac imaging (X-ray, MRI), ultrasound, CRP, and disease activity measures (BASDAI, ASDAS, BASFI). D2M was defined using ASAS criteria. Comparative and logistic regression analyses were performed to identify associated factors.\nAmong 129 axSpA patients, 11 (8.53%) met criteria for D2M. Only four fulfilled criteria for TR. Compared to non-D2M, these patients showed significantly higher BASFI (4.2 vs. 2.9), BASDAI (5.1 vs. 3.5), and ASDAS (3.7 vs. 2.8). Significant categorical predictors included smoking, psoriasis, sacroiliac joint tenderness, and peripheral structural damage. Articular ultrasound abnormalities were present in 75% of D2M patients and emerged as the only independent predictor (OR = 10.65; 95% CI: 1.42-80.09). Regarding treatment patterns, 50% of patients initiated b/tsDMARDs; 30% failed first-line therapy, and 57% of those failed second-line treatment. Third-line therapies included JAK inhibitors (54%), IL-17 inhibitors (27%), and TNFi (19%).\nD2M-axSpA was identified in approximately 9% of patients using ASAS criteria. A combination of clinical and imaging features-especially ultrasound-may assist in early identification and tailored management. Key Points • D2M-axSpA affects nearly 9% of patients in real-world clinical practice. • Clinical and structural predictors such as psoriasis and joint damage are associated with D2M. • Articular ultrasound is a key tool for identifying high-risk patients.",
  "pub_date": "2025-08-09",
  "publication_types": [
    "Journal Article",
    "Observational Study"
  ],
  "affiliations": [
    "Rheumatology Unit, Hospital Italiano de La Plata - Universidad Nacional de La Plata, La Plata, Argentina. gsalinasrodrigo@gmail.com.",
    "Rheumatology Unit, Hospital Italiano de La Plata - Universidad Nacional de La Plata, La Plata, Argentina.",
    "Rheumatology Unit, Hospital Italiano de La Plata - Universidad Nacional de La Plata, La Plata, Argentina.",
    "Rheumatology Unit, Hospital Italiano de La Plata - Universidad Nacional de La Plata, La Plata, Argentina.",
    "Rheumatology Unit, Hospital Italiano de La Plata - Universidad Nacional de La Plata, La Plata, Argentina.",
    "Rheumatology Unit, Hospital Italiano de La Plata - Universidad Nacional de La Plata, La Plata, Argentina."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40782277/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}