{
  "pmid": "40794374",
  "title": "A systematic review of the role of interleukin inhibitors in lichen planus: therapeutic and paradoxical effects.",
  "abstract": "Lichen planus (LP) is a group of chronic inflammatory disorders of the skin, mucous membranes, scalp, and nails that mainly affect the middle-aged population. Inflammatory modifiers, including interferon-α (IFN-α), IFN-γ, tumor necrosis factor-alpha (TNF-α), as well as various interleukins (ILs), such as IL-4, IL-5, IL-6, IL-8, IL-9, IL-10, IL-12, IL-17, IL-18, IL-21, IL-22, and IL-23 has also been suggested to contribute in the LP pathogenesis. We aim to systematically evaluate the effect of IL inhibitors on treating and triggering LP disease.\nA systematic search was conducted up to January 30th, 2025, in PubMed/Medline, Web of Science, and Ovid-Embase, and clinical studies with available English full-text were included.\nThe search recorded 196 relevant studies, with 42 articles eligible for this study. IL-inhibitors, including dupilumab, secukinumab, anakinra, tildrakizumab, guselkumab, ustekinumab, ixekizumab, risankizumab, and brodalumab were associated with clinical improvement in various types of LP. In contrast, in some cases with a coexistent autoimmune disease, such as psoriasis and atopic dermatitis, secukinumab, dupilumab, risankizumab, ustekinumab, and ixekizumab administration resulted in LP development.\nIL inhibitors demonstrate both treatment and paradoxical effects on LP. Further research is needed to elucidate the impact of these agents on the pathophysiology of LP.",
  "pub_date": "2025-08-12",
  "publication_types": [
    "Journal Article",
    "Systematic Review"
  ],
  "affiliations": [
    "Faculty of Medicine, Tehran Medical Sciences, Islamic Azad University, Tehran, Iran.",
    "School of Medicine, Tehran University of Medical Sciences, Tehran, Iran.",
    "School of Medicine, Iran University of Medical Sciences, Tehran, Iran.",
    "Department of Otolaryngology and Head and Neck Surgery, School of Medicine, Otorhinolaryngology Research Center, Guilan University of Medical Sciences, Rasht, Iran.",
    "School of Medicine, Zanjan University of Medical Sciences, Zanjan, Iran.",
    "School of Medicine, Iran University of Medical Sciences, Tehran, Iran.",
    "Rasool Akram Medical Complex Clinical Research Development Center (RCRDC), School of Medicine, Iran University of Medical Sciences, Tehran, Iran.",
    "School of Medicine, Iran University of Medical Sciences, Tehran, Iran. nazila.heidari@yahoo.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40794374/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}