{
  "pmid": "40824162",
  "title": "Adverse Events and Immune Response in Psoriasis Patients Receiving Interleukin-17 Inhibitors.",
  "abstract": "Interleukin-17 inhibitors are effective in psoriasis; however, they are associated with an increased risk of infections, particularly oral candidiasis, and new-onset/flares of inflammatory bowel disease. This study aimed to identify predictive markers for these adverse events and to describe the functional immune response in patients treated with interleukin-17 inhibitors using a whole-blood stimulation system (TruCulture®). Patients with psoriasis initiating an interleukin-17 inhibitor (n = 36) or adalimumab (n = 24) were enrolled. Patients attended visits at baseline, week 12, and week 52, during which skin and mucosal swabs, and faecal and blood samples were collected. Baseline oral Candida albicans colonization with no clinical symptoms was associated with an increased risk of oral candidiasis during the first year of interleukin-17 inhibitor therapy, with no cases of oral candidiasis observed in the adalimumab group. Gut inflammation, measured by faecal calprotectin, remained stable in both the adalimumab and interleukin-17 inhibitor group. Colonization with Staphylococcus aureus did not change during treatment. It was found that interleukin-17 inhibitors induced an anti-inflammatory state and potentially more active toll-like receptor 3-mediated antiviral responses compared with adalimumab. In conclusion, screening for oral Candida albicans colonization prior to initiation of interleukin-17 inhibitor therapy may be a useful strategy for risk stratification and early intervention.",
  "pub_date": "2025-08-18",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark; Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark. christopher.willy.schwarz.01@regionh.dk.",
    "1Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark; Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark; Department of Digestive Diseases, Copenhagen University Hospital - Rigshospitalet, Copenhagen, Denmark.",
    "Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark; Department of Infectious Diseases, Copenhagen University Hospital - Rigshospitalet, Copenhagen, Denmark.",
    "Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark; Department of Clinical Immunology, Copenhagen University Hospital - Rigshospitalet, Copenhagen, Denmark.",
    "Unit of Mycology, Statens Serum Institut, Copenhagen, Denmark.",
    "Department of Clinical Microbiology, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark.",
    "Department of Dermatology, Aarhus University Hospital, Aarhus, Denmark.",
    "Department of Dermatology, Aarhus University Hospital, Aarhus, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark.",
    "Department of Dermatology and Allergy, Copenhagen University Hospital - Herlev and Gentofte, Copenhagen, Denmark; Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40824162/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}