{
  "pmid": "40856381",
  "title": "Successful guselkumab treatment for a psoriasis patient experiencing an adrenal crisis: a case report.",
  "abstract": "Prolonged glucocorticoid therapy may lead to adrenal insufficiency (AI) or even adrenal crisis (AC) due to suppression of the hypothalamic-pituitary-adrenal (HPA) axis.\nThis case report describes a male patient with psoriasis who had received long-term irregular glucocorticoid therapy for psoriasis management. Following an upper respiratory tract infection, the patient developed generalized skin lesions accompanied by systemic symptoms including abdominal pain, vomiting, fatigue, fever, and lethargy. After multiple misdiagnoses, the patient was ultimately diagnosed with psoriasis complicated by AC.\nThe patient was subjected to guselkumab combined with glucocorticoid therapy for the treatment of psoriasis and AC. After 6 months, complete resolution of skin lesions was achieved, and adrenal function returned to normal.\nDermatologists should be aware of the potential for AI when prescribing glucocorticoids (topical or systemic) to treat psoriasis. Guselkumab represents a viable therapeutic option for psoriasis patients with concurrent AI/AC.",
  "pub_date": "2025-08-26",
  "publication_types": [
    "Journal Article",
    "Case Reports"
  ],
  "affiliations": [
    "Department of Dermatology, Hospital of Chengdu University of Traditional Chinese Medicine, Chengdu, People's Republic of China.",
    "Department of Dermatology, Hospital of Chengdu University of Traditional Chinese Medicine, Chengdu, People's Republic of China.",
    "Department of Dermatology, Hospital of Chengdu University of Traditional Chinese Medicine, Chengdu, People's Republic of China.",
    "Department of Dermatology, Hospital of Chengdu University of Traditional Chinese Medicine, Chengdu, People's Republic of China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40856381/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}