{
  "pmid": "40862624",
  "title": "Early Evidence of Safety, Clinical Benefit, and Pharmacokinetics of Roflumilast Cream 0.3% Once Daily for Treatment of Mild or Moderate Plaque Psoriasis in Children Aged 2-11 Years.",
  "abstract": "Two 4-week, phase 2, open-label, maximal usage pharmacokinetic (PK) and safety studies of once-daily roflumilast cream 0.3% (a potent phosphodiesterase 4 inhibitor) were conducted in children aged 2-5 years and 6-11 years with psoriasis. Evidence of systemic exposure to roflumilast and its active N-oxide metabolite was seen in most patients following daily application, consistent with previous studies. Under maximal use conditions, once-daily roflumilast cream 0.3% was well tolerated and improved signs and symptoms of psoriasis in children aged 2-11 years, consistent with phase 3 results in adults and adolescents. Trial Registration: Clinicaltrials.gov listing: 215: NCT04655313; 216: NCT04746911.",
  "pub_date": "2025-08-27",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase II",
    "Multicenter Study"
  ],
  "affiliations": [
    "UTHealth McGovern Medical School, Houston, Texas, USA.",
    "Children's Hospital of Orange County, Orange, California, USA.",
    "Cahaba Dermatology & Skin Health Center, Birmingham, Alabama, USA.",
    "Pediatric Skin Research, LLC, Miami, Florida, USA.",
    "Instituto Dermatologico, Santa Domingo, Dominican Republic.",
    "First OC Dermatology Research, Fountain Valley, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA.",
    "Arcutis Biotherapeutics Inc., Westlake Village, California, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40862624/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}