{
  "pmid": "40879928",
  "title": "Patient Experiences with Psoriatic Disease in the USA: Results from the Psoriasis and Beyond Global Study.",
  "abstract": "Psoriatic disease (PsD) is a chronic, multisystem, inflammatory disorder encompassing psoriasis, psoriatic arthritis (PsA), and their associated comorbidities.\nThe aim of this subanalysis of the global \"Psoriasis and Beyond\" study was to evaluate patients' experiences of living with PsD in the USA.\nThe study included a cross-sectional, quantitative, 25-min online survey of adults with self-reported, healthcare professional-diagnosed, moderate-to-severe psoriasis, with or without PsA. USA-based patients were recruited through online panels by the Institut de Publique Sondage D'Opinion Secteur and The National Psoriasis Foundation.\nThis analysis included 793 US patients with psoriasis; 43% also had PsA. Overall, 75% of patients knew that their disease was systemic, and 65% had heard the term \"psoriatic disease.\" Of patients without diagnosed PsA, 50% screened positive for PsA using the Psoriasis Epidemiology Screening Tool. Psoriasis negatively affected emotional well-being and quality of life (QoL) in the majority of patients (87% and 91%, respectively). Overall, 29% of patients reported that they could not work or study in the week prior to the survey; of these, 98% responded that psoriasis had a very or extremely large impact on their QoL. Mean diagnostic delays of 3.7 and 3.3 years for psoriasis and PsA, respectively, were reported.\nThis analysis of USA-based patients with PsD highlights the profound impact of PsD on emotional well-being and QoL and suggests potential underdiagnosis of PsA. There is a need to ensure early PsD diagnosis and to provide holistic treatment, including mental health support.",
  "pub_date": "2025-08-29",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, David Geffen School of Medicine at UCLA, 10833 Le Conte Ave, Los Angeles, CA, 90095, USA. aprilarmstrong@post.harvard.edu.",
    "International Federation of Psoriasis Associations, Stockholm, Sweden.",
    "The National Psoriasis Foundation, Washington, DC, USA.",
    "Novartis AG, Basel, Switzerland.",
    "Novartis AG, Basel, Switzerland.",
    "Rheumatology, Perelman School of Medicine, University of Pennsylvania, Philadelphia, PA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40879928/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}