{
  "pmid": "40886218",
  "title": "Bimekizumab Complete Clearance of Both Skin and Nail Psoriasis: Comparative Efficacy in Phase III/IIIb Studies.",
  "abstract": "Nail psoriasis can have a substantial negative impact on both the physical and emotional well-being of patients, and is a risk factor for psoriatic arthritis. Achieving complete clearance of nails in addition to skin is therefore an important treatment goal.\nWe aimed to evaluate concurrent complete skin and nail clearance in patients with moderate-to-severe plaque psoriasis treated with bimekizumab or active comparators.\nData were analyzed from the BE SURE and BE VIVID phase III trials, their open-label extension BE BRIGHT, and the BE RADIANT phase IIIb trial and its open-label extension. Included patients had baseline modified Nail Psoriasis Severity Index (mNAPSI) >0 and entered their respective open-label extension. Proportions of patients achieving complete skin (PASI 100; 100% improvement from baseline in Psoriasis Area and Severity Index) and nail (mNAPSI 0) clearance at the same time are reported for bimekizumab- and active comparator-treated patients during controlled trial periods, and in the long term for continuous bimekizumab-treated patients and those switching from comparators. Data are reported using modified non-responder imputation.\nAt the end of comparator-controlled periods, 45.8% of bimekizumab (N = 151) versus 18.3% of adalimumab (N = 91) patients (BE SURE week 24), 51.1% of bimekizumab (N = 169) versus 26.5% of ustekinumab (N = 92) patients (BE VIVID week 52), and 63.3% of bimekizumab (N = 182) versus 36.1% of secukinumab (N = 155) patients (BE RADIANT week 48) achieved PASI 100 and mNAPSI 0. Following long-term treatment, 57.7% of adalimumab switchers/49.1% of continuous bimekizumab patients (BE SURE/BE BRIGHT year 4), 52.2% of ustekinumab switchers/48.3% of continuous bimekizumab patients (BE VIVID/BE BRIGHT year 4), and 51.9% of secukinumab switchers/57.4% of continuous bimekizumab patients (BE RADIANT year 3) achieved PASI 100 and mNAPSI 0.\nNumerically higher proportions of bimekizumab-treated patients achieved concurrent complete skin and nail clearance versus adalimumab, ustekinumab, and secukinumab. Clearance rates increased following switch to bimekizumab, and were sustained long-term in both switchers to bimekizumab and continuous bimekizumab-treated patients. [Graphical abstract available.] CLINICAL TRIAL REGISTRATION: NCT03412747, NCT03370133, NCT03598790, NCT03536884.",
  "pub_date": "2025-08-31",
  "publication_types": [
    "Journal Article",
    "Comparative Study",
    "Clinical Trial, Phase III",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "Division of Rheumatology, Department of Dermatology and Department of Medicine, UT Southwestern Medical Center, Dallas, TX, USA.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust, Manchester, UK.",
    "Division of Musculoskeletal and Dermatological Sciences, Manchester Academic Health Science Centre, University of Manchester, Manchester, UK.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Department of Dermatology, Medical College of Wisconsin, Milwaukee, WI, USA.",
    "Nagoya City University West Medical Center, Nagoya, Japan.",
    "Department of Dermatology, Yale University, New Haven, CT, USA.",
    "Central Connecticut Dermatology Research, Cromwell, CT, USA.",
    "Department of Dermatology, University Hospital Lausanne, Lausanne, Switzerland.",
    "UCB, Morrisville, NC, USA.",
    "UCB, Madrid, Spain.",
    "UCB, Monheim am Rhein, Germany.",
    "Section of Dermatology and Venereology, Department of Medicine, University of Verona, Verona, Italy. paolo.gisondi@univr.it."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40886218/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}