{
  "pmid": "40888828",
  "title": "Ethnic Differences of Palmoplantar Pustulosis: A Systematic Review.",
  "abstract": "Ethnic differences in the clinical and molecular features of many immune-mediated dermatoses have been reported, including psoriasis vulgaris and generalized pustular psoriasis. Palmoplantar pustulosis (PPP) is a chronic and relapsing inflammatory skin disease manifesting as crops of sterile pustules over an erythematous base on the palms and soles. To date, ethnic differences in PPP have been rarely studied.\nTo compare the differences in epidemiology, genetic background, clinical manifestations, treatment patterns, and responses among patients with PPP across different ethnicities.\nA systematic review was performed in accordance with the 2020 PRISMA guidelines, including a search across four bibliographical databases, including articles published between the earliest available date until 1 February 2025. Articles were reviewed independently by two assessors. Any discrepancies were addressed and resolved through discussion. A narrative synthesis was performed owing to heterogeneity. The study protocol was registered in INPLASY (INPLASY202530108). No funding was received.\nOf 2250 studies screened, 101 studies were included. Among them, 46 studies (42 cohort studies, 1 case-control, and 3 case series) involving 216,257 patients described the clinical characteristics of PPP, with 13 and 14 cohort studies reporting on the epidemiological data and treatment type/response of PPP, respectively. Incidence and prevalence rates of PPP were higher among East Asians, especially in Japanese populations. While PPP is a female-predominant disease worldwide, more men are affected in Asia, likely owing to a lower prevalence of smoking among Asian females. Mutations in IL36RN, CARD14, and different HLA alleles contribute to the genetic landscape of PPP across ethnicities. PPP with preceding vesicles (type A) seemed more common in Asians, and type B (without preceding vesicles) is more common in non-Asians. Asians with PPP had less concurrent psoriasis vulgaris and psoriatic arthritis, as well as lower rates of smoking, obesity, celiac disease, and thyroid disease, while metal allergies were more common. Plantar-only or unilateral involvement were more frequent in non-Asians, whereas nail involvement and synovitis-acne-pustulosis-hyperostosis-osteitis (SAPHO) syndrome/pustulotic arthro-osteitis (PAO) were more common in Asians. Among conventional treatment modalities, acitretin, colchicine, and tonsillectomy seemed more effective for Asians. Biologics were less commonly used in Asia, with ethnic-related differences in treatment response noted across classes.\nThis systematic review illustrated notable differences in genetic profiles, clinical features, and therapeutic responses of PPP across ethnicities. Although limited by study size and heterogeneity, these findings could enhance our understanding of ethnic-specific PPP traits. Thus, incorporating ethnic differences is crucial for effective diagnosis, genetic testing, and tailored management strategies in patients with PPP.",
  "pub_date": "2025-09-01",
  "publication_types": [
    "Journal Article",
    "Systematic Review"
  ],
  "affiliations": [
    "Department of Dermatology, National Taiwan University Hospital, Taipei City, Taiwan.",
    "Department of Dermatology, National Taiwan University Hospital, Taipei City, Taiwan. tftsai@yahoo.com.",
    "Department of Dermatology, National Taiwan University College of Medicine, Taipei City, Taiwan. tftsai@yahoo.com.",
    "Department of Dermatology, Far Eastern Memorial Hospital, New Taipei, Taiwan. tftsai@yahoo.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40888828/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}