{
  "pmid": "40914172",
  "title": "Effect of a treatment strategy utilising golimumab, methotrexate and corticosteroids versus methotrexate and corticosteroids in early, untreated psoriatic arthritis (GOLMePsA): a single-centre, double-blind, parallel-group, randomised controlled trial.",
  "abstract": "The optimal treatment strategy in early psoriatic arthritis remains unknown. We aimed to assess whether the combination of methotrexate and golimumab plus corticosteroids is superior to methotrexate plus corticosteroids in reducing disease activity in early, untreated psoriatic arthritis.\nWe did a double-blind, randomised, placebo-controlled, parallel-group, single-centre study in adults with treatment-naïve active psoriatic arthritis. Participants were required to have been diagnosed up to 24 months before enrolment and had to be naïve to conventional synthetic, biologic, or targeted synthetic disease-modifying antirheumatic drugs or systemic treatments before enrolment. Participants were randomly assigned (1:1) to receive either combination therapy of golimumab and methotrexate or placebo and methotrexate, stratified by the number of involved peripheral joints at baseline. Investigators and participants were masked to treatment allocation. At baseline, all participants received methylprednisolone (120 mg intramuscular administration, single dose) and commenced weekly methotrexate (increased to 25 mg within 28 days). Golimumab or placebo were administered by subcutaneous injections every 4 weeks. By week 24, additional methylprednisolone was permitted once (totalling up to 240 mg exposure). The primary endpoint was the difference in mean Psoriatic Arthritis Disease Activity Score (PASDAS) at week 24 in the intention-to-treat population, compared using analysis of covariance via multiple linear regression. People with lived experience of psoriatic arthritis were involved in the design and conduct the study. The study was registered with EudraCT, 2013-004122-28, and is complete.\nBetween Nov 3, 2015 and Jan 26, 2022, 106 people were assessed for eligibility, 22 were excluded, and 84 were randomly assigned (43 to the golimumab and methotrexate group and 41 to the placebo and methotrexate group). 46 (55%) participants were male and 38 (45%) were female. The mean age was 42·5 years (SD 12·4) and 61 (73%) participants were White and seven (8%) were from any Asian, Black, or other ethnic background. PASDAS did not differ between treatment groups at week 24 (unadjusted mean 3·09 [SD 1·32] in the placebo and methotrexate group and 2·70 [1·38] in the golimumab and methotrexate group; adjusted difference -0·55 [95% CI -1·12 to 0·03]; p=0·064). More participants in the placebo and methotrexate group received additional corticosteroids before week 24 (20 [49%] of 41 vs nine [21%] of 43; odds ratio 0·28 [95% CI 0·11 to 0·72]; p=0·009). Similar numbers of participants had adverse events (38 [93%] of 41 in the placebo and methotrexate group vs 41 [95%] of 43 in the golimumab and methotrexate group; risk difference 0·03 [95% CI -0·09 to 0·15]), although altered laboratory investigations and infections occurred more frequently in the golimumab and methotrexate group. No deaths, serious, or unexpected adverse events occurred.\nBoth interventions led to improved disease activity in patients with early, untreated psoriatic arthritis, without a clinically or statistically significant difference in PASDAS between treatment groups at week 24. Participants in the placebo and methotrexate group required more rescue corticosteroids. Sustained results were observed at week 52 in both groups, without serious or unexpected adverse events.\nJanssen Biologics BV.",
  "pub_date": "2025-09-03",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK.",
    "Rheumatology Department, Airedale NHS Foundation Trust, Airedale General Hospital, Keighley, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK; Rheumatology Department, West Middlesex University Hospital, Chelsea and Westminster NHS Foundation Trust, London, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Rheumatology Unit, Digitalization for the Sustainability of the Healthcare System (DS3), Vall d'Hebron Hospital Universitari, Vall d'Hebron Barcelona Hospital Campus, Barcelona, Spain.",
    "Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences, University of Oxford, Oxford, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK.",
    "National Institute for Health and Care Research Leeds Biomedical Research Centre, Leeds Teaching Hospitals NHS Trust, Leeds, UK; Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK. Electronic address: h.marzo-ortega@leeds.ac.uk."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40914172/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}