{
  "pmid": "40918707",
  "title": "Evaluation of Short-to-medium Term Efficacy of Guselkumab and Secukinumab in Overweight and Obese Patients with Moderate to Severe Plaque Psoriasis: A 24-Week Single-center Retrospective Study.",
  "abstract": "Overweight and obesity are common in patients with psoriasis and are associated with increased disease severity and declined treatment response.\nTo evaluate the short-to-medium term (24w) efficacy and safety of two biologics, including Guselkumab and Secukinumab, in overweight and obese patients (body mass index [BMI] ≥25 kg/m2) with moderate to severe psoriasis.\nWe retrospectively analyzed the data of patients with moderate to severe plaque psoriasis treated with Guselkumab or Secukinumab in Dermatology Hospital of Southern Medical University in 2020. Totally 34 and 67 patients were treated with Guselkumab and Secukinumab, respectively; the patient groups with BMI ≥25 kg/m2 comprised 16 and 33 cases, respectively. Baseline demographics and clinical characteristics were recorded, and Psoriasis Area and Severity Index (PASI) scores, adverse events, and biochemical parameters were assessed at weeks 12, 16, and 24.\nBoth Guselkumab and Secukinumab demonstrated good clinical efficacy. In patients with BMI ≥25 kg/m2, there was a higher percentage of cases achieving PASI 100 at week 16 in the Secukinumab group; however, at week 24, the proportion of patients treated with Guselkumab achieving PASI 100 was significantly higher than that of cases treated with Secukinumab (P = 0.037 and P < 0.001, respectively).\nGuselkumab and Secukinumab demonstrated good short-to-medium-term efficacy in Chinese patients with moderate to severe plaque psoriasis. In patients with a BMI ≥25 kg/m2, Secukinumab demonstrated a faster onset of efficacy, while Guselkumab demonstrated significantly higher efficacy at week 24.",
  "pub_date": "2025-09-01",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "From the Department of Dermatology, Dermatology Hospital of Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, Shenzhen Center for Chronic Disease Control, Shenzhen, Guangdong, China.",
    "Department of Dermatology, Huizhou Dermatology Hospital, Huizhou, Guangdong, China.",
    "From the Department of Dermatology, Dermatology Hospital of Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, Dermatology Hospital of Fuzhou, Fuzhou, Fujian, China.",
    "From the Department of Dermatology, Dermatology Hospital of Southern Medical University, Guangzhou, China.",
    "From the Department of Dermatology, Dermatology Hospital of Southern Medical University, Guangzhou, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40918707/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}