{
  "pmid": "40917855",
  "title": "Overall hemostatic potential as a marker of subclinical hypercoagulability in treated psoriasis patients.",
  "abstract": "Psoriasis is associated with increased cardiovascular risk, possibly mediated by inflammation-induced hemostatic dysregulation and hypercoagulability. However, these changes are often difficult to detect with conventional markers.\nTo assess hypercoagulability in patients with psoriasis using the Overall Hemostatic Potential (OHP) test, a global integrative test for coagulation and fibrinolysis.\nWe studied 80 psoriasis patients (54 men, 26 women, aged 30-45 years) receiving effective topical or systemic treatments (methotrexate, adalimumab, secukinumab or guselkumab) and compared them with 20 healthy controls. We measured OHP, its components - overall coagulation potential (OCP) and overall fibrinolytic potential (OFP) and selected hemostatic markers (platelet count, mean platelet volume, platelet-to-lymphocyte ratio, P-selectin, D-dimer and fibrinogen).\nPsoriasis patients had significantly higher OHP levels, primarily due to decreased OFP, while OCP levels were comparable to the control group - indicating a hypercoagulable state due to impaired fibrinolysis. Other conventional hemostatic markers showed no significant differences. OHP and OFP correlated with residual inflammatory activity, BMI, waist circumference, visceral adiposity and fibrinogen levels, suggesting a relationship between subclinical inflammation, metabolic parameters and hemostatic imbalance.\nThe OHP test reveals a hypercoagulable state in psoriasis patients even in the absence of abnormal standard coagulation markers. OHP could be a practical and sensitive tool to stratify cardiovascular risk in psoriasis, especially in patients with concomitant metabolic disease or persistent inflammation.",
  "pub_date": "2025-08-21",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatovenerology, University Medical Centre Ljubljana, Ljubljana, Slovenia.",
    "Faculty of Medicine, University of Ljubljana, Ljubljana, Slovenia.",
    "Faculty of Agriculture and Life Sciences, University of Maribor, Hoče, Slovenia.",
    "Department of Vascular Diseases, Laboratory for Haemostasis and Atherothrombosis, University Medical Centre Ljubljana, Ljubljana, Slovenia.",
    "Faculty of Medicine, University of Ljubljana, Ljubljana, Slovenia.",
    "Clinical Department of Endocrinology, Diabetes and Metabolic Diseases, University Medical Centre Ljubljana, Ljubljana, Slovenia."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40917855/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}