{
  "pmid": "40926220",
  "title": "Beyond the screen: exploring digital health experiences of individuals affected by psoriasis - a qualitative interview study.",
  "abstract": "Psoriasis, a chronic inflammatory skin disorder, imposes a high burden on those affected, often leading to stigma and increased depression risk. With the increasing importance of digital media in medical contexts, there is a notable prevalence of misinformation and low-quality content. This study aims to explore the experiences of individuals affected by psoriasis regarding their disease-related digital media use.\nSemi-structured interviews with open-ended questions were conducted with psoriasis-affected people between August 2020 and January 2022 in Germany. The participants were recruited through digital media platforms, professional contacts, and in person at a university hospital department in southern Germany and were interviewed via video call. The recorded data was pseudonymized, transcribed verbatim, and analyzed using qualitative content analysis by Mayring which also allowed a quantitative evaluation of the category placements.\nEight participants (50% female) with a median age of 40.5 years (range: 25-80 years) were included. Four main categories emerged: (1) strengths and (2) difficulties of digital media in the context of psoriasis, (3) digital media in the context of the physician-patient relationship, and (4) suggestions for improvement. Commonly mentioned strengths were the positive impact on one's well-being and the access to alternative therapy options. Frequently named problems were qualitative shortcomings and commercial interests. Most participants reported that digital media was not addressed in the physician-patient communication. Nevertheless, instances where it was discussed revealed predominantly negative reactions from physicians. Participants desired an increased availability of online resources and enhanced cooperation between digital media platforms and physicians.\nThis study underscores the opportunities and challenges presented by digital media in managing psoriasis. Physicians should ensure that their patients access reliable platforms. Collaboration between physicians and affected individuals on digital media and adapting the traditional physician-patient relationship to an increasingly digitalized world are suggested to enhance patient care.",
  "pub_date": "2025-09-09",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology and Allergy, TUM School of Medicine and Health, Technical University of Munich, Biedersteiner Str. 29, 80802, Munich, Germany.",
    "Department of Dermatology and Allergy, TUM School of Medicine and Health, Technical University of Munich, Biedersteiner Str. 29, 80802, Munich, Germany.",
    "Department of Dermatology and Allergy, TUM School of Medicine and Health, Technical University of Munich, Biedersteiner Str. 29, 80802, Munich, Germany.",
    "Department of Dermatology and Allergy, TUM School of Medicine and Health, Technical University of Munich, Biedersteiner Str. 29, 80802, Munich, Germany. alexander.zink@tum.de.",
    "Division of Dermatology and Venerology, Department of Medicine Solna, Karolinska Institute, Stockholm, Sweden. alexander.zink@tum.de."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40926220/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}