{
  "pmid": "40923243",
  "title": "Guselkumab for Psoriasis in Patients With Active or Prior Malignancy: A Multicentre Retrospective Study.",
  "abstract": "Managing moderate-to-severe psoriasis in patients with current or past malignancy remains a therapeutic challenge. We conducted a multicentre, retrospective real-world study to assess the safety and effectiveness of guselkumab in this complex population. Thirty patients were included, of whom 11 had active cancer at the time of guselkumab initiation. After 52 weeks of follow-up, guselkumab achieved sustained clinical improvement in skin and joint symptoms, with no observed cases of cancer progression or recurrence. Two patients developed new malignancies during treatment, but guselkumab was not discontinued. These findings support the use of IL-23 inhibitors as a safe therapeutic option in this complex patient population.",
  "pub_date": "2025-07-15",
  "publication_types": [
    "Journal Article",
    "Multicenter Study"
  ],
  "affiliations": [
    "Department of Dermatology, Hospital Lluís Alcanyís, Xàtiva, Valencia, Spain.",
    "Department of Dermatology, Hospital Universitario Doctor Peset, Valencia, Spain.",
    "Department of Dermatology, Hospital Virgen de los Lirios, Alcoy, Alicante, Spain.",
    "Department of Dermatology, Hospital Universitario Doctor Peset, Valencia, Spain.",
    "Department of Dermatology, Hospital General Universitario de Alicante, Alicante, Spain.",
    "Department of Dermatology, Consorcio Hospital General Universitario, Valencia, Spain.",
    "Department of Dermatology, Hospital Vega Baja, Orihuela, Alicante, Spain.",
    "Department of Dermatology, Hospital Marina Baixa, Villajoyosa, Alicante, Spain.",
    "Department of Dermatology, Hospital de Manises, Manises, Valencia, Spain.",
    "Department of Dermatology, Hospital Arnau de Vilanova, Valencia, Spain.",
    "Department of Dermatology, Consorcio Hospital General Universitario, Valencia, Spain.",
    "Department of Dermatology, Hospital Universitario y Politécnico La Fe, Valencia, Spain.",
    "Department of Dermatology, Hospital de Manises, Manises, Valencia, Spain.",
    "Department of Dermatology, Consorcio Hospital General Universitario, Valencia, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40923243/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}