{
  "pmid": "40921728",
  "title": "Efficacy and safety of guselkumab in Chinese patients with moderate-to-severe plaque psoriasis: A randomized, double-blind, placebo-controlled trial.",
  "abstract": "Guselkumab is effective in treating moderate-to-severe plaque psoriasis; however, data from randomized controlled trials in the Chinese population are limited. This study evaluated and verified the efficacy and safety profile of guselkumab in Chinese patients with moderate-to-severe plaque psoriasis.\nThis was a randomized, double-blind, placebo-controlled, phase 4 study. Patients with moderate-to-severe plaque psoriasis were randomized 2:1 to the guselkumab group (guselkumab 100 mg by subcutaneous injection at weeks 0 and 4, then every 8 weeks thereafter through week 44) or the placebo-to-guselkumab group (placebo at weeks 0, 4, and 12, then guselkumab at weeks 16, 20, 28, 36, and 44). Coprimary efficacy endpoints were the proportion of patients achieving Psoriasis Area and Severity Index (PASI) 90 response and the proportion of patients achieving Investigator's Global Assessment (IGA) 0/1 response at week 16.\nAmong the 419 patients screened for eligibility between August 25, 2021, and July 21, 2022, 327 patients were enrolled. All 327 randomized patients (mean age, 41.5 [standard deviation, 12.7] years; 259 [79.2%] men) were treated and included in the analyses. At week 16, 103/110 patients assigned to the placebo group at baseline started guselkumab treatment. Most patients completed the study (210 in guselkumab group and 101 in placebo-to-guselkumab group). Significantly higher proportions of patients with guselkumab achieved PASI 90 (82.4% vs. 2.0%; P <0.001) and IGA score 0/1 (88.8% vs. 7.1%; P <0.001) compared with placebo at week 16. At week 48, response rates were maintained in the guselkumab group (PASI 90: 79.2%; IGA 0/1: 82.4%) and increased in the placebo-to-guselkumab group (PASI 90: 80.2%; IGA 0/1: 86.3%). During the first 16 weeks, the incidence of adverse events was comparable between groups (41.9% guselkumab vs. 39.1% placebo) and the incidence of serious adverse events was low (0.9% vs. 5.5%), respectively.\nGuselkumab was highly effective and displayed a favorable safety profile for the treatment of moderate-to-severe plaque psoriasis in Chinese patients.\nClinicalTrials.gov, NCT04914429.",
  "pub_date": "2025-09-08",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing 400016, China.",
    "Department of Dermatology, The Second Affiliated Hospital of Xi'an Jiaotong University School of Medicine, Xi'an, Shaanxi 710114, China.",
    "Department of Dermatology, Zhejiang Provincial People's Hospital, Hangzhou, Zhejiang 310011, China.",
    "Department of Dermatology, The Affiliated Hospital of Anhui Medical University School of Medicine, Hefei, Anhui 230022, China.",
    "Department of Dermatology, The First Affiliated Hospital of Fujian Medical University, Fuzhou, Fujian 350005, China.",
    "Dermatology Hospital of Southern Medical University (Guangdong Provincial Dermatology Hospital), Guangzhou, Guangdong 510665, China.",
    "Department of Dermatology, Jiangsu Provincial People's Hospital, Nanjing, Jiangsu 210029, China.",
    "Department of Dermatology, The Second Xiangya Hospital of Central South University, Changsha, Hunan 410013, China.",
    "Department of Dermatology, The Third Hospital of Peking University, Beijing 100191, China.",
    "Shandong Dermatological Hospital, Jinan, Shandong 250022, China.",
    "Hospital for Skin Diseases, Chinese Academy of Medical Sciences, Nanjing, Jiangsu 210042, China.",
    "Department of Dermatology, Ruijin Hospital of Shanghai Jiaotong University School of Medicine, Shanghai 200025, China.",
    "Department of Dermatology, Tianjin Medical University General Hospital, Tianjin 300050, China.",
    "Shanghai Skin Disease Hospital, Shanghai 200040, China.",
    "Department of Dermatology, First Affiliated Hospital of Wenzhou Medical University, Wenzhou, Zhejiang 325000, China.",
    "Department of Dermatology, West China Hospital, Sichuan University, Chengdu, Sichuan 610041, China.",
    "Department of Dermatology, Tianjin Academy of Traditional Chinese Medicine Affiliated Hospital, Tianjin 300120, China.",
    "Department of Dermatology, Union Hospital, Tongji Medical College of Huazhong University of Science & Technology, Wuhan, Hubei 430030, China.",
    "Department of Dermatology, Henan Provincial People's Hospital, Zhengzhou, Henan 450003, China.",
    "Department of Dermatology, Beijing Tongren Hospital, Capital Medical University, Beijing 100730, China.",
    "Department of Dermatology, Sir Run Run Shaw Hospital, Zhejiang University School of Medicine, Hangzhou, Zhejiang 310016, China.",
    "Department of Dermatology, Huashan Hospital, Fudan University, Shanghai 200040, China.",
    "Department of Dermatology, Xiangya Hospital, Central South University, Changsha, Hunan 410008, China.",
    "Department of Dermatology, The University of Hong Kong-Shenzhen Hospital, Shenzhen, Guangdong 518053, China.",
    "Department of Dermatology, The First Hospital Affiliated to AMU (Southwest Hospital), Chongqing 400038, China.",
    "Johnson & Johnson, Beijing 100000, China.",
    "Johnson & Johnson, Beijing 100000, China.",
    "Johnson & Johnson, Shanghai 200233, China.",
    "Johnson & Johnson, Shanghai 200233, China.",
    "Johnson & Johnson, Shanghai 200233, China.",
    "Johnson & Johnson, Shanghai 200233, China.",
    "Johnson & Johnson, Shanghai 200233, China.",
    "Johnson & Johnson, Shanghai 200233, China.",
    "Department of Dermatology, Second Affiliated Hospital, Zhejiang University School of Medicine, Hangzhou, Zhejiang 310006, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40921728/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}