{
  "pmid": "40934132",
  "title": "Dimethyl Fumarate Treatment for Psoriasis in Real-World Clinical Practice: An Analysis from the Swiss Registry.",
  "abstract": "Limited data are available on the effectiveness and safety of dimethyl fumarate (DMF) for the treatment of moderate-to-severe psoriasis in real-world clinical practice. The objectives were to assess the effectiveness and safety of DMF in patients with moderate-to-severe plaque psoriasis in Switzerland.\nData from 28 adults enrolled in the Swiss Dermatology Network for Targeted Therapies registry who started DMF treatment as first line or subsequence therapy at registry entry and had ≥3 months of follow-up were analysed. No missing imputation was performed.\nThe median Psoriasis Area and Severity Index (PASI) decreased from 9.3 to 2.0 (p = 0.0136) and 2.3 (p = 0.0156) after 6 and 12 months of DMF treatment, respectively. At month 6, 61.5%/61.5%/15.4% of patients achieved a PASI <5/<3/<1 and at month 12, 75.0%/50.0%/37.5%. The proportions of patients achieving a PASI 75/90/100 response were 62.5%/25.0%/12.5% at month 12. At 12 months, median body surface area affected decreased from 10.3% to 1.5% (p < 0.01). The most common adverse events were abdominal pain (50.0%) and flushing (35.7%), which occurred in the first 3 months.\nIn a real-world setting, DMF significantly improves the severity and extent of disease in patients with moderate-to-severe psoriasis for up to 1 year with a safety profile consistent with previously published data on fumarates.",
  "pub_date": "2025-09-11",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, University Hospital Basel, Basel, Switzerland.",
    "Department of Dermatology, University Hospital Zurich, Zurich, Switzerland.",
    "Faculty of Medicine, University of Zurich, Zurich, Switzerland.",
    "Department of Dermatology, University Hospital Zurich, Zurich, Switzerland.",
    "Department of Dermatology, University Hospital Basel, Basel, Switzerland.",
    "Department of Dermatology, University Hospital Zurich, Zurich, Switzerland.",
    "Department of Dermatology, University Hospital Basel, Basel, Switzerland.",
    "Department of Dermatology, University Hospital Basel, Basel, Switzerland.",
    "Swiss4ward, Alicante, Spain.",
    "Department of Dermatology and Allergy, TUM School of Medicine and Health, Technical University of Munich, Munich, Germany.",
    "Swiss4ward, Alicante, Spain.",
    "Almirall AG, Wallisellen, Switzerland.",
    "TFS HealthScience, Barcelona, Spain.",
    "Department of Dermatology, University Hospital Basel, Basel, Switzerland.",
    "Department of Dermatology, University Hospital Zurich, Zurich, Switzerland.",
    "Faculty of Medicine, University of Zurich, Zurich, Switzerland.",
    "Department of Dermatology, University Hospital Zurich, Zurich, Switzerland, julia-tatjana.maul@usz.ch.",
    "Faculty of Medicine, University of Zurich, Zurich, Switzerland, julia-tatjana.maul@usz.ch."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40934132/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}