{
  "pmid": "40948988",
  "title": "Real-world analysis of IL-23 inhibitors in patients with moderate-to-severe psoriasis and early musculoskeletal symptoms.",
  "abstract": "Psoriasis is a chronic inflammatory condition that may develop into psoriatic arthritis (PsA) in a significant number of patients. Clinical signs such as enthesitis and nail involvement have been suggested as early indicators of this progression. IL-23 inhibitors have demonstrated effectiveness in psoriasis and, more recently, in PsA. This article aims to evaluate the effect of IL-23 inhibitors on clinical outcomes and progression of PsA in patients with moderate-to-severe psoriasis and early musculoskeletal involvement.\nThis was a retrospective, multicentre observational study conducted in Italy. Data were collected from 207 adult patients who had already started treatment with guselkumab, risankizumab or tildrakizumab prior to inclusion. All clinical data, including baseline characteristics and follow-up outcomes, were retrieved retrospectively from medical records across eight dermatology centres.\nEnthesitis was observed in 44.8% of patients with joint involvement. Guselkumab was the most commonly used treatment (57%) and demonstrated sustained improvements in Psoriasis Area and Severity Index, Visual Analogue Scale pain and Dermatology Life Quality Index scores. Importantly, no patients with enthesitis treated with guselkumab progressed to overt PsA. At 52 weeks, the average Psoriasis Area and Severity Index score was 0.61, Visual Analogue Scale pain score was 0.59 and Dermatology Life Quality Index score was 0.91.\nIL-23 inhibitors have proven effective in managing both skin and joint symptoms in patients with psoriasis at risk for PsA. Whilst the findings suggest that IL-23 inhibitors may help control early musculoskeletal symptoms in patients with psoriasis at risk of PsA, the absence of systematic rheumatological evaluation and the retrospective design preclude definitive conclusions about their disease-modifying potential. These results suggest a potential disease-modifying role that warrants further prospective validation.",
  "pub_date": "2025-09-08",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Dermatology Unit, Department of Clinical Internal, Anesthesiological and Cardiovascular Science, University of La Sapienza, Rome, Italy.",
    "Dermatological Unit \"Daniele Innocenzi\" ASL Latina - Sapienza University of Rome - Polo Pontino, Rome, Italy.",
    "Dermatology Unit, Department Medical Sciences and Public Health, University of Cagliari, Cagliari, Italy.",
    "Dermatology Unit, Department Medical Sciences and Public Health, University of Cagliari, Cagliari, Italy.",
    "Istituto Dermatologico San Gallicano-IRCCS, Rome, Italy.",
    "Department of Dermatology, Santa Maria Hospital, Terni, Italy.",
    "Department of Neurosciences, Mental Health and Sensory Organs, University of La Sapienza, Rome, Italy.",
    "Istituto Dermatologico San Gallicano-IRCCS, Rome, Italy.",
    "AOU delle Marche/ UNIVPM, Ancona, Italy.",
    "Department of Dermatology, IDI IRCCS, Rome, Italy.",
    "Dermatology Unit, Department Medical Sciences and Public Health, University of Cagliari, Cagliari, Italy.",
    "AOU delle Marche/ UNIVPM, Ancona, Italy.",
    "Department of Dermatology, IDI IRCCS, Rome, Italy.",
    "Department of Dermatology, IDI IRCCS, Rome, Italy.",
    "Clinica Dermatologica /Dipartimento di Medicina e Chirurgia, Az. Osp. S.Maria, Università di Perugia, Perugia, Italy.",
    "Department of Neurosciences, Mental Health and Sensory Organs, University of La Sapienza, Rome, Italy.",
    "Dermatology Unit, Department of Clinical Internal, Anesthesiological and Cardiovascular Science, University of La Sapienza, Rome, Italy.",
    "Dermatological Unit \"Daniele Innocenzi\" ASL Latina - Sapienza University of Rome - Polo Pontino, Rome, Italy.",
    "Department of Dermatology, IDI IRCCS, Rome, Italy.",
    "Dermatology Unit, Department of Clinical Internal, Anesthesiological and Cardiovascular Science, University of La Sapienza, Rome, Italy.",
    "Dermatological Unit \"Daniele Innocenzi\" ASL Latina - Sapienza University of Rome - Polo Pontino, Rome, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40948988/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}