{
  "pmid": "40969757",
  "title": "Mesenchymal stromal cells as rescue therapy in biologic-refractory psoriasis: insights from a case series.",
  "abstract": "Cytokine-targeted biologics have revolutionized the management of moderate-to-severe psoriasis; however, all available therapies have failed a growing number of patients. Mesenchymal stromal cells (MSCs), with their immunomodulatory properties, offer a novel therapeutic option. Here, we report the cases of three adult female patients with long-standing, severe plaque psoriasis who were refractory to multiple biologic therapies, and were consequently treated with two intravenous infusions of allogeneic umbilical cord-derived MSCs (UC-MSCs; 1.96 - 3.00 × 106 cells/kg) 1 week (W) apart. Two patients received UC-MSCs as monotherapy; one received them alongside etanercept. Upon relapse, two patients resumed their last failed biologic at W9, while one switched to a new biologic at W24. UC-MSCs were well-tolerated and yielded variable clinical benefits. The best responder to MSCs experienced an 87% reduction in the Psoriasis Area and Severity Index (PASI 87) by W4. Two patients showed improved responses to previously failed biologics (absolute PASI of 0-2), sustained for over 2 years following reinitiation. Multi-parameter flow cytometry revealed increased frequencies of CD4+ and CD8+ skin-homing (CLA+CD103 - ) and skin-recirculating (CLA+CD103+) memory T cells, CD25HiCD127LoFoxP3+ regulatory T cells, and non-classical (CD14LoCD16+) monocytes, associated with clinical improvements. These findings suggest that UC-MSCs may potentially provide direct benefits for biologic-refractory psoriasis and restore responsiveness to previously ineffective biologics, possibly by resetting the immune response. Further investigation in larger cohorts is warranted.",
  "pub_date": "2025-09-03",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust, London, United Kingdom.",
    "St John's Institute of Dermatology, School of Basic and Medical Biosciences, King's College London, London, United Kingdom.",
    "St John's Institute of Dermatology, School of Basic and Medical Biosciences, King's College London, London, United Kingdom.",
    "College of Health, Medicine and Life Sciences, Department of Life Science, Biosciences, Brunel University London, London, United Kingdom.",
    "Peter Gorer Department of Immunobiology, School of Immunology and Microbial Sciences, King's College London, London, United Kingdom.",
    "School of Cardiovascular and Metabolic Medicine & Sciences, King's College London, London, United Kingdom.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust, London, United Kingdom.",
    "Division of Dermatology, Tel Aviv Sourasky Medical Center, Tel Aviv, Israel.",
    "St John's Institute of Dermatology, School of Basic and Medical Biosciences, King's College London, London, United Kingdom.",
    "Department of Dermatology, King's College Hospital, London, United Kingdom.",
    "Department of Dermatology, King's College Hospital, London, United Kingdom.",
    "St John's Institute of Dermatology, School of Basic and Medical Biosciences, King's College London, London, United Kingdom.",
    "King's Health Partners Centre for Translational Medicine, London, United Kingdom.",
    "Department of Dermatology, King's College Hospital, London, United Kingdom.",
    "St John's Institute of Dermatology, School of Basic and Medical Biosciences, King's College London, London, United Kingdom.",
    "Peter Gorer Department of Immunobiology, School of Immunology and Microbial Sciences, King's College London, London, United Kingdom.",
    "School of Cardiovascular and Metabolic Medicine & Sciences, King's College London, London, United Kingdom.",
    "St John's Institute of Dermatology, School of Basic and Medical Biosciences, King's College London, London, United Kingdom.",
    "King's Health Partners Centre for Translational Medicine, London, United Kingdom.",
    "St John's Institute of Dermatology, School of Basic and Medical Biosciences, King's College London, London, United Kingdom.",
    "Department of Dermatology, King's College Hospital, London, United Kingdom."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40969757/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}