{
  "pmid": "40965095",
  "title": "Current Understanding of Seborrheic Dermatitis: Presentation, Diagnosis, and Special Populations.",
  "abstract": "Seborrheic dermatitis is a chronic inflammatory skin condition characterized by erythematous patches and plaques with white-to-yellow greasy scale often localized to the scalp and face. Its presentation varies between children and adults, as well as across different skin tones. Notably, in patients with more richly pigmented skin, postinflammatory pigment alteration can also be a feature of seborrheic dermatitis, highlighting the importance of considering skin colour differences in the diagnosis. Clinical manifestations of seborrheic dermatitis can overlap with several other dermatoses, including atopic dermatitis, psoriasis, and rosacea, thereby necessitating careful evaluation for accurate diagnosis. The pathophysiology of seborrheic dermatitis involves a complex interplay between dermatological, neurological, immunological, and microbiome-related factors. The multifaceted nature of seborrheic dermatitis underscores the need for a comprehensive approach to its diagnosis, considering age, skin colour, cultural practices, and comorbidities. This is the second in a series of 3 reviews, each addressing different aspects of seborrheic dermatitis, including its epidemiology, diagnosis, and treatment considerations.",
  "pub_date": "2025-09-18",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "Brunswick Dermatology Centre, Fredericton, NS, Canada.",
    "Department of Medicine, Dalhousie University, Halifax, NS, Canada.",
    "Enverus Medical Research, University of British Columbia and Probity Medical Research, Surrey, BC, Canada.",
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "Dermatology on Bloor, Toronto, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Clinique de Dermatologie Protoderma, Pierrefonds Medical Center, Pierrefonds, QC, Canada.",
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "DermEffects, London, ON, Canada.",
    "Western University, London, ON, Canada.",
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Lynde Institute for Dermatology, Markham, ON, Canada.",
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "Division of Dermatology, Department of Medicine, University of Calgary, Calgary, AB, Canada.",
    "Sections of Community Pediatrics and Pediatric Rheumatology, Department of Pediatrics, University of Calgary, Calgary, AB, Canada.",
    "Dermatology Research Institute, Calgary, AB, Canada.",
    "Skin Health & Wellness Centre, Calgary, AB, Canada.",
    "Division of Dermatology, Department of Medicine, Dalhousie University, Halifax, NS, Canada.",
    "CHU de Quebec, L'Ancienne-Lorette, QC, Canada.",
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "Section of Dermatology, Department of Medicine, University of Manitoba, Winnipeg, MB, Canada.",
    "SKiNWISE Dermatology, Winnipeg, MB, Canada.",
    "deRMA Skin Institute, Burlington, OC, Canada.",
    "Medcan, Oakville, OC, Canada.",
    "Division of Dermatology, Department of Medicine, McMaster University, Hamilton, ON, Canada.",
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "FACET Dermatology, Toronto, ON, Canada.",
    "Division of Dermatology, Women's College Hospital, Toronto, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Women's College Research Institute, Women's College Hospital, Toronto, ON, Canada.",
    "Sunnybrook Health Sciences Centre, Toronto, ON, Canada.",
    "Probity Medical Research, Inc, Waterloo, ON, Canada.",
    "SKiN Centre for Dermatology and Probity Medical Research, Peterborough, ON, Canada.",
    "Department of Medicine, Queen's University, Kingston, ON, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40965095/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}