{
  "pmid": "40967307",
  "title": "Novel TYK2 inhibitor D-2570 in moderate-to-severe plaque psoriasis: A randomized, double-blind, placebo-controlled, phase 2 trial.",
  "abstract": "D-2570, a TYK2 inhibitor, is currently being developed for autoimmune diseases including psoriasis and ulcerative colitis.\nTo evaluate the efficacy and safety of D-2570 in patients with moderate-to-severe plaque psoriasis.\nIn the randomized, double-blind, phase 2 study (NCT06278350), patients were randomized 1:1:1:1 to receive D-2570 at 18/27/36 mg, or placebo once daily for 12 weeks. The primary endpoint was the proportion of patients achieving psoriasis area severity index (PASI) 75 at week 12. Secondary endpoints included PASI 75/90/100 and static Physician Global Assessment (sPGA) score of 0/1, safety, and pharmacokinetic/pharmacodynamic characteristics.\nAt week 12, significantly higher response rates for PASI 75 (85.0% to 90.0%, vs 12.5%, P < .001 for all), PASI 90 (70.7% to 77.5% vs 5.0%, P < .001), PASI 100 (39.0% to 50.0% vs 2.5%, P < .005) and sPGA 0/1 (80.5% to 87.5% vs 20.0%, P < .001) were achieved in patients receiving D-2570 at 18/27/36 mg versus placebo. D-2570 was well tolerated, and most treatment-emergent adverse events were mild/moderate. D-2570 exhibited favorable pharmacokinetic properties and effectively suppressed IL-17A levels in patients.\nSmall sample size, relatively short duration of treatment and follow-up.\nD-2570 demonstrated a high efficacy with favorable safety profile in patients with moderate-to-severe plaque psoriasis.",
  "pub_date": "2025-09-16",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase II",
    "Multicenter Study"
  ],
  "affiliations": [
    "Department of Dermatology, Peking University People's Hospital, Beijing, China. Electronic address: rmzjz@126.com.",
    "Department of Dermatology, Peking University People's Hospital, Beijing, China.",
    "Department of Dermatology, Affiliated Hospital of Hebei University of Engineering, Handan, China.",
    "Department of Dermatology, Henan Provincial People's Hospital, Zhengzhou, China.",
    "Department of Dermatology, Affiliated Hospital of Chengde Medical University, Chengde, China.",
    "Department of Dermatology, Hangzhou First People's Hospital, Hangzhou, China.",
    "Department of Dermatology, The First Hospital of Hebei Medical University, Shijiazhuang, China.",
    "Department of Dermatology, Shandong Provincial Hospital, Jinan, China.",
    "Department of Dermatology, Shanghai Skin Disease Hospital, Shanghai, China.",
    "Department of Dermatology, The First Affiliated Hospital of Bengbu Medical University, Bengbu, China.",
    "Department of Dermatology, Beijing Tongren Hospital Affiliated to Capital Medical University, Beijing, China.",
    "Department of Dermatology, Dermatology Hospital of Southern Medical University, Guangzhou, China.",
    "Department of Dermatology, Beijing Friendship Hospital, Capital Medical University, Beijing, China.",
    "Department of Dermatology, First Hospital of Jilin University, Changchun, China.",
    "Department of Dermatology, Wuxi Second People's Hospital, Wuxi, China.",
    "Department of Dermatology, Shenzhen People's Hospital, Shenzhen, China.",
    "Department of Dermatology, RenMin Hospital of Wuhan University, Wuhan, China.",
    "Department of Dermatology, The Affiliated Hospital of Guilin Medical University, Guilin, China.",
    "Department of Dermatology, Sichuan Provincial People's Hospital, Chengdu, China.",
    "Department of Dermatology, Shiyan Renmin Hospital, Shiyan, China.",
    "Department of Dermatology, Nanyang First People's Hospital, Nanyang, China.",
    "Department of Dermatology, Jiujiang University Affiliated Hospital, Jiujiang, China.",
    "Department of Dermatology, Sun Yat-sen Memorial Hospital, Sun Yat-sen University, Guangzhou, China.",
    "Department of Dermatology, Peking University Third Hospital, Beijing, China.",
    "Department of Dermatology, The First People's Hospital of Chenzhou, Chenzhou, China.",
    "R&D, InventisBio Co., Ltd, Shanghai, China.",
    "R&D, InventisBio Co., Ltd, Shanghai, China.",
    "R&D, InventisBio Co., Ltd, Shanghai, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40967307/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}