{
  "pmid": "40964774",
  "title": "Effectiveness of Brodalumab for Guselkumab-Resistant Pustulotic Arthro-Osteitis in Patients With Palmoplantar Pustulosis: Case Series.",
  "abstract": "Pustulotic arthro-osteitis (PAO) is a sterile osteoarticular inflammation associated with palmoplantar pustulosis (PPP) that affects the anterior chest wall, spine, and peripheral joints. Guselkumab, an anti-interleukin (IL)-23p19 antibody, has shown to be effective for PPP and PAO and has been widely used for these conditions in Japan. Brodalumab, an anti-IL-17 receptor A antibody, has demonstrated efficacy against PPP. However, its usefulness in PAO is not well understood. Herein, we report three patients with guselkumab-resistant PAO who were successfully treated with brodalumab. In these three cases, switching from guselkumab to brodalumab resulted in improved disease activity scores, such as the modified Bath Ankylosing Spondylitis Disease Activity Index, modified Ankylosing Spondylitis Disease Activity Score, and pain numerical rating scale. In addition, imaging findings, such as bone marrow edema on magnetic resonance imaging, improved in two cases. As a result, the doses of inflammatory analgesics and/or antirheumatic drugs were reduced in two patients. Notably, clinical responses were observed as early as 2 weeks after switching in one case. The remission of PPP lesions achieved by guselkumab was maintained during brodalumab treatment, and no adverse events were observed in any of the three cases. Our observations suggest that brodalumab may be an effective therapeutic option for patients with PAO who have intractable osteoarticular symptoms despite treatment with IL-23 inhibitors.",
  "pub_date": "2025-09-18",
  "publication_types": [
    "Journal Article",
    "Case Reports"
  ],
  "affiliations": [
    "Division of Cutaneous Science, Department of Dermatology, Nihon University School of Medicine, Tokyo, Japan.",
    "Division of Cutaneous Science, Department of Dermatology, Nihon University School of Medicine, Tokyo, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40964774/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}