{
  "pmid": "40969796",
  "title": "Patient involvement in treatment decisions is associated with increased therapy satisfaction in Hidradenitis suppurativa.",
  "abstract": "Hidradenitis suppurativa (HS) is a painful and disfiguring chronic inflammatory skin disease. Despite many efforts over the past decade to improve the care of patients with HS, their satisfaction with medical care remains limited.\nThe aim of this study was to assess the perceived involvement of patients with HS and, for comparison, patients with psoriasis, in treatment decision-making and to identify areas associated with positive perception.\nA prospective, cross-sectional, questionnaire-based survey was conducted between May 2023 and July 2024 in different types of dermatological care facilities in Germany. Patients rated their therapy decision involvement and treatment satisfaction on a 0-10 scale. Data were stratified by demographic, clinical, and healthcare-related variables.\n124 HS patients and 133 psoriasis patients completed the questionnaires. The percentage of HS patients rating their therapy decision involvement as low (values of 0-5) was 27.2%, while the percentage of psoriasis patients who gave the same assessment was 11.9% (P < 0.01). Moreover, the average degree of perceived therapy decision involvement was significantly lower for patients with HS compared to psoriasis patients (mean ± SD: 7.0 ± 2.9 vs. 8.4 ± 2.1; P < 0.001). Greater involvement in therapy decisions was linked to higher satisfaction of patients with the therapies received (P < 0.01). Younger HS patients (18-40 years) reported lower involvement scores (P < 0.01), while gender, education level, disease duration, disease severity, number of comorbidities, type of healthcare facility, and type of therapies undergone had no influence. Extended consultation times with the dermatologist (≥20 min; P < 0.05) and more than one quarterly visit to the dermatologist (P < 0.01) were marginally associated with greater patient involvement in decision-making, but did not explain the difference between patients with HS and psoriasis in this regard. Waiting time until first visit to a dermatologist (negative association, P < 0.01) and, more strongly, satisfaction with information provided by the dermatologist about patient's skin disease (positive association, P < 0.001) were associated with patient involvement in therapy decision and were significantly different in patients with HS vs. psoriasis.\nThis study shows limited involvement of HS patients in the therapy decision-making process, which was associated with low treatment satisfaction. Improvement may be achieved by training dermatologists in disease mechanisms and patient communication.",
  "pub_date": "2025-09-03",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Charité-Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Berlin, Germany.",
    "Dermatology Practice Dr. Friedrich/Dr. Philipp, Oranienburg, Germany.",
    "Department of Dermatology and Phlebology, Vivantes Klinikum im Friedrichshain, Berlin, Germany.",
    "Charité-Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Berlin, Germany.",
    "Centre for Dermatosurgery, Havelklinik, Berlin, Germany.",
    "Charité-Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Berlin, Germany.",
    "Centre of Skin Diseases, University Hospital Bonn, Bonn, Germany.",
    "Centre of Skin Diseases, University Hospital Bonn, Bonn, Germany.",
    "Department of Dermatology, Venereology, and Allergology, University Medical Center, Göttingen, Germany.",
    "Department of Dermatology, Venereology, and Allergology, University Medical Center, Göttingen, Germany.",
    "International Centre for Hidradenitis Suppurativa/Acne Inversa (ICH), Department of Dermatology, Venereology and Allergology, Ruhr-University Bochum, Bochum, Germany.",
    "International Centre for Hidradenitis Suppurativa/Acne Inversa (ICH), Department of Dermatology, Venereology and Allergology, Ruhr-University Bochum, Bochum, Germany.",
    "Department of Dermatology and Phlebology, Vivantes Klinikum im Friedrichshain, Berlin, Germany.",
    "Department of Dermatology and Phlebology, Vivantes Klinikum im Friedrichshain, Berlin, Germany.",
    "Department of Dermatology, Klinikum Frankfurt (Oder), Frankfurt an der Oder, Germany.",
    "Dermatology Practice Siddi & Bachmann, Berlin, Germany.",
    "Medizinisches Versorgungszentrum/Medical Care Center (MVZ) Lobetal, Bernau bei Berlin, Germany.",
    "Dermatology Practice Dr. Gross, Potsdam, Germany.",
    "Dermatology Practice Dr. Friedrich/Dr. Philipp, Oranienburg, Germany.",
    "Department of Dermatology, Bundeswehr Hospital, Berlin, Germany.",
    "Dermatology Potsdam Medizinisches Versorgungszentrum/Medical Care Center (MVZ), Potsdam, Germany.",
    "Charité-Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Berlin, Germany.",
    "Charité-Universitätsmedizin Berlin, corporate member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Berlin, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40969796/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}