{
  "pmid": "40965103",
  "title": "Current Understanding of Seborrheic Dermatitis: Epidemiology, Burden of Disease, and Pathophysiology.",
  "abstract": "Seborrheic dermatitis is a common chronic dermatosis predominantly affecting sebum-rich areas. The diagnosis of seborrheic dermatitis can be challenging due to its clinical resemblance to other dermatoses. Seborrheic dermatitis can significantly impact quality of life, particularly in those with pruritus and dyspigmentation involving the facial region. The pathogenesis of seborrheic dermatitis is complex, and while its etiology is not yet fully understood, current evidence points to a complex interplay between 3 key factors: skin microbiome dysbiosis involving Malassezia spp. overgrowth and alterations in bacterial composition, dysregulated inflammatory responses in the skin, and skin barrier dysfunction. This review provides an updated overview of seborrheic dermatitis epidemiology, burden of disease, and pathophysiology, highlighting the integral roles of microbiome, inflammation, and skin barrier dysfunction in its pathogenesis. This is the first in a series of 3 reviews, each addressing different aspects of seborrheic dermatitis, including its epidemiology, diagnosis, and treatment considerations.",
  "pub_date": "2025-09-18",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Brunswick Dermatology Centre, Fredericton, NB, Canada.",
    "Department of Medicine, Dalhousie University, Halifax, NS, Canada.",
    "Enverus Medical Research, University of British Columbia and Probity Medical Research, Surrey, BC, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Dermatology on Bloor, Toronto, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Clinique de Dermatologie Protoderma, Pierrefonds Medical Center, Pierrefonds, QC, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "DermEffects, London, ON, Canada.",
    "Western University, London, ON, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Lynde Institute for Dermatology, Markham, ON, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Division of Dermatology, Department of Medicine, University of Calgary, Calgary, AB, Canada.",
    "Sections of Community Pediatrics and Pediatric Rheumatology, Department of Pediatrics, University of Calgary, Calgary, AB, Canada.",
    "Dermatology Research Institute, Calgary, AB, Canada.",
    "Skin Health & Wellness Centre, Calgary, AB, Canada.",
    "Division of Dermatology, Department of Medicine, Dalhousie University, Halifax, NS, Canada.",
    "CHU de Quebec, L'Ancienne-Lorette, QC, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Section of Dermatology, Department of Medicine, University of Manitoba, Winnipeg, MB, Canada.",
    "SKiNWISE Dermatology, Winnipeg, MB, Canada.",
    "deRMA Skin Institute, Burlington, ON, Canada.",
    "Medcan, Oakville, ON, Canada.",
    "Division of Dermatology, Department of Medicine, McMaster University, Hamilton, Ontario, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "FACET Dermatology, Toronto, ON, Canada.",
    "Division of Dermatology, Women's College Hospital, Toronto, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Division of Dermatology, Department of Medicine, McMaster University, Hamilton, Ontario, Canada.",
    "Women's College Research Institute, Women's College Hospital, Toronto, ON, Canada.",
    "Sunnybrook Health Sciences Centre, Toronto, ON, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "SKiN Centre for Dermatology and Probity Medical Research, Peterborough, ON, Canada.",
    "Department of Medicine, Queen's University, Kingston, ON, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40965103/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}