{
  "pmid": "40965088",
  "title": "Current Understanding of Seborrheic Dermatitis: Treatment Options.",
  "abstract": "Seborrheic dermatitis is a common chronic inflammatory skin condition that primarily affects areas with a high density of sebaceous glands, such as the scalp, face, central anterior trunk, and body folds. While the exact pathophysiology of seborrheic dermatitis is not fully understood, it is believed to involve a combination of microbial dysbiosis, immune imbalance, and skin barrier dysfunction. Effective management of seborrheic dermatitis includes treatments that reduce Malassezia yeast colonization, control inflammation, normalize skin barrier dysfunction, and regulate sebum production. Topical therapies, including antifungals and anti-inflammatory agents such as corticosteroids and calcineurin inhibitors, are the mainstay of treatment of mild-to-moderate seborrheic dermatitis. Systemic therapies are reserved for severe or resistant seborrheic dermatitis cases. The recent development of new treatments, such as the topical phosphodiesterase-4 inhibitor (roflumilast 0.3% foam), shows promise in providing effective, noncorticosteroid options for seborrheic dermatitis management. This review provides an overview of current, as well as emerging therapeutic options, and discusses the importance of personalized treatment strategies in managing seborrheic dermatitis. This is the third in a series of 3 reviews, each addressing different aspects of seborrheic dermatitis, including its epidemiology, diagnosis, and treatment considerations.",
  "pub_date": "2025-09-18",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Brunswick Dermatology Centre, Fredericton, NB, Canada.",
    "Department of Medicine, Dalhousie University, Halifax, NS, Canada.",
    "Enverus Medical Research, University of British Columbia and Probity Medical Research, Surrey, BC, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Dermatology on Bloor, Toronto, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Clinique de Dermatologie Protoderma, Pierrefonds Medical Center, Montreal, QC, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "DermEffects, London, ON, Canada.",
    "Western University, London, ON, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Lynde Institute for Dermatology, Markham, ON, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Division of Dermatology, Department of Medicine, University of Calgary, Calgary, AB, Canada.",
    "Sections of Community Pediatrics and Pediatric Rheumatology, Department of Pediatrics, University of Calgary, Calgary, AB, Canada.",
    "Dermatology Research Institute, Calgary, AB, Canada.",
    "Skin Health & Wellness Centre, Calgary, AB, Canada.",
    "Division of Dermatology, Department of Medicine, Dalhousie University, Halifax, NS, Canada.",
    "CHU de Quebec, L'Ancienne-Lorette, QC, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Section of Dermatology, Department of Medicine, University of Manitoba, Winnipeg, MB, Canada.",
    "SKiNWISE Dermatology, Winnipeg, MB, Canada.",
    "deRMA Skin Institute, Burlington, ON, Canada.",
    "Medcan, Oakville, ON, Canada.",
    "Division of Dermatology, Department of Medicine, McMaster University, Hamilton, ON, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "FACET Dermatology, Toronto, ON, Canada.",
    "Division of Dermatology, Women's College Hospital, Toronto, ON, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Women's College Research Institute, Women's College Hospital, Toronto, ON, Canada.",
    "Sunnybrook Health Sciences Centre, Toronto, ON, Canada.",
    "Probity Medical Research Inc., Waterloo, ON, Canada.",
    "SKiN Centre for Dermatology and Probity Medical Research, Peterborough, ON, Canada.",
    "Department of Medicine, Queen's University, Kingston, ON, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40965088/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}