{
  "pmid": "40962616",
  "title": "Inhibition of structural damage progression with the selective interleukin-23 inhibitor guselkumab in participants with active PsA: results through week 24 of the phase 3b, randomised, double-blind, placebo-controlled APEX study.",
  "abstract": "The APEX study evaluated the effects of guselkumab, a fully human, dual-acting monoclonal antibody able to bind CD64 and selectively inhibit the interleukin (IL)-23p19 subunit, on clinical and radiographic outcomes in active psoriatic arthritis (PsA).\nAPEX (ongoing, phase 3b, double-blind, placebo-controlled) randomised (5:7:7) biologic-naïve adults with active PsA (≥3 tender, ≥3 swollen joints; C-reactive protein ≥0.3 mg/dL; ≥2 erosive joints) to subcutaneous guselkumab 100 mg every 4 weeks (Q4W); guselkumab 100 mg at week 0, week 4, then every 8 weeks (Q8W); or placebo every 4 weeks. Primary (proportion of participants achieving ≥20% improvement in American College of Rheumatology response criteria [ACR20]) and major secondary (total PsA-modified van der Heijde-Sharp [vdH-S] score least squares mean [LSM] change from baseline) endpoints at week 24 were multiplicity-controlled for comparing each guselkumab group versus placebo.\nAmong 1020 participants (Q4W: 273; Q8W: 371; placebo: 376), significantly greater proportions of participants receiving guselkumab Q4W (66.6%) and Q8W (68.3%) versus placebo (47.0%) achieved ACR20 at week 24 (both P < 0.001). Baseline mean total vdH-S scores were 26.7 to 27.7 across groups; guselkumab Q4W- and Q8W-treated participants exhibited significantly lower rates of radiographic progression versus placebo at week 24 (total vdH-S score LSM change: 0.55 and 0.54 vs 1.35; P = 0.002 and P < 0.001, respectively). Through week 24, 38.2%, 42.5%, and 37.3% of participants receiving guselkumab Q4W, Q8W, and placebo, respectively, had ≥1 adverse event, with no new safety signals.\nGuselkumab, a fully human monoclonal antibody able to bind CD64 and simultaneously inhibit the IL-23p19 subunit, provided significantly higher rates of clinical improvement and significant inhibition of structural damage progression versus placebo, with no new safety signals, at week 24 in biologic-naïve participants with active and erosive PsA.",
  "pub_date": "2025-09-17",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial",
    "Clinical Trial, Phase III",
    "Multicenter Study"
  ],
  "affiliations": [
    "Rheumatology Research, Providence Swedish Medical Center, Seattle, WA, USA; University of Washington School of Medicine, Seattle, WA, USA. Electronic address: pmease@philipmease.com.",
    "Department of Medicine, Allergy/Immunology and Rheumatology, University of Rochester Medical Center, Rochester, NY, USA.",
    "Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences, University of Oxford, Botnar Research Centre, Oxford, UK.",
    "Johnson & Johnson, San Diego, CA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Cambridge, MA, USA.",
    "Johnson & Johnson, Toronto, ON, Canada.",
    "Johnson & Johnson, Horsham, PA, USA; Drexel University College of Medicine, Philadelphia, PA, USA.",
    "Craig L Dobbin Genetics Research Centre, Faculty of Medicine, Division of Rheumatology, Memorial University of Newfoundland, St. Johns, NL, Canada.",
    "Leiden University Medical Center, Leiden, The Netherlands."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40962616/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}