{
  "pmid": "40976249",
  "title": "Once-daily oral icotrokinra versus placebo and once-daily oral deucravacitinib in participants with moderate-to-severe plaque psoriasis (ICONIC-ADVANCE 1 & 2): two phase 3, randomised, placebo-controlled and active-comparator-controlled trials.",
  "abstract": "Monoclonal antibodies targeting interleukin-23 and interleukin-12 are efficacious in treating plaque psoriasis but must be delivered via intravenous or subcutaneous injection. Here, we aimed to evaluate the efficacy and safety of icotrokinra (JNJ-77242113), a targeted oral peptide that selectively binds the interleukin-23 receptor, compared with both placebo and deucravacitinib in adults with moderate-to-severe plaque psoriasis.\nThe phase 3, randomised, double-blind, placebo-controlled and active-comparator-controlled ICONIC-ADVANCE 1 and ICONIC-ADVANCE 2 trials, which are being done at 149 sites across 13 countries and 114 sites across 11 countries, respectively, randomly assigned (2:1:2 and 4:1:4, respectively) adults with moderate-to-severe plaque psoriasis diagnosed for at least 26 weeks (body-surface-area involvement ≤10%, Psoriasis Area and Severity Index [PASI] ≤12, and Investigator's Global Assessment [IGA] ≤3) to once-daily oral icotrokinra 200 mg, placebo, or deucravacitinib 6 mg; participants randomly assigned to placebo or deucravacitinib transitioned to icotrokinra at week 16 or week 24, respectively. Coprimary endpoints were proportions of participants achieving IGA 0 or 1 (clear or almost clear skin) with at least a two-grade improvement and at least 90% improvement in PASI (PASI 90) at week 16 with icotrokinra versus placebo. These studies are registered with ClinicalTrials.gov, NCT06143878 (ADVANCE 1) and NCT06220604 (ADVANCE 2), and are ongoing.\nICONIC-ADVANCE 1 enrolled participants from Jan 17, 2024, to May 24, 2024, and ICONIC-ADVANCE 2 enrolled participants from March 9, 2024, to June 13, 2024. Participants (ADVANCE 1: 774 of 988 patients screened; ADVANCE 2: 731 of 917 patients screened) were randomly assigned to icotrokinra (n=311 and 322), placebo (n=156 and 82), or deucravacitinib (n=307 and 327). All coprimary endpoints were met in both trials. Higher proportions of icotrokinra-treated versus placebo-treated participants achieved IGA 0 or 1 (ADVANCE 1: 213 [68%] of 311 vs 17 [11%] of 156, treatment difference 95% CI 58% [50-64]; ADVANCE 2: 227 [70%] of 322 vs seven [9%] of 82, 62% [53-69]; both p<0·0001) and PASI 90 (ADVANCE 1: 171 [55%] of 311 vs six [4%] of 156, treatment difference 95% CI 51% [44-57]; ADVANCE 2: 184 [57%] of 322 vs one [1%] of 82, 56% [48-62]; both p<0·0001) at week 16. Across studies, adverse event rates to week 16 were 303 (48%) of 632 and 136 (57%) of 237 with icotrokinra and placebo, respectively; the most common adverse events were nasopharyngitis (37 [6%] of 632 and 13 [5%] of 237) and upper respiratory tract infection (23 [4%] of 632 and eight [3%] of 237). To week 24, adverse event rates were lower than with icotrokinra (359 [57%] of 632) than deucravacitinib (411 [65%] of 634).\nIcotrokinra showed superior clinical response rates versus placebo and deucravacitinib in phase 3 moderate-to-severe plaque psoriasis trials, with similar adverse event rates to placebo. These findings suggest the potential of once-daily oral icotrokinra to provide robust efficacy and a favourable safety profile.\nJohnson & Johnson.",
  "pub_date": "2025-09-18",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase III",
    "Randomized Controlled Trial",
    "Multicenter Study"
  ],
  "affiliations": [
    "Henry Ford Health System, West Bloomfield, MI, USA. Electronic address: lstein1@hfhs.org.",
    "Department of Dermatology, University of California Los Angeles, Los Angeles, CA, USA.",
    "Innovaderm Research, Montreal, QC, Canada.",
    "University Hospital Muenster, Muenster, Germany.",
    "McMaster University, Hamilton, ON, Canada; Dermatrials Research, Hamilton, ON, Canada.",
    "Dermatologie Mahlow, Mahlow, Germany.",
    "Hospital Italiano de Buenos Aires, Buenos Aires, Argentina.",
    "Fachklinik Bad Bentheim, Bad Bentheim, Germany.",
    "Department of Dermatology, University of São Paulo, São Paulo, Brazil.",
    "Wallace Skin & Body Institute, Los Angeles, CA, USA; Wallace Skin Research Center, Los Angeles, CA, USA.",
    "Berlin, Germany.",
    "Dermatology Department, Hospital-Clinic de Barcelona, Universitat de Barcelona, Barcelona, Spain.",
    "Center for Inflammatory Skin Diseases, University Medical Center Schleswig-Holstein Campus Kiel, Kiel, Germany.",
    "Miami Dermatology & Laser Research Institute, Miami, FL, USA.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain; Facultad de Medicina, Universidad Francisco de Vitoria, Ctra, Pozuelo de Alarcón, Spain.",
    "Langenau, Germany.",
    "Department of Dermatology, Teikyo University School of Medicine, Tokyo, Japan.",
    "York Dermatology Clinic & Research Center and University of Toronto, Richmond Hill, Toronto, ON, Canada.",
    "Oregon Medical Research Center, Portland, OR, USA.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Leiden, Netherlands.",
    "Johnson & Johnson, Cambridge, MA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Johnson & Johnson, Spring House, PA, USA.",
    "Alliance Clinical Trials and Probity Medical Research, Waterloo, ON, Canada; Division of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, ON, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40976249/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}