{
  "pmid": "40980152",
  "title": "Long-Term Real-World Effectiveness and Drug Survival of Guselkumab in Patients with Psoriasis: A 5-Year Retrospective Study.",
  "abstract": "Clinical trials have demonstrated the efficacy of guselkumab in psoriasis, however, limited data are available from real-life studies evaluating the long-term effectiveness and drug survival (DS) of guselkumab.\nThis multicenter study assessed the 5-year efficacy, DS, and predictors of treatment response in a large cohort of patients with psoriasis.\nIn this retrospective, longitudinal study, we analyzed data from 1024 patients with moderate-to-severe psoriasis treated with guselkumab between 2019 and 2024. PASI scores were evaluated at baseline, 6 months, and 1-5 years. DS (ie, duration of continuous treatment with guselkumab without discontinuation) was assessed using Kaplan-Meier analysis, and logistic regression analysis was used to identify predictors of PASI response.\nMean PASI decreased from 14.3±8.8 at baseline to 1.3±2.4 at 6 months, with sustained improvement from 12-60 months (PASI values ranging from 1.0±2.2 to 1.3±3.5). Bioexperienced (ie having previous biological treatment) patients and obese individuals had lower PASI response. Subgroup analyses revealed significantly lower PASI response rates in obese patients, those previously treated with biologics, and those switched from anti-IL-17 agents (p<0.05).Multivariate logistic regression analysis revealed that previous biologic exposure and obesity remained significant negative predictors of achieving PASI 75, PASI 90, and PASI 100 across different time points. Cardiovascular disease emerged as a negative predictor for PASI 90 at 3 months (OR 0.64, 95% CI: 0.42-0.97, p=0.035). The probability of remaining on treatment at 12, 24, 36, 48, and 60 months were 95.85%, 91.73%, 89.74%, 87.08%, and 85.76% respectively. Female sex, ≥3 prior biologics, longer disease duration, and previous anti-IL-17 therapy increased the risk of treatment discontinuation. No significant differences in drug discontinuation were noted between patients with or without comorbidities.\nThis real-world study demonstrates the sustained long-term efficacy and DS of guselkumab in patients with psoriasis. Prior biologic exposure, obesity, and patient history are important factors to consider when initiating treatment for long-term management.",
  "pub_date": "2025-09-16",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Systems Medicine, University of Rome \"Tor Vergata\", Rome, Italy.",
    "Department of Precision and Regenerative Medicine and Ionian Area, Unit of Dermatology, University of Bari Aldo Moro, Bari, Italy.",
    "Dermatology Unit, Fondazione Policlinico \"Tor Vergata\", Rome, Italy.",
    "Department of Systems Medicine, University of Rome \"Tor Vergata\", Rome, Italy.",
    "Department of Clinical Medicine and Surgery, Section of Dermatology, University of Naples Federico II, Naples, Italy.",
    "Department of Medicine Surgery and Dentistry, \"Scuola Medica Salernitana\", University of Salerno, Salerno, Italy.",
    "Department of Translational Medicine and Surgery, Section of Dermatology, Catholic University of the Sacred Heart, Rome, Italy.",
    "Department of Medical and Surgical Sciences, Dermatology Unit, Fondazione Policlinico Universitario A. Gemelli - IRCCS, Rome, Italy.",
    "Dermatology Unit \"Daniele Innocenzi\", Department of Medico-Surgical Sciences and Biotechnologies, Sapienza University of Rome, Latina, Italy.",
    "Dermatology Unit, University of Campania Luigi Vanvitelli, Naples, Italy.",
    "Department of Clinical and Molecular Sciences - Dermatological Clinic, Università Politecnica Delle Marche, Ancona, Italy.",
    "Department of Biotechnological and Applied Clinical Sciences, University of L'Aquila, L'Aquila, Italy.",
    "Department of Clinical Dermatology, San Gallicano Dermatological Institute, IRCCS, Rome, Italy.",
    "Department of Clinical Dermatology, San Gallicano Dermatological Institute, IRCCS, Rome, Italy.",
    "Department of Clinical Medicine and Surgery, Section of Dermatology, University of Naples Federico II, Naples, Italy.",
    "Department of Medicine Surgery and Dentistry, \"Scuola Medica Salernitana\", University of Salerno, Salerno, Italy.",
    "Department of Precision and Regenerative Medicine and Ionian Area, Unit of Dermatology, University of Bari Aldo Moro, Bari, Italy.",
    "Department of Translational Medicine and Surgery, Section of Dermatology, Catholic University of the Sacred Heart, Rome, Italy.",
    "Department of Medical and Surgical Sciences, Dermatology Unit, Fondazione Policlinico Universitario A. Gemelli - IRCCS, Rome, Italy.",
    "Dermatology Unit \"Daniele Innocenzi\", Department of Medico-Surgical Sciences and Biotechnologies, Sapienza University of Rome, Latina, Italy.",
    "Dermatology Unit, University of Campania Luigi Vanvitelli, Naples, Italy.",
    "Dermatology Unit, Istituto Nazionale di Riposo e Cura per Anziani, INRCA-IRCCS Hospital, Ancona, Italy.",
    "San Gallicano Dermatological Institute, IRCCS, Rome, Italy.",
    "Department of Clinical Medicine and Surgery, Section of Dermatology, University of Naples Federico II, Naples, Italy.",
    "Department of Precision and Regenerative Medicine and Ionian Area, Unit of Dermatology, University of Bari Aldo Moro, Bari, Italy.",
    "Department of Translational Medicine and Surgery, Section of Dermatology, Catholic University of the Sacred Heart, Rome, Italy.",
    "Department of Medical and Surgical Sciences, Dermatology Unit, Fondazione Policlinico Universitario A. Gemelli - IRCCS, Rome, Italy.",
    "Department of Systems Medicine, University of Rome \"Tor Vergata\", Rome, Italy.",
    "Dermatology Unit, Fondazione Policlinico \"Tor Vergata\", Rome, Italy.",
    "Department of Systems Medicine, University of Rome \"Tor Vergata\", Rome, Italy.",
    "Dermatology Unit, Fondazione Policlinico \"Tor Vergata\", Rome, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40980152/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}