{
  "pmid": "40995108",
  "title": "Guselkumab In A Subset Of Multifailure Patients With Hidradenitis Suppurativa: Real-Word Evidence from Federico II.",
  "abstract": "Hidradenitis suppurativa (HS) is a chronic, debilitating inflammatory skin disorder characterized by painful nodules and abscesses, leading to substantial impairment in quality of life. Treatment remains challenging, particularly for patients with prior treatment failure or contraindications to anti-TNFα and anti-IL-17 therapies.\nThis prospective, real-life study assessed the efficacy and safety of guselkumab, an anti-IL-23 monoclonal antibody, in 10 adult patients with moderate-to-severe HS who had previously failed or were contraindicated for anti-TNFα and/or anti-IL-17 therapy. Guselkumab was administered using the psoriasis-approved dosing regimen. Patients were evaluated at baseline (week 0), week 16, week 32 and week 48 using the International Hidradenitis Suppurativa Severity Score System (IHS4), Dermatology Life Quality Index (DLQI), and visual analog scale (VAS) for pain. The primary endpoint was achievement of Hidradenitis Suppurativa Clinical Response (HiSCR) at week 16.\nAt week 16, 40% of patients achieved HiSCR, increasing to 50% by week 48. Mean IHS4 scores decreased from 14.3 at baseline to 9.3 at week 16. This was accompanied by an average 10-point reduction in DLQI and a 4-point reduction in VAS pain scores. Despite these improvements, overall quality of life remained moderately impaired. One patient discontinued guselkumab due to loss of efficacy.\nThe results support previous findings from smaller studies and case reports, indicating that guselkumab may offer clinical benefit in select HS populations, particularly those with comorbid psoriasis or Crohn's disease. Although limited by a small sample size, this study contributes to the growing real-world evidence supporting guselkumab as a potential treatment option in multi-refractory HS. Larger, placebo-controlled trials are needed to further define its role in treatment algorithms.",
  "pub_date": "2025-09-19",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40995108/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}