{
  "pmid": "40991259",
  "title": "Mediterranean Diet and Patients With Psoriasis: The MEDIPSO Randomized Clinical Trial.",
  "abstract": "Despite growing interest on the role of diet in the prevention and treatment of psoriasis, randomized clinical trials are lacking. The Mediterranean diet is known for its anti-inflammatory and cardiometabolic benefits, which may be relevant to psoriasis pathophysiology.\nTo assess whether a 16-week Mediterranean diet intervention would improve psoriasis severity in patients with mild to moderate disease.\nMEDIPSO (Impact of the Mediterranean Diet on Patients With Psoriasis), an open-label, single-center, single-blinded (evaluator) randomized clinical trial, was conducted from February 2024 to March 2025 at a dermatology referral clinic in Madrid, Spain. Participants were adults with mild to moderate psoriasis (Psoriasis Area and Severity Index [PASI] of 2-10, with higher scores indicating maximal disease) receiving stable topical therapy.\nParticipants were randomized 1:1 to the intervention or control group. The intervention group received a 16-week, dietitian-guided Mediterranean diet program, including nutritional counseling, educational materials, and weekly provision of extra virgin olive oil. The control group received standard low-fat dietary advice without dietitian supervision.\nThe primary outcome was the change in the PASI from baseline to week 16. Secondary outcomes included changes in Mediterranean diet adherence, anthropometric and metabolic parameters, serum inflammatory cytokines, and patient-reported outcomes. Estimated marginal means (EMMs) at baseline and for the change from baseline to week 16 were reported, with the intervention effect presented as the between-group difference.\nAmong 45 individuals screened, 38 participants were enrolled and randomized (mean [SD] age, 46.4 [12.8] years; 25 males [65.8%]); 19 were randomized to the intervention group and 19 were randomized to the control group; 37 individuals (97.4%) completed the study. The EMM PASI change at week 16 was -3.4 (95% CI, -4.4 to -2.4) in the intervention group and 0.0 (95% CI, -1.0 to 1.0) in the control group; the between-group EMM difference was -3.4 (95% CI, -4.8 to -2.0; P < .001). Nine of 19 participants in the Mediterranean diet group (47.4%) achieved PASI 75 (a 75% reduction in PASI) compared with none in the control group. A significant reduction in EMM hemoglobin A1c (glycated hemoglobin) was observed in the intervention group as compared with the control group (between-group EMM difference, -4.1 mmol/mol [95% CI, -6.9 to -1.3 mmol/mol]; P = .01).\nThis randomized clinical trial found that a 16-week Mediterranean diet intervention significantly improved psoriasis severity in patients with mild to moderate disease receiving stable topical therapy. These findings suggest that incorporating dietary strategies may be beneficial as an adjunctive therapy in psoriasis management.\nClinicalTrials.gov Identifier: NCT06257641.",
  "pub_date": "2025-12-01",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Programa de Doctorado en Ciencias de la Salud, Alcalá de Henares University, Madrid, Spain.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Department of Preventive Medicine and Public Health, Instituto de Investigación Sanitaria de Navarra, University of Navarra, Pamplona, Spain.",
    "Centro de Investigación Biomédica en Red de la Fisiopatología de la Obesidad y Nutrición, Instituto de Salud Carlos III, Madrid, Spain.",
    "Department of Preventive Medicine and Public Health, Instituto de Investigación Sanitaria de Navarra, University of Navarra, Pamplona, Spain.",
    "Centro de Investigación Biomédica en Red de la Fisiopatología de la Obesidad y Nutrición, Instituto de Salud Carlos III, Madrid, Spain.",
    "Faculty of Medicine, Universidad Francisco de Vitoria, Medicine Faculty, Madrid, Spain.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Programa de Doctorado en Ciencias de la Salud, Alcalá de Henares University, Madrid, Spain.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Faculty of Medicine, Universidad Francisco de Vitoria, Medicine Faculty, Madrid, Spain.",
    "Blauvelt Consulting, LLC, Annapolis, Maryland.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Programa de Doctorado en Ciencias de la Salud, Alcalá de Henares University, Madrid, Spain.",
    "Department of Cardiology, The George Washington University Hospital, Washington, DC.",
    "Department of Dermatology, Perelman School of Medicine, University of Pennsylvania, Philadelphia.",
    "Department of Biostatistics, Epidemiology and Informatics, Perelman School of Medicine, University of Pennsylvania, Philadelphia.",
    "Department of Preventive Medicine and Public Health, Instituto de Investigación Sanitaria de Navarra, University of Navarra, Pamplona, Spain.",
    "Centro de Investigación Biomédica en Red de la Fisiopatología de la Obesidad y Nutrición, Instituto de Salud Carlos III, Madrid, Spain.",
    "Department of Nutrition, Harvard T.H. Chan School of Public Health, Boston, Massachusetts.",
    "Hospital Universitario Ramón y Cajal, Department of Dermatology, Instituto Ramón y Cajal de Investigación Sanitaria, Madrid, Spain.",
    "Programa de Doctorado en Ciencias de la Salud, Alcalá de Henares University, Madrid, Spain.",
    "Centro de Investigación Biomédica en Red de la Fisiopatología de la Obesidad y Nutrición, Instituto de Salud Carlos III, Madrid, Spain.",
    "Faculty of Medicine, Universidad Francisco de Vitoria, Medicine Faculty, Madrid, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40991259/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}