{
  "pmid": "41010676",
  "title": "Long-Term Outcomes of Guselkumab and Risankizumab for the Management of Moderate-to-Severe Psoriasis in the Elderly: Results from a Real-World Retrospective Study.",
  "abstract": "Background/Objectives: The treatment landscape of psoriasis has changed dramatically with the emergence of novel biological agents such as those targeting interleukin (IL)-23. Despite their high efficacy, evidence regarding their effectiveness and tolerability in elderly patients is currently limited. The number of older adults living with psoriasis is constantly increasing, highlighting the need for evidence-based guidance focused on this population. The aim of this study was to summarize our center's experience with the IL-23 inhibitors guselkumab and risankizumab for the treatment of moderate-to-severe psoriasis in patients aged ≥65 years. Methods: We retrospectively reviewed all charts of moderate-to-severe psoriasis patients who received at least one dose of guselkumab or risankizumab (tildrakizumab is not available for use in Greece as of this date) and included those aged ≥65 years at the time of drug initiation. Disease severity was assessed using the Psoriasis Area and Severity Index (PASI), which was calculated at baseline and each subsequent visit up to 156 weeks of treatment. Treatment responses were evaluated with the percentages of patients achieving PASI75/90/100 (reductions from baseline PASI by 75, 90, and 100%, respectively) and absolute PASI ≤ 1 and PASI ≤ 3. All adverse events (AEs) were assessed and documented. The drug survival was estimated using the Kaplan-Meier estimate. Results: In total, 93 elderly patients (64 risankizumab and 29 guselkumab) were included. Regarding risankizumab's effectiveness, PASI75 response rates increased from 77.4% at week 12 to 90.9% at week 52 and remained stable at 90.5% by week 156. Corresponding PASI100 responses were 67.7%, 81.8%, and 80.9%, respectively. Guselkumab-treated patients exhibited PASI75 response rates of 71.4% at week 12, which improved to 91.3% at week 52 and 100% for those evaluated at week 156, with PASI100 responses of 57.1%, 73.9%, and 83.3%. During observation, 6 (9.4%) risankizumab and 2 (6.9%) guselkumab patients discontinued medication. No statistically significant differences were observed regarding drug survival between patients aged ≥65 vs. <65 years. No serious AEs occurred, and no patient discontinued medication due to AEs. Conclusions: Both guselkumab and risankizumab demonstrated sustained efficacy and persistence along with a favorable safety profile in elderly patients with psoriasis over a three-year period. While our study is limited by its retrospective nature, our findings support the use of IL-23 inhibitors in this growing patient population.",
  "pub_date": "2025-09-14",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece.",
    "1st Department of Dermatology and Venereology, \"Andreas Sygros\" Hospital for Skin Diseases, National & Kapodistrian University of Athens Medical School, 16121 Athens, Greece."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41010676/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}