{
  "pmid": "41062841",
  "title": "Determinants of Satisfaction with Medical Care for Hidradenitis Suppurativa: Results from a Multicentre Survey in Germany.",
  "abstract": "Hidradenitis suppurativa (HS) is a chronic inflammatory skin disease associated with considerable physical and psychosocial distress. Recent studies have reported low levels of satisfaction among patients with HS regarding the medical care of their condition. The objective of the study was to identify modifiable determinants of low satisfaction with HS care from both patient and dermatologist perspectives.\nThis prospective, questionnaire-based survey was conducted among patients with HS and, for comparison, among those with psoriasis, as well as their treating dermatologists, in 20 dermatological centres in Germany.\nA total of 257 patients and 76 dermatologists participated in the study. The proportion of patients reporting high satisfaction with care for their skin disease (scores > 8 on a 0-10 scale) was 30.7% for HS and 69.4% for psoriasis (P < 0.001). The proportion of dermatologists highly satisfied with medical care for HS and psoriasis was 0.0% and 38.9%, respectively (P < 0.001). Multiple regression modelling revealed that satisfaction with pharmacotherapy was the primary predictor of medical care satisfaction for both patients and dermatologists. Experience with systemic antibiotics was associated with lower patient satisfaction regarding pharmacotherapy, while satisfaction tended to be higher when patients had experienced therapy with biologics. Another significant determinant of patient satisfaction with medical care was the provision of information about HS by dermatologists, which was linked to consultations occurring at least quarterly and lasting ≥ 20 min. No association was observed between disease severity and the identified determinants of patient satisfaction with medical care. Dermatologists' satisfaction with medical care was additionally linked with the perceived availability of referral options to other dermatological facilities.\nImprovements in patient satisfaction with HS care may be achieved through enhanced patient education about the disease and regular dermatologist consultations; however, optimal HS management ultimately requires effective pharmacological treatment.\ndrks.de, DRKS00031572.",
  "pub_date": "2025-10-09",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Charité-Universitätsmedizin Berlin, Corporate Member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Campus Charité Mitte, Charitéplatz 1, 10117, Berlin, Germany. kerstin.wolk@charite.de.",
    "Centre of Skin Diseases, University Hospital Bonn, Bonn, Germany.",
    "ICH-International Center for Hidradenitis Suppurativa/Acne Inversa, Department of Dermatology, Venereology and Allergology, Ruhr-University Bochum, Bochum, Germany.",
    "Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Charité-Universitätsmedizin Berlin, Corporate Member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Campus Charité Mitte, Charitéplatz 1, 10117, Berlin, Germany.",
    "Dermatology Practice Dr. Friedrich and Dr. Philipp, Oranienburg, Germany.",
    "Department of Dermatology and Phlebology, Vivantes Klinikum im Friedrichshain, Berlin, Germany.",
    "Department of Dermatology, Venereology, and Allergology, University Medical Center Göttingen, Göttingen, Germany.",
    "Department of Dermatology, Venereology, and Allergology, University Medical Center Göttingen, Göttingen, Germany.",
    "ICH-International Center for Hidradenitis Suppurativa/Acne Inversa, Department of Dermatology, Venereology and Allergology, Ruhr-University Bochum, Bochum, Germany.",
    "Centre of Skin Diseases, University Hospital Bonn, Bonn, Germany.",
    "Department of Dermatology and Phlebology, Vivantes Klinikum im Friedrichshain, Berlin, Germany.",
    "Department of Dermatology and Phlebology, Vivantes Klinikum im Friedrichshain, Berlin, Germany.",
    "Department of Dermatology, Klinikum Frankfurt (Oder), Frankfurt (Oder), Germany.",
    "Dermatology Practice Siddi & Bachmann, Berlin, Germany.",
    "Medizinisches Versorgungszentrum Lobetal, Bernau bei Berlin, Germany.",
    "Dermatology Practice Dr. Gross, Potsdam, Germany.",
    "Dermatology Practice Dr. Friedrich and Dr. Philipp, Oranienburg, Germany.",
    "Department of Dermatology, Bundeswehr Hospital, Berlin, Germany.",
    "Dermatology Potsdam MVZ, Potsdam, Germany.",
    "Department of Dermatology, Venereology and Allergology, Charité-Universitätsmedizin Berlin, Corporate Member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany.",
    "Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Charité-Universitätsmedizin Berlin, Corporate Member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Campus Charité Mitte, Charitéplatz 1, 10117, Berlin, Germany.",
    "Centre for Dermatosurgery, Havelklinik, Berlin, Germany.",
    "Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Charité-Universitätsmedizin Berlin, Corporate Member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Campus Charité Mitte, Charitéplatz 1, 10117, Berlin, Germany.",
    "Translational Skin Inflammation Research and former Psoriasis Research and Treatment Center, Department of Dermatology, Venereology and Allergology, Charité-Universitätsmedizin Berlin, Corporate Member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Campus Charité Mitte, Charitéplatz 1, 10117, Berlin, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41062841/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}