{
  "pmid": "41066059",
  "title": "Considerations for Treating Generalized Pustular Psoriasis (GPP): A Narrative Review.",
  "abstract": "Generalized pustular psoriasis (GPP) is a rare, chronic dermatological condition characterized by widespread pustulation that may be associated with other cutaneous and systemic manifestations. If left untreated, it may be life-threatening. Therapies developed for plaque psoriasis have been used to treat GPP with limited efficacy; however, these therapies do not target the interleukin (IL)-36 pathway, which is the most common pathway implicated in the pathogenesis of GPP. A systemic biologic targeting the IL-36 receptor for the treatment of GPP is currently the only approved treatment for GPP and allows for an opportunity to improve patient outcomes. This manuscript outlines practical considerations that aim to provide guidance on personalizing the treatment of GPP.",
  "pub_date": "2025-10-09",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Lynde Dermatology, Markham, Ontario, Canada. derma@lynderma.com.",
    "Probity Medical Research, Markham, Ontario, Canada. derma@lynderma.com.",
    "Department of Medicine, University of Toronto, Toronto, Ontario, Canada. derma@lynderma.com.",
    "Division of Dermatology, Department of Medicine, University of Calgary, Calgary, Alberta, Canada.",
    "Section of Community Pediatrics, Department of Pediatrics, University of Calgary, Calgary, Alberta, Canada.",
    "Section of Pediatric Rheumatology, Department of Pediatrics, University of Calgary, Calgary, Alberta, Canada.",
    "Dermatology Research Institute, Calgary, Alberta, Canada.",
    "Skin Health & Wellness Centre, Calgary, Alberta, Canada.",
    "Probity Medical Research, Calgary, Alberta, Canada.",
    "SKiN Centre for Dermatology, Peterborough, Ontario, Canada.",
    "Probity Medical Research, Peterborough, Ontario, Canada.",
    "Queen's University, Peterborough, Ontario, Canada.",
    "Division of Dermatology and Skin Science, University of British Columbia, Vancouver, British Columbia, Canada.",
    "Probity Medical Research, Surrey, British Columbia, Canada.",
    "Faculty of Medicine, Division of Dermatology, University of Ottawa, Ottawa, Ontario, Canada.",
    "The Ottawa Hospital, Ottawa, Ontario, Canada.",
    "Division of Dermatology, Faculty of Medicine, University of Toronto, Toronto, Ontario, Canada.",
    "Division of Dermatology, Department of Medicine, Sunnybrook Health Sciences Centre, University of Toronto, Toronto, Ontario, Canada.",
    "Division of Dermatology, Women's College Hospital, Toronto, Ontario, Canada.",
    "The Hospital for Sick Children, Toronto, Ontario, Canada.",
    "Centre de Recherche Dermatologique du Québec (CRDQ), Quebec, Canada.",
    "Department of Medicine, Division of Dermatology, McGill University, Montreal, Quebec, Canada.",
    "Brunswick Dermatology Center, Fredericton, New Brunswick, Canada.",
    "Department of Medicine, Dalhousie University, Halifax, Nova Scotia, Canada.",
    "Probity Medical Research, Waterloo, Ontario, Canada.",
    "Department of Medicine, Division of Dermatology, McMaster University, Hamilton, Ontario, Canada.",
    "Dermatrials Research Inc, Hamilton, Ontario, Canada.",
    "Division of Dermatology, Department of Medicine, University of Toronto, Toronto, Ontario, Canada.",
    "Probity Medical Research, Toronto, Ontario, Canada.",
    "Probity Medical Research Inc, Waterloo, Ontario, Canada.",
    "Alliance Clinical Trials, Waterloo, Ontario, Canada.",
    "Temerty Faculty of Medicine, Division of Dermatology, University of Toronto, Toronto, Ontario, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41066059/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}