{
  "pmid": "41073119",
  "title": "PLAN-psoriasis: protocol for a randomised controlled feasibility trial comparing patient-led 'as-needed' treatment and therapeutic drug monitoring-guided treatment to continuous treatment for adults with clear or almost clear skin on risankizumab monotherapy for psoriasis.",
  "abstract": "Targeted biologic therapies have transformed outcomes for individuals with psoriasis, a common immune-mediated inflammatory skin disease. The widespread use of these highly effective treatments has led to a growing number of individuals with clear or nearly clear skin remaining on continuous, long-term treatment. Personalised strategies to minimise drug exposure may sustain long-term disease control while reducing treatment burden, associated risks and healthcare costs. This study aims to evaluate the feasibility of a definitive pragmatic effectiveness trial of two personalised dose minimisation strategies compared with continuous treatment (standard care) in adults with well-controlled psoriasis receiving the exemplar biologic risankizumab.\nThis is a multicentre, assessor-blind, parallel group, open-label randomised controlled feasibility trial in the UK, evaluating two personalised biologic dose minimisation strategies for psoriasis. 90 adults with both physician-assessed and patient-assessed clear or nearly clear skin on risankizumab monotherapy for ≥12 months will be randomised in a 1:1:1 ratio to (1) patient-led 'as-needed' treatment, where risankizumab is administered at the first sign of self-assessed psoriasis recurrence, (2) therapeutic drug monitoring-guided treatment, with personalised dosing intervals determined using a pharmacokinetic model or (3) continuous treatment as per standard care, for 12 months. Participants will be invited to submit self-reported outcomes and self-taken photographs every 3 months using a bespoke remote monitoring system (mySkin app) and will attend an in-person assessment at 12 months. They may also request additional patient-initiated follow-up appointments during the trial if needed. The primary outcome is the practicality and acceptability of the two personalised biologic dose minimisation strategies, assessed as a composite measure including recruitment and retention rates, adherence to the assigned strategies and acceptability to both patients and clinicians. The feasibility of collecting healthcare cost and resource utilisation data will also be evaluated to inform a future cost-effectiveness analysis. A nested qualitative study, involving semistructured interviews with patients and clinicians, will explore perspectives on the personalised biologic dose minimisation strategies. These findings will inform the design of a future definitive trial.\nThis study received ethical approval from the Seasonal Research Ethics Committee (reference 24/LO/0089). Results will be disseminated through scientific conferences, peer-reviewed publications and patient/public engagement events. Lay summaries and infographics will be codeveloped with patient partners to ensure the findings are accessible for the wider public.\nISRCTN17922845.",
  "pub_date": "2025-10-10",
  "publication_types": [
    "Journal Article",
    "Clinical Trial Protocol"
  ],
  "affiliations": [
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "Social, Genetic and Developmental Psychiatry Centre, King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "Research and Development, Guy's and St Thomas' NHS Foundation Trust, London, UK.",
    "Psoriasis Association, Northampton, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "School of Primary Care, Population Sciences and Medical Education, University of Southampton, Southampton, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "Centre for Rheumatic Diseases, King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust & Division of Musculoskeletal and Dermatological Sciences, Manchester Academic Health Science Centre, University of Manchester, Manchester, UK.",
    "Centre for Adherence Research and Education, King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "Centre for Adherence Research and Education, King's College London, London, UK.",
    "Infection, Immunity and Inflammation Research & Teaching Department, UCL Great Ormond Street Institute of Child Health, London, UK.",
    "Centre for Rheumatic Diseases, King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust & King's College London, London, UK satveer.mahil@kcl.ac.uk."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41073119/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}