{
  "pmid": "41115620",
  "title": "Hypothalamic pituitary adrenal axis hormone changes during IL-17A inhibition with secukinumab in patients with psoriasis.",
  "abstract": "Secukinumab, an interleukin-17 A (IL-17 A) inhibitor, is an approved treatment for psoriasis, but effects on the hypothalamic pituitary adrenal (HPA) axis are unknown.\nIn a 16-week randomized controlled trial, 105 patients with psoriasis received secukinumab at either 300 or 75 mg. Plasma levels of IL-17 A, cortisol, adrenocorticotropic hormone, prolactin, dehydroepiandrosterone and perceived stress using Perceived Stress Scale (PSS-10) were measured at baseline and every four weeks. Treatment response was assessed using Psoriasis Area and Severity Index (PASI).\nBoth dosage groups showed significant increases in IL-17 A and cortisol, with no differences between groups. Cortisol increased by approximately 33 %, indicating activation of HPA axis. Changes in cortisol did not correlate with PASI. PSS-10 inversely correlated with cortisol at baseline, and shifted positive during follow-up.\nSecukinumab treatment in psoriasis is accompanied by HPA axis activation. Further studies are needed to determine the duration, mechanisms, and magnitude of this activation.",
  "pub_date": "2025-10-18",
  "publication_types": [
    "Journal Article",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "Department of Dermatology, Venereology and Allergology, University Hospital Essen, University Duisburg-Essen, Hufelandstr. 55, 45122 Essen, Germany. Electronic address: Frederik.krefting@uk-essen.de.",
    "Institute of Medical Psychology and Behavioral Immunobiology, University Hospital Essen, University of Duisburg-Essen, Essen, Germany; Institute for Medical Education, Center for Translational Neuro- and Behavioral Sciences (C-TNBS), University Hospital Essen, University of Duisburg-Essen, Essen, Germany.",
    "Department of Dermatology, Venereology and Allergology, University Hospital Essen, University Duisburg-Essen, Hufelandstr. 55, 45122 Essen, Germany.",
    "Institute of Medical Psychology and Behavioral Immunobiology, University Hospital Essen, University of Duisburg-Essen, Essen, Germany; Department of Clinical Neuroscience, Osher Center for Integrative Medicine, Karolinska Institutet, 171 77 Stockholm, Sweden."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41115620/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}