{
  "pmid": "41131440",
  "title": "Exploring Two New, Validated Disease-Specific Outcome Measures to Assess Severity of Chronic Hand Eczema: Investigator Global Assessment of Chronic Hand Eczema (IGA-CHE) and Hand Eczema Symptom Diary (HESD)-A Podcast.",
  "abstract": "Chronic hand eczema (CHE) is defined as hand eczema that persists for more than 3 months or reoccurs at least two times a year. Although it is a distinct disease with a significant impact on quality of life, awareness of the disease and tailored treatment options remain limited. This limited awareness along with a lack of CHE-specific outcome measures can lead to inadequate disease management and recurrence. The Investigator Global Assessment of Chronic Hand Eczema (IGA-CHE) and the Hand Eczema Symptom Diary (HESD) are new, specific outcome measures validated in patients with CHE. They were developed based on recommendations from regulatory authorities to establish outcome measures that can accurately evaluate potential treatments for CHE. IGA-CHE is a clinician-reported outcome measure that assesses disease severity, while HESD (including the single-item HESD Itch and HESD Pain scores) is patient-reported and evaluates signs and symptoms of CHE. Overall, IGA-CHE and HESD are simple, reliable, responsive, and easy to use tools that can detect subtle changes in CHE signs and symptoms, providing a comprehensive assessment of disease severity. Their validation ensures these tools can accurately and consistently measure treatment outcomes, making them valuable in clinical trials and clinical practice. In this podcast, three dermatologists discuss two recently published studies evaluating IGA-CHE and HESD in patients with CHE, and focus on (1) the need for CHE-specific outcome measures in clinical trials and practices, (2) how the IGA-CHE and HESD outcome measures provide accurate assessments of disease severity and clinically meaningful responses to treatments, and (3) key differences from other common outcome measures used in CHE clinical trials. Podcast Audio (MP4 1,01,828 kb).",
  "pub_date": "2025-10-23",
  "publication_types": [
    "Letter"
  ],
  "affiliations": [
    "Chicago Medical School, Rosalind Franklin University of Medicine and Science, North Chicago, IL, USA.",
    "Center for Medical Dermatology + Immunology Research, Chicago, IL, USA.",
    "Oregon Medical Research Center, Portland, OR, USA.",
    "School of Medicine and Health Sciences, The George Washington University, Washington, DC, USA. jonathanisilverberg@gmail.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41131440/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}