{
  "pmid": "41134450",
  "title": "Roflumilast Cream 0.3% in Patients with Chronic Plaque Psoriasis: Pooled PASI and PASI-HD Results from the DERMIS Phase III Trials.",
  "abstract": "Roflumilast cream 0.3% contains a selective, highly potent phosphodiesterase 4 inhibitor approved to treat plaque psoriasis. The Psoriasis Area and Severity Index (PASI)-High Discrimination (PASI-HD) is more precise than PASI when psoriasis involves < 10% of the area of an anatomic region. Clinical trials of roflumilast utilized PASI and its modified version, PASI-HD, to assess disease improvement. The objective of this analysis was to demonstrate the effect of topical roflumilast in patients with psoriasis and to compare PASI-HD with PASI.\nDERMIS-1 and DERMIS-2 were phase III, 8-week, randomized, vehicle-controlled trials of once-daily roflumilast cream 0.3% in patients aged ≥ 2 years with psoriasis involving 2-20% body surface area. PASI and PASI-HD were clinical endpoint measures.\nAt week 8, statistically significantly more roflumilast- than vehicle-treated patients achieved ≥ 75% reduction in PASI (40.3% vs 6.5%; P < 0.0001) and PASI-HD (59.9% vs 17.9%; P < 0.0001). Evaluations using PASI-HD resulted in larger effect sizes compared with PASI at higher levels of response.\nRoflumilast-treated patients experienced greater improvements in disease severity than vehicle-treated patients. The PASI-HD can more accurately assess disease changes compared with PASI.\nClinicalTrials.gov Identifiers: DERMIS-1, NCT04211363; DERMIS-2, NCT04211389.",
  "pub_date": "2025-10-24",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Probity Medical Research and Alliance Clinical Trials, 135 Union St E, Waterloo, ON, N2J 1C4, Canada. kapapp@probitymedical.com.",
    "Division of Dermatology, Temerty Faculty of Medicine, University of Toronto, Toronto, ON, Canada. kapapp@probitymedical.com.",
    "JDR Dermatology Research, Las Vegas, NV, USA.",
    "Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "SKiN Centre for Dermatology, Peterborough, ON, Canada.",
    "Probity Medical Research, Peterborough, ON, Canada.",
    "Queen's University, Peterborough, ON, Canada.",
    "UTHealth McGovern Medical School, Houston, TX, USA.",
    "Department of Dermatology and Skin Science, University of British Columbia, Surrey, BC, Canada.",
    "Probity Medical Research, Surrey, BC, Canada.",
    "Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "Indiana Medical Center, Indianapolis, IN, USA.",
    "Physicians Skin Care, PLLC, Louisville, KY, USA.",
    "Skin Sciences, PLLC, Louisville, KY, USA.",
    "Eastern Virginia Medical School, Norfolk, VA, USA.",
    "Henry Ford Medical Center, Detroit, MI, USA.",
    "Yale School of Medicine, New Haven, CT, USA.",
    "Arcutis Biotherapeutics, Inc., Westlake Village, CA, USA.",
    "Arcutis Biotherapeutics, Inc., Westlake Village, CA, USA.",
    "Arcutis Biotherapeutics, Inc., Westlake Village, CA, USA.",
    "Arcutis Biotherapeutics, Inc., Westlake Village, CA, USA.",
    "Arcutis Biotherapeutics, Inc., Westlake Village, CA, USA.",
    "Arcutis Biotherapeutics, Inc., Westlake Village, CA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41134450/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}