{
  "pmid": "41131909",
  "title": "Effect of interleukin 23 inhibitors (risankizumab and guselkumab) on cardiovascular and cerebrovascular risk in psoriasis patients.",
  "abstract": "Psoriasis is a chronic systemic inflammatory disease mediated by the immune system. Interleukin-23 (IL-23) plays a key role in its pathogenesis by amplifying inflammation, triggering atherogenic dyslipidemia and insulin resistance, and thereby increasing cardiovascular and cerebrovascular risk. This study aimed to evaluate the effect of the IL-23 inhibitors risankizumab and guselkumab, used in psoriasis treatment, on cardiovascular and cerebrovascular risk through the plasma atherogenic index (PAI) and triglyceride-glucose (TyG) index.\nThis retrospective study included 110 patients diagnosed with psoriasis and treated with risankizumab (n = 61) or guselkumab (n = 49). Psoriasis Area and Severity Index (PASI) scores, triglyceride (TG), high-density lipoprotein cholesterol (HDL-C), total cholesterol (TC), low-density lipoprotein cholesterol (LDL-C), very low-density lipoprotein cholesterol (VLDL-C) levels and fasting blood glucose (FBG) values at baseline and at 6 months of treatment were obtained from patient records. The plasma atherogenic index (PAI) was calculated as log₁。(TG/HDL-C), and the triglyceride-glucose (TyG) index as log₁。(TG × FBG / 2).\nIn both IL-23 inhibitor groups included in the study, PASI scores, PAI, and TyG index values showed a significant decrease from baseline at the 6th month of treatment (p < 0.05). However, there was no significant difference in the reduction of index levels between the groups (p > 0.05).\nIL-23 inhibitors can reduce atherogenic dyslipidemia and insulin resistance alongside dermatological improvement in the treatment of psoriasis. This suggests a potential role for these agents in reducing the risk of cardiovascular and cerebrovascular disease. However, large-scale, long-term studies are needed to confirm these beneficial effects.",
  "pub_date": "2025-10-23",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Medical Faculty, Department of Dermatology, Necmettin Erbakan University, Konya, Turkey.",
    "Medical Faculty, Department of Dermatology, Necmettin Erbakan University, Konya, Turkey.",
    "Medical Faculty, Department of Dermatology, Necmettin Erbakan University, Konya, Turkey.",
    "Medical Faculty, Department of Dermatology, Necmettin Erbakan University, Konya, Turkey.",
    "Medical Faculty, Department of Dermatology, Necmettin Erbakan University, Konya, Turkey.",
    "Medical Faculty, Department of Dermatology, Necmettin Erbakan University, Konya, Turkey."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41131909/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}