{
  "pmid": "41161679",
  "title": "Intraclass Switching of IL-23 Inhibitors in Psoriasis: Effectiveness, Patterns, and Predictors of Response - A Retrospective Multicenter Study in Italy.",
  "abstract": "IL-23 inhibitors are highly effective therapies for psoriasis, but some patients may need to discontinue the treatment. Intraclass switching is a potential strategy, though data on its effectiveness remain limited.\nTo evaluate the patterns and effectiveness of intraclass switching among IL-23 inhibitors in a real world setting.\nThis retrospective, multicenter study included adult patients with plaque psoriasis who switched between IL-23 inhibitors. Clinical and demographic data were analyzed, and univariable and multivariable analyses identified predictors of treatment response.\nWe analyzed 116 patients (120 switches). Switching occurred from guselkumab (45.0%), tildrakizumab (44.2%), and risankizumab (10.8%), mainly due to secondary ineffectiveness (82.5%). Risankizumab was the most common post-switch agent (70.0%), followed by guselkumab (23.3%) and tildrakizumab (6.7%). PASI90 rates were 28.5% at week 16, 49.5% at week 36, and 60.7% at week 52. Withdrawal occurred in 12.5% of cases, mainly due to lack of efficacy (66.7%) or adverse events (26.7%). Univariate analysis showed lower PASI90 achievement in PsA patients at weeks 16 after the switch (p = 0.0209) and 36 (p = 0.026) and in those with BMI ≥25 at week 52 (p = 0.0108). Patients switching from risankizumab had lower PASI90 rates at weeks 16 (p = 0.0489) and 36 (p = 0.0349), while those switching to risankizumab had higher PASI90 rates at week 16 (p = 0.0257). Multivariate analysis confirmed BMI >25 was associated with reduced PASI90 at weeks 36 (p = 0.0403) and 52 (p = 0.0462).\nIntraclass switching among IL-23 inhibitors is an effective strategy, with risankizumab emerging as the most favorable option.",
  "pub_date": "2025-10-30",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "UOC di Dermatologia, Dipartimento di Scienze Mediche e Chirurgiche, Fondazione Policlinico Universitario A. Gemelli - IRCCS, Rome, Italy.",
    "Dermatologia, Dipartimento di Medicina e Chirurgia Traslazionale, Università Cattolica del Sacro Cuore, Rome, Italy.",
    "UOC di Dermatologia, Dipartimento di Scienze Mediche e Chirurgiche, Fondazione Policlinico Universitario A. Gemelli - IRCCS, Rome, Italy.",
    "Dermatologia, Dipartimento di Medicina e Chirurgia Traslazionale, Università Cattolica del Sacro Cuore, Rome, Italy.",
    "Dermatology Unit, Università degli Studi della Campania Luigi Vanvitelli, Naples, Italy.",
    "Burlando- Section of Dermatology, Department of Health Sciences (DiSSal), Ospedale Policlinico San Martino-IRCCS, Genoa, Italy.",
    "Department of Medicine and Surgery, University of Insubria, 21100 Varese, Italy.",
    "Department of Dermatology, University of Rome Tor Vergata, Rome, Italy.",
    "Department of Medicine Surgery and Dentistry, \"Scuola Medica Salernitana\", University of Salerno, 84084 Salerno, Italy.",
    "Dermatology Unit, Department of Surgical, Medical, Dental and Morphological Sciences Related to Transplant, Oncology and Regenerative Medicine, University of Modena and Reggio Emilia, Modena, Italy.",
    "Section of Dermatology - Department of Clinical Medicine and Surgery, University of Naples Federico II, Napoli, Italy.",
    "Department of Dermatology, Istituto Dermopatico dell'Immacolata IRCCS Roma, 00167 Rome, Italy.",
    "UOC Dermatologia, University of Catania, PO \"G. Rodolico\"- San Marco\", Catania, Italy.",
    "Department of Medical Sciences, Dermatology Clinic, University of Turin, Turin, Italy.",
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, Siena, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41161679/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}