{
  "pmid": "41168056",
  "title": "EULAR points to consider and consensus definitions for difficult-to-manage and treatment-refractory psoriatic arthritis.",
  "abstract": "This study aimed to develop evidence-based points to consider (PtC) and consensus definitions of difficult-to-manage (D2M) and treatment-refractory (TR) psoriatic arthritis (PsA).\nA multidisciplinary international European Alliance of Associations for Rheumatology (EULAR) task force (TF) of 27 members, including rheumatologists, dermatologists, health practitioners, and patient partners, was established, and the EULAR standardised operating procedures, including a systematic literature review and a consensus process, were followed.\nThe TF formulated 4 overarching principles addressing the proportion of patients with PsA with an unsatisfactory treatment response despite the best standard of care, and for which the causes are likely multifactorial. Six PtC highlight criterion relevant for subsequent definitions including failure to achieve or maintain response to ≥2 biological/targeted synthetic disease-modifying antirheumatic drugs with ≥2 different mechanisms of action; management of signs and symptoms perceived as problematic by the rheumatologist and/or the patient, and evidence of persistent disease activity in the presence of extramusculoskeletal manifestations and/or comorbidities and/or objective evidence of inflammatory activity. Finally, the following 2 definitions were developed: (1) D2M PsA, an umbrella term including drivers such as inflammation, comorbidities, psychosocial or other factors, incorporating (2) TR PsA, defined by persistent disease activity and objective evidence of active inflammation.\nEULAR proposes 2 consensus definitions to identify a D2M PsA population, including a TR subgroup. These definitions should now be tested in research studies to understand disease pathogenesis and improve care for people living with PsA.",
  "pub_date": "2025-10-29",
  "publication_types": [
    "Journal Article",
    "Consensus Statement",
    "Systematic Review"
  ],
  "affiliations": [
    "NIHR Leeds Biomedical Research Centre, The Leeds Teaching Hospitals NHS Trust and Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK. Electronic address: h.marzo-ortega@leeds.ac.uk.",
    "NIHR Leeds Biomedical Research Centre, The Leeds Teaching Hospitals NHS Trust and Leeds Institute of Rheumatic and Musculoskeletal Medicine, University of Leeds, Leeds, UK; Leeds Institute of Cardiovascular and Metabolic Medicine and Leeds Institutes of Data Analytics, University of Leeds, Leeds, UK.",
    "Joint Academic Rheumatology Program, First Department of Propaedeutic and Internal Medicine, Athens, Greece.",
    "Rheumatology Unit, Digitalization for the Sustainability of the Healthcare System (DS3) and Vall d'Hebron Hospital Universitari, Vall d'Hebron Barcelona Hospital Campus, Barcelona, Spain.",
    "Rheumatology Department, Ramón y Cajal University Hospital, Madrid, Spain.",
    "Ottawa Hospital Research Institute, University of Ottawa, Ottawa, Canada.",
    "Department of Internal Medicine and Rheumatology, Carol Davila University of Medicine and Pharmacy, Sf. Maria Hospital, Bucharest, Romania.",
    "Patient Research Partner, Oslo, Norway.",
    "School of Health Sciences, Cardiff University, Cardiff, UK.",
    "Rheumatology, Allergology and Clinical Immunology, University of Rome Tor Vergata, Rome, Italy.",
    "Department of Medicine, Section of Dermatology and Venereology, University of Verona, Rome, Italy.",
    "Copenhagen Center for Arthritis Research and the DANBIO Registry, Center for Rheumatology and Spine Diseases, Copenhagen University Hospital Rigshospitalet, Glostrup, Department of Clinical Medicine, University of Copenhagen, Faculty of Health and Medical Sciences, Copenhagen, Denmark.",
    "Sorbonne Université, INSERM, Institut Pierre Louis d'Epidémiologie et de Santé Publique, Team Pepites, and AP-HP, Pitié-Salpêtrière hospital, Rheumatology Department, Paris, France.",
    "Hacettepe University, Faculty of Medicine, Department of Internal Medicine, Division of Rheumatology, Ankara, Turkey.",
    "Academic Rheumatology Unit, University of Molise, Campobasso, Italy.",
    "Department of Rheumatology and Immunology, Heart and Vascular Center, Department of Genetics, Cell and Immunobiology, Semmelweis University, Budapest, Hungary.",
    "Patient Research Partner, Tranzo, Tilburg School of Social and Behavioral Sciences, Tilburg University, Tilburg, The Netherlands.",
    "Dermatology Department, Hospital de la Santa Creu i Sant Pau, Autonomous University of Barcelona, Barcelona, Spain.",
    "Rheumatology Division, Hospital Universitario Central de Asturias, Department of Medicine, Oviedo University, Oviedo, Spain.",
    "Division of Rheumatology, Memorial University, St. John's, Newfoundland, Canada.",
    "Department of Rheumatology, Clinic of Rheumatology, University Hospital \"St. Anna\", Medical University-Sofia, Sofia, Bulgaria.",
    "Rheumatology Section, Internal Medicine Service Hospital Italiano de Buenos Aires, and University Hospital Italiano de Buenos Aires, Buenos Aires, Argentina.",
    "VIB-UGent Center for Inflammation Research, Department of Internal Medicine and Pediatrics, Ghent University, Ghent, Belgium; Department of Rheumatology, Ghent University Hospital, Ghent, Belgium.",
    "Department of Rheumatology and Clinical Immunology, Amsterdam UMC, location AMC, University of Amsterdam, Amsterdam, The Netherlands; Amsterdam Rheumatology and Immunology Center (ARC), Amsterdam, The Netherlands; Amsterdam Institute for Immunology and Infectious Diseases, Amsterdam, The Netherlands.",
    "NOVA Medical School, Universidade NOVA de Lisboa, Lisboa, Portugal; Department of Rheumatology, Leiden University Medical Centre, Leiden, The Netherlands.",
    "Department of Neuromuscular Diseases, UCL Queen Square Institute of Neurology, University College London, London, UK; National Institute for Health Research (NIHR) University College London Hospitals Biomedical Research Centre, Department of Rheumatology, Northwick Park Hospital, London Northwest University Healthcare NHS Trust, London, UK.",
    "School of Infection and Immunity, University of Glasgow, Glasgow, UK."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41168056/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}