{
  "pmid": "41175101",
  "title": "Cumulative clinical benefits of biologic treatments in patients with moderate-to-severe psoriasis: an Italian real-life experience - IL PSO (Italian Landscape Psoriasis).",
  "abstract": "Psoriasis is a chronic inflammatory disease associated with significant long-term cumulative life course impairment. Achieving rapid relief from psoriasis is a crucial aspect of an effective treatment, as it helps patients manage their daily discomfort, including pain, itching, embarrassment, and other negative impacts of the disease. Cumulative clinical benefit, measured as the area under the curve (AUC) of PASI responses and days free of disease, offers a comprehensive assessment of treatment efficacy over time.\nTo evaluate the cumulative clinical benefits of biologic therapies in patients with moderate-to-severe plaque psoriasis in a real-world Italian multicenter setting.\nThis multicenter retrospective real-life study included patients treated with bimekizumab, brodalumab, guselkumab, ixekizumab, risankizumab, secukinumab, tildrakizumab, or ustekinumab at 23 Italian referral centers. Cumulative benefit was assessed by AUC of PASI100 from week 0 to 52, and days free of disease (PASI100). Analyses included subgroup evaluations by bio-naïve status and baseline PASI (≤10 vs >10).\nAmong 1017 patients, bimekizumab showed the highest cumulative clinical benefit, with a mean of 203 days free of disease. It was significantly superior to guselkumab (p<0.05), secukinumab (p<0.01), ustekinumab (p<0.01), and tildrakizumab (p<0.0001). The advantage was consistent across subgroups, with 216 days free of disease in bio-naïve and 184 in bio-experienced patients. No significant differences were found between bimekizumab and ixekizumab, brodalumab, or risankizumab.\nIn this multicenter real-life study, bimekizumab provides exploratory evidence on the cumulative clinical benefit of biologics in moderate-to-severe psoriasis. These findings highlight the importance of cumulative endpoints and individualized treatment strategies in daily practice.",
  "pub_date": "2025-11-01",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Clinical Dermatology Unit, San Gallicano Dermatological Institute, IRCCS, Rome, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Scientific Direction, San Gallicano Dermatological Institute, IRCCS, Rome, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy.",
    "Dermatology Unit, Department of Clinical Internal, Anesthesiological and Cardiovascular Science, University of La Sapienza, Rome, Italy.",
    "Dermatology Unit, University of Campania L. Vanvitelli, Naples, Italy.",
    "Department of Dermatology, Dipartimento di Scienze Della Salute (DISSal), University of Genoa, IRCCS Ospedale Policlinico San Martino, Genoa, Italy.",
    "Department of Clinical and Molecular Sciences-Dermatological Clinic, Università Politecnica Delle Marche, Ancona, Italy.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Department of Pathophysiology and Transplantation, Università degli Studi di Milano, Milan, Italy.",
    "Dermatology Unit, Department of Medicine and Surgery, University of Insubria, Varese, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy.",
    "Department of Dermatology, Dipartimento di Scienze Della Salute (DISSal), University of Genoa, IRCCS Ospedale Policlinico San Martino, Genoa, Italy.",
    "Department of Medical Science, Dermatology Clinic, University of Turin, Turin, Italy.",
    "Dermatology Unit, Department of Clinical Internal, Anesthesiological and Cardiovascular Science, University of La Sapienza, Rome, Italy.",
    "Dermatology Unit, University of Campania L. Vanvitelli, Naples, Italy.",
    "Department of Clinical and Experimental Medicine, Section of Dermatology, University of Messina.",
    "Dermatology Unit, Department of Clinical and Experimental Medicine, Ospedale Santa Chiara, Pisa, Italy.",
    "Interdisciplinary Center of Health Science, Sant'Anna School of Advanced Studies of Pisa, Pisa, Italy.",
    "Department of Dermatology, Dermatology Unit Azienda Ospedaliera San Donato Milanese, Milan, Italy.",
    "Dermatology Unit, IRCCS Humanitas Research Hospital, Rozzano, Milan, Italy.",
    "Department of Biomedical Sciences, Humanitas University, Pieve Emanuele, Milan, Italy.",
    "Section of Dermatology, Department of Medicine, University of Verona, Verona, Italy.",
    "Department of Biomedical and Dental Sciences and Morphofunctional Imaging, University of Messina, Messina, Italy.",
    "Dermatological Clinic, Department of Specialized Medicine, University of Modena, Modena, Italy.",
    "Department of Dermatology, University of Bari, Bari, Italy.",
    "Department of Dermatology, Dermatology Unit Azienda Ospedaliera San Donato Milanese, Milan, Italy.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Department of Pathophysiology and Transplantation, Università degli Studi di Milano, Milan, Italy.",
    "Department of Medical Science, Dermatology Clinic, University of Turin, Turin, Italy.",
    "Section of Dermatology, Department of Medicine, University of Verona, Verona, Italy.",
    "Department of Dermatology, Dermatology Unit Azienda Ospedaliera San Donato Milanese, Milan, Italy.",
    "Dermatology Unit, Department of Clinical and Experimental Medicine, Ospedale Santa Chiara, Pisa, Italy.",
    "Interdisciplinary Center of Health Science, Sant'Anna School of Advanced Studies of Pisa, Pisa, Italy.",
    "Dermatology Unit, Department of Clinical Internal, Anesthesiological and Cardiovascular Science, University of La Sapienza, Rome, Italy.",
    "Dermatology Unit, Department of Medicine and Surgery, University of Insubria, Varese, Italy.",
    "U.O.S.D. Dermatologica-Centro per la Cura della Psoriasi, Ospedale Perrino, Brindisi, Italy.",
    "Dermatology Unit, Department of Medical, Surgical and Neurological Sciences, University of Siena, Siena, Italy.",
    "Dermatology Unit, Department of Medicine and Surgery, University of Insubria, Varese, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41175101/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}