{
  "pmid": "41205050",
  "title": "Comparison of All-Cause Mortality in Generalized Pustular Psoriasis and Plaque Psoriasis: A Systematic Review and Meta-Analysis.",
  "abstract": "Generalized pustular psoriasis (GPP) is a chronic, systemic neutrophilic inflammatory disease, associated with acute flares and life-threatening complications. Plaque psoriasis, which is clinically and pathologically distinct from GPP, is also associated with mortality. While this has improved with the advent of effective biological therapies, progress in GPP is limited. The objective of this study was to compare all-cause mortality in GPP patients with that of plaque psoriasis patients and the general population.\nStudies reporting mortality in GPP and ≥ 1 comparator group were selected for inclusion in meta-analyses through a systematic literature review and review of unpublished data. Two independent reviewers performed study screening and data extraction. Pooled hazard ratios (HRs) were calculated using random effects models.\nPrimary meta-analyses included studies in Sweden and the USA, representing 3652, 8308 and 10,102 people with GPP, with plaque psoriasis and in the general population, respectively. All-cause mortality was 1.78 times higher (95% confidence interval [CI]: 1.52-2.09; P < 0.0001) for GPP than for plaque psoriasis and 2.92 times higher (95% CI: 1.12-7.60; P = 0.03) than for the general population. Sensitivity analyses, including studies in Germany and France, confirmed the primary results for GPP versus plaque psoriasis; pooled HRs were 1.79-2.31 (P < 0.01 for all analyses). Effect sizes across all four studies were considerably heterogeneous (I2 = 93.58%; Q = 54.93; P < 0.0001). A study in Germany, with significant heterogeneity, possibly due to miscoding issues, was included in a sensitivity analysis for GPP patients versus the general population; the pooled HR reduced to 1.63 (95% CI: 0.45-5.97; P = 0.46), with considerable heterogeneity in effect sizes (I2 = 98.35%; Q = 61.42; P < 0.0001).\nGPP patients' all-cause mortality is 2-3 times higher than those for plaque psoriasis patients and the general population, highlighting the need for improved management of GPP. This analysis provides a reference point to evaluate changes in mortality following the introduction of targeted treatments.",
  "pub_date": "2025-11-08",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Yale University, New Haven, CT, USA. brucestrober30@me.com.",
    "Central Connecticut Dermatology, Cromwell, CT, USA. brucestrober30@me.com.",
    "Department of Dermatology, Hospital de La Santa Creu i Sant Pau, Barcelona, Spain.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "Boehringer Ingelheim International GmbH, Ingelheim, Germany.",
    "Boehringer Ingelheim International GmbH, Ingelheim, Germany.",
    "Boehringer Ingelheim International GmbH, Ingelheim, Germany.",
    "Boehringer Ingelheim International GmbH, Ingelheim, Germany.",
    "Boehringer Ingelheim Pharmaceuticals, Inc., Ridgefield, CT, USA.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust and Division of Musculoskeletal and Dermatological Sciences, Manchester NIHR Biomedical Research Centre, Manchester Academic Health Science Centre, University of Manchester, Manchester, UK."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41205050/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}