{
  "pmid": "41216914",
  "title": "Prescribing and switching patterns of biological therapy in patients with psoriasis: real-world experience.",
  "abstract": "The advent of new biological agents in recent years has increased psoriasis patients' treatment options. Our objective was to evaluate the prescribing and switching patterns of biologic agents used for psoriasis in Malaysia.\nData was obtained from the Malaysian Psoriasis Registry (MPR) from January 2011 to September 2022. All patients treated with biologic agents were included. Those with at least 2 entries were selected for sub-group analysis to evaluate switching patterns. \"Continuous therapy\" was defined as those who continued with the same biologic in the subsequent follow-up, whereas those who switched to another type of biologic, were defined as \"switching therapy\".\nOf 25,468 patients, 555 (2.2%) received at least one biological agent. The mean age of patients on biologics was 42.6 years with a male: female ratio of 1:0.8. Of 645 biologic prescriptions, secukinumab was the most common (37.8%), followed by ustekinumab (27.9%), adalimumab (18.3%) and guselkumab (4.5%). Etanercept had the longest mean usage duration at 46.2 months. Eighty patients (14.4%) had their biologic agent switched. The most frequent switch pattern was from anti-IL12/23 to anti-IL17 (25%), followed by TNFi to anti-IL17(16.3%) and anti-12/23 (13.8%). Anti-IL17 was the preferred agent on switching (46.3%). Primary and secondary lack of efficacy were the most common reasons for switching (45.8% and 25% respectively). Concurrent systemic therapy was reported in 21.6%. Of these, 76.6% had received methotrexate.\nUp to 2% of the psoriasis patients received biological treatment. Anti-IL17 was the preferred first- and second-line biologic agent used in Malaysia.",
  "pub_date": "2025-11-11",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Hospital Pulau Pinang, Georgetown, Penang, Malaysia.",
    "Department of Dermatology, Hospital Kuala Lumpur, Kuala Lumpur, Malaysia.",
    "Department of Dermatology, Hospital Kuala Lumpur, Kuala Lumpur, Malaysia.",
    "Department of Dermatology, Sarawak General, Kuching, Sarawak, Malaysia.",
    "Department of Dermatology, Hospital Kuala Lumpur, Kuala Lumpur, Malaysia."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41216914/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}