{
  "pmid": "41210577",
  "title": "Comprehensive assessment of 5 interleukin inhibitors for the treatment of psoriasis: scientific guidance based on drug selection recommendations for Chinese medical institutions.",
  "abstract": "Based on the best available evidence, rapid health technology was used to assess 5 interleukin inhibitors approved for marketing in China. This assessment aims to promote the rational use of drugs in the clinic and provide a reference basis for the selection of drugs by medical institutions in China.\nDepending on the Rapid Guidelines for Drug Evaluation and Selection in Chinese Medical Institutions (the Second Edition), we evaluated the pharmacological properties, efficacy, safety, economy, and other attributes of interleukin inhibitors by assigning scores.\nThe rankings of composite scores, from highest to lowest, were as follows: ixekizumab with 68.8 points, secukinumab with 65.47 points, ustekinumab with 65.41 points, tildrakizumab with 62.6 points, and guselkumab with 61.64 points, taking into account the results from the 5 dimensions.\nUntil the guideline recommendations, the National Essential Drug List, clinical studies, and many other dimensions of this assessment are updated, ixekizumab, secukinumab, and ustekinumab, which have the top 3 scores, can be used as a priority recommendation for Chinese medical institutions to select interleukin inhibitors and optimise the use of the drug catalog based on the scoring results of this assessment.",
  "pub_date": "2025-11-05",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Key Specialty of Clinical Pharmacy, The First Affiliated Hospital of Guangdong Pharmaceutical University, Guangzhou, People's Republic of China.",
    "Key Specialty of Clinical Pharmacy, The First Affiliated Hospital of Guangdong Pharmaceutical University, Guangzhou, People's Republic of China.",
    "Key Specialty of Clinical Pharmacy, The First Affiliated Hospital of Guangdong Pharmaceutical University, Guangzhou, People's Republic of China.",
    "Key Specialty of Clinical Pharmacy, The First Affiliated Hospital of Guangdong Pharmaceutical University, Guangzhou, People's Republic of China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41210577/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}