{
  "pmid": "41218378",
  "title": "Highlights of the Brazilian Society of Dermatology's Brazilian Consensus on Psoriasis.",
  "abstract": "The 2024 Brazilian Consensus on Psoriasis and Treatment Algorithm of the Brazilian Society of Dermatology (SBD, Sociedade Brasileira de Dermatologia) comes four years after the release of the last Consensus, published in 2020. This new consensus now includes 43 chapters and has the participation of 85 professionals from across Brazil, including dermatologists and rheumatologists working in university hospitals, research centers, and public and private healthcare systems. The concept of Cumulative Life Course Impairment (CLCI), the inclusion of new biologics approved in Brazil after 2020, the update on psoriasis treatment in specific situations (such as pregnancy and surgery), and the discussion on \"Response Predictors\" are examples of updates addressed in this Consensus. The updated treatment algorithm used experts' responses through the Delphi method and, among other modifications, removed acitretin from the plaque psoriasis treatment sequence, defined treatment lines for choosing immunobiologicals in both adult and pediatric populations, and included spesolimab and cyclosporine as first-line treatments for generalized pustular psoriasis. Finally, the new Consensus addresses the place of small molecule inhibitors in the algorithm and discusses future treatment options for plaque psoriasis.",
  "pub_date": "2025-11-10",
  "publication_types": [
    "Consensus Statement",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Hospital das Clínicas, Universidade de São Paulo, São Paulo, SP, Brazil.",
    "Hospital Moinhos de Vento, Porto Alegre, RS, Brazil.",
    "Dermatology Clinic, Santa Casa de Misericórdia, São Paulo, SP, Brazil.",
    "Instituto Bahiano de Imunoterapia, Salvador, BA, Brazil. Electronic address: gleison.duarte@clinicaibis.com.br."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41218378/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}