{
  "pmid": "41236247",
  "title": "Tildrakizumab as a Potential Option for Early Psoriatic Arthritis in Patients with Metabolic Comorbidities and Psoriasis: a Case Series.",
  "abstract": "Psoriasis is a chronic relapsing inflammatory disease. and approximately 20% of psoriasis patients also develop psoriatic arthritis (PsA).. Interleukin 23 (IL-23) plays a crucial role in maintaining the T-helper (Th) 17 cell population derived from naïve Th1 cells as well as in sustaining inflammation at the enthesis and joints, acting as a pathogenic effector in PsA. Among anti-IL-23 monoclonal antibodies, ustekinumab, guselkumab, and risankizumab are approved in Europe for both psoriasis and PsA for psoriasis and PsA treatment. Tildrakizumab, another IL-23p19 inhibitor, is currently approved only for plaque psoriasis but has shown favorable safety in patients with metabolic comorbidities and potential efficacy in PsA.\nTo retrospectively assess the efficacy of tildrakizumab on psoriatic arthritis manifestations in patients treated according to real-world clinical practice.\nWe conducted a retrospective analysis of eight patients affected by psoriasis, early PsA, and metabolic comorbidities, treated with tildrakizumab 100 mg every 12 weeks after induction. Descriptive and inferential statistical analyses were performed. Efficacy and safety were evaluated using standard clinimetric indices over a 28-week follow-up period.\nAfter 28 weeks, a significant mean reduction was observed in Psoriasis Area and Severity Index (-81.3%, P<0.001), Pain Visual Analogue Scale (-85%, P<0.002), Nail Psoriasis Severity Index (-78%, P<0.002), Dermatology Life Quality Index (-86%, P<0.001), Physician Global Assessment (-73%, P<0.0003), and Disease Activity Index for PsA (-82%, P<0.000023). No adverse events were reported.\nTildrakizumab confirmed its efficacy in reducing signs and symptoms of early PsA, with high safety profile in our psoriasis patients also affected by multiple metabolic comorbidities.",
  "pub_date": "2025-10-01",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "Unit of Virology, Department of Experimental Medicine, University of Rome Tor Vergata, Rome, Italy.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "San Gallicano dermatological Institute (IFO-IRCCS), Clinical Dermatology Unit, Rome.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome.",
    "Unit of Dermatology, Department of Systems Medicine, University of Rome Tor Vergata, Rome."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41236247/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}