{
  "pmid": "41248770",
  "title": "Bimekizumab demonstrated a favorable safety profile and high levels of efficacy with up to 2 years of treatment in patients with moderate to severe hidradenitis suppurativa: Pooled results from two phase 3 randomized, controlled trials and their open-label extension.",
  "abstract": "Hidradenitis suppurativa is a chronic inflammatory disease, requiring treatment with durable efficacy and tolerability.\nTo report the safety and efficacy of bimekizumab up to 2 years.\nData from the BE HEARD I&II phase 3 trials and their open-label extension, BE HEARD Extension, were pooled to assess the safety and efficacy of bimekizumab in patients with moderate to severe hidradenitis suppurativa up to 2 years. For safety, exposure-adjusted incidence rates of treatment-emergent adverse events per 100 patient-years (TEAEs/100 PY) were evaluated. For efficacy, lesional-/skin pain-/health-related quality of life (HRQoL) outcomes were assessed.\nFive hundred fifty-six patients entered the open-label extension; 446 received bimekizumab to Year 2. TEAEs did not increase with longer bimekizumab exposure (Year 1: 261.6/100 PY; Year 2: 235.7/100 PY). In Year 2, the most common TEAEs were hidradenitis (26.6/100 PY), coronavirus infection (23.1/100 PY), and oral candidiasis (12.5/100 PY). Most patients achieved HiSCR50/75/90/100 at Year 2 (85.4%/77.1%/57.6%/44.2%). Improvements in skin pain and HRQoL achieved at Year 1 were sustained at Year 2.\nPatient inclusion criteria limit real-world generalizability.\nBimekizumab was well-tolerated up to 2 years; no new safety signals were identified with longer exposure. Bimekizumab provided deep, durable improvements in clinical and HRQoL outcomes.",
  "pub_date": "2025-11-15",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, University of North Carolina School of Medicine, Chapel Hill, North Carolina; European Hidradenitis Suppurativa Foundation (EHSF) e.V., Dessau, Germany. Electronic address: christopher_sayed@med.unc.edu.",
    "European Hidradenitis Suppurativa Foundation (EHSF) e.V., Dessau, Germany; St Vincent's University Hospital, Elm Park and the Charles Institute, University College Dublin, Dublin, Republic of Ireland.",
    "Department of Dermatology, Northwell, New Hyde Park, New York.",
    "Department of Dermatology, University of California, San Francisco, California.",
    "Department of Dermatology, Beth Israel Deaconess Medical Center and Harvard Medical School, Boston, Massachusetts.",
    "European Hidradenitis Suppurativa Foundation (EHSF) e.V., Dessau, Germany; Departments of Dermatology, Venereology, Allergology and Immunology, Staedtisches Klinikum Dessau, Brandenburg Medical School Theodor Fontane and Faculty of Health Sciences Brandenburg, Dessau, Germany.",
    "European Hidradenitis Suppurativa Foundation (EHSF) e.V., Dessau, Germany; Department of Dermatology, Herlev-Gentofte Hospital, University Hospital, Herlev, Denmark; Department of Clinical Medicine, Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark.",
    "Psoriasis Research and Treatment Center, Clinic of Dermatology, Venereology, and Allergology, Charité-Universitätsmedizin Berlin, Corporate Member of Freie Universität Berlin and Humboldt-Universität zu Berlin, Berlin, Germany.",
    "European Hidradenitis Suppurativa Foundation (EHSF) e.V., Dessau, Germany; Department of Dermatology & Academic Wound Healing, Division of Infection and Immunity, Cardiff University, Cardiff, UK.",
    "Department of Geriatric and Environmental Dermatology, Nagoya City University Graduate School of Medical Sciences, Nagoya, Japan.",
    "UCB, Braine-l'Alleud, Belgium.",
    "UCB, Morrisville, North Carolina.",
    "UCB, Morrisville, North Carolina.",
    "UCB, Slough, UK.",
    "UCB, Colombes, France.",
    "Vedim/UCB, Warsaw, Poland.",
    "Department of Dermatology, Venereology, and Allergology, St. Josef-Hospital, Ruhr-University Bochum, Bochum, Germany; Department of Dermatology, ICH - International Center for Hidradenitis Suppurativa/Acne Inversa, Ruhr-University Bochum, Bochum, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41248770/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}