{
  "pmid": "41260526",
  "title": "Joint position statement from the National Psoriasis Foundation Medical Board and the International Psoriasis Council on routine testing for latent tuberculosis infection prior to and during treatment of psoriasis patients with interleukin 17 or interleukin 23 inhibitors.",
  "abstract": "Although testing for latent tuberculosis (TB) infection has been standard practice for psoriasis patients being treated with interleukin (IL) 17 or IL-23 inhibitors, evidence for this practice is weak.\nTo review evidence on safety of IL-17 and IL-23 inhibitors in the setting of latent TB infection and to provide a new Joint Position Statement on this topic.\nExperts from the National Psoriasis Foundation and the International Psoriasis Council reviewed evidence regarding progression of latent TB infection to active disease in psoriasis patients receiving IL-17 or IL-23 blockers. A Joint Position Statement was formulated and approved to provide updated guidance to clinicians.\n87.5% of the members from the National Psoriasis Foundation Medical Board and International Psoriasis Council approved a new Joint Position Statement regarding psoriasis patients being treated with IL-17 or IL-23 inhibitors, stating that testing for latent TB infection is not required.\nThis position statement allows for exceptions where continued testing for late nt TB infection could be considered, including for patients on concomitant immunosuppressive therapy and for those living in TB endemic areas.\nPsoriasis experts reached consensus that routine testing for latent TB infection is not required in psoriasis patients being treated with IL-17 or IL-23 inhibitors.",
  "pub_date": "2025-11-17",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Blauvelt Consulting, LLC, Annapolis, Maryland. Electronic address: blauveltconsults@gmail.com.",
    "Department of Dermatology, Yale University School of Medicine, New Haven, Connecticut.",
    "National Psoriasis Foundation, Alexandria, Virginia.",
    "National Psoriasis Foundation, Alexandria, Virginia.",
    "International Psoriasis Council, Santa Rosa, California.",
    "International Psoriasis Council, Santa Rosa, California; Radboud University Nijmegen Medical Centre, Nijmegen, Netherlands.",
    "Department of Dermatology, Hospital de la Santa Creu i Sant Pau, Universitat Autònoma de Barcelona, Barcelona, Catalonia, Spain.",
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, New York.",
    "Department of Dermatology, University of São Paulo, São Paulo, Brazil.",
    "Division of Dermatology, Department of Medicine, University of California Los Angeles, Los Angeles, California.",
    "Department of Dermatology, Clinical School Johor Bahru, Hospital Sultanah Aminah Johor Bahru, Monash University, Johor Bahru, Malaysia.",
    "Center for Clinical Sciences in Dermatology, University of Pennsylvania, Philadelphia, Pennsylvania.",
    "Center for Clinical Sciences in Dermatology, University of Pennsylvania, Philadelphia, Pennsylvania.",
    "Division of Rheumatology, Department of Dermatology and Department of Medicine, University of Texas Southwestern Medical Center, Dallas, Texas.",
    "Division of Infectious Diseases, Oregon Health & Science University, Portland, Oregon.",
    "Department of Dermatology, Clinical Academic Center, ICBAS-Santo António, University of Porto, Porto, Portugal."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41260526/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}