{
  "pmid": "41269581",
  "title": "Demographic and Clinical Characteristics, Patterns of Treatment, Quality of Life, and Resource Consumption Associated with the Management of Patients with Moderate to Severe Psoriasis in Clinical Practice in Spain: The SUMMER Project.",
  "abstract": "Psoriasis is an immune-mediated chronic inflammatory skin disease with a prevalence in Spain of between 2.3% and 2.7%. One-third of patients present with moderate to severe psoriasis (Pso). This article aims to retrospectively describe the characteristics of patients with Pso, as well as severity, patterns of treatment, quality of life (QoL), and associated direct healthcare resources utilized in routine clinical practice in Spain.\nThe SUMMER project is an ambispective, non-interventional, multicenter study including adult patients with a diagnosis of Pso. In the retrospective phase, data were extracted from patients' electronic medical records. Data on disease severity scores (PASI and BSA) and impact on quality-of-life impact (DLQI) were captured by natural language recognition processors.\nOf 10,874 patients with a diagnosis of psoriasis identified from five participating sites, 2734 did not meet inclusion criteria; a total of 8140 patients were included. Mean age (SD) was 57.7 (16.1) years and 51.3% were male. Most patients had plaque psoriasis (91.5%) and lesions in visible areas (70.8%). The most common comorbidities were dyslipidemia (32%), hypertension (25.6%), and anxiety (18.5%). On the basis of thresholds of PASI (5%) and BSA (3%), psoriasis was not controlled in 17.1% and 37.2% of the patients, respectively, and 25.1% of patients were receiving biological treatments. Between 2017 and 2022, ustekinumab showed the highest persistence rate, especially when used as first-line treatment. There was a tendency to prescribe guselkumab and risankizumab most commonly as second- and third-line therapies. DLQI scores showed that Pso had a moderate or higher impact on QoL for 38.0% of patients.\nThe results show how patients with moderate-severe psoriasis are managed in routine clinical practice in Spain. Between 17% and 37% of patients with Pso are not on the appropriate therapeutic target. Almost a quarter of patients required biological treatments to control the disease.",
  "pub_date": "2025-11-21",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "University Hospital Bellvitge, L'Hospitalet de Llobregat, Carrer de la Feixa Llarga, s/n 08907, Barcelona, Spain. jnotario@bellvitgehospital.cat.",
    "General University Hospital of Valencia, Valencia, Spain.",
    "University Hospital 12 de Octubre, Madrid, Spain.",
    "Dermatology Department, Hospital Clínic of Barcelona, University of Barcelona, Barcelona, Spain.",
    "University Hospital La Fe, Valencia, Spain.",
    "Janssen Medical Affairs Spain, a Johnson and Johnson Company, Madrid, Spain.",
    "Janssen Medical Affairs Spain, a Johnson and Johnson Company, Madrid, Spain.",
    "University Hospital Infanta Leonor, Madrid, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41269581/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}