{
  "pmid": "41272364",
  "title": "Dupilumab Reduces Pruritus in Clinically Distinct Dermatologic Diseases: Data from Clinical Trials on Atopic Dermatitis, Prurigo Nodularis, and Chronic Spontaneous Urticaria.",
  "abstract": "Atopic dermatitis (AD), prurigo nodularis (PN), and chronic spontaneous urticaria (CSU) are chronic inflammatory skin diseases varying in clinical presentation but sharing the common and burdensome symptom of itch. Here, we investigate the efficacy of dupilumab in reducing pruritus in individuals with AD, PN, and CSU.\nLIBERTY-AD CHRONOS, LIBERTY-PN PRIME/PRIME2, and LIBERTY-CSU CUPID Study A were randomized, double-blind, placebo-controlled, phase III trials of dupilumab for AD, PN, and CSU, respectively. The itch-related study endpoints included the weekly average of daily Peak Pruritus Numeric Rating Scale (PP-NRS) for AD, weekly average of Worst Itch Numeric Rating Scale (WI-NRS) for PN, and total Itch Severity Score over 7 days (ISS7) for CSU. The efficacy endpoints included the proportion of patients who achieved a clinically meaningful improvement in PP-NRS (≥ 4-points), WI-NRS (≥ 4-points), or ISS7 (≥ 5-points); the percentage change in PP-NRS, WI-NRS, or ISS7; and the proportion of patients who achieved ≥ 50% reduction in PP-NRS, WI-NRS, or ISS7. Safety endpoints included treatment-emergent adverse events and severe adverse events.\nIn each trial, patients in both treatment groups demonstrated a severe pruritus burden at baseline on the respective itch scales (dupilumab versus placebo [Q1-Q3]; PP-NRS: 7.7 [6.6-8.5] versus 7.6 [6.3-8.6]; WI-NRS: 8.7 [7.9-9.3] versus 8.4 [7.9-9.1]; ISS7: 16.0 [14.0-20.0] versus 15.5 [13.0-20.0]). Dupilumab recipients were significantly more likely to achieve clinically meaningful improvements in PP-NRS (P < 0.0001), WI-NRS (P < 0.0001), and ISS7 (P = 0.0014) than placebo recipients. The percentage change from baseline was also significantly greater in dupilumab-treated patients than placebo recipients in all three trials (PP-NRS: P < 0.0001; WI-NRS: P < 0.0001; ISS7: P = 0.0009). Similarly, significantly more dupilumab versus placebo recipients achieved ≥ 50% reduction in relevant itch outcome scales in AD (70% versus 38.8%; P < 0.0001), PN (60.1% versus 20.9%; P < 0.0001), and CSU (68.6% versus 42.7%; P = 0.0213). Overall, safety was generally consistent with the known dupilumab safety profile.\nBaseline median pruritus in AD, PN, or CSU reached the upper third of the respective itch scales, demonstrating severe pruritus burden. In all three disease states, dupilumab treatment resulted in clinically meaningful improvement in itch.\nClinicalTrials.gov: NCT02260986, NCT04183335/NCT04202679, NCT04180488.",
  "pub_date": "2025-11-22",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Dr. Phillip Frost Department of Dermatology and Cutaneous Surgery and Miami Itch Center, University of Miami, Miami, FL, USA.",
    "Kimberly and Eric J. Waldman Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA.",
    "UCSF Psoriasis and Skin Treatment Center, San Francisco, CA, USA.",
    "Regeneron Pharmaceuticals Inc., Tarrytown, NY, USA.",
    "Sanofi, Reading, UK.",
    "Regeneron Pharmaceuticals Inc., Tarrytown, NY, USA.",
    "Sanofi, Cambridge, MA, USA.",
    "Sanofi, Cambridge, MA, USA.",
    "Regeneron Pharmaceuticals Inc., Tarrytown, NY, USA. sonya.cyr@regeneron.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41272364/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}