{
  "pmid": "41273665",
  "title": "Is Cumulative Life Course Impairment Considered in Psoriasis Management? A Multinational Survey of People with Psoriasis and Healthcare Professionals.",
  "abstract": "Delays remain in patients receiving effective treatment strategies that have potential to clear their skin of psoriasis, improve their quality of life (QoL) and change the psoriatic disease course, which, if uncontrolled, can irreversibly alter an individual's life course (i.e. cumulative life course impairment [CLCI]). This study explored current international awareness and consideration of the potential impact of psoriasis over the life course within clinical assessments and decisions about its management.\nCross-sectional surveys collated insights from people with psoriasis and healthcare professionals (HCPs) treating psoriasis (dermatologists and primary care physicians [PCPs]) across 29 countries.\nData were collected from 487 people with psoriasis, 574 dermatologists and 618 PCPs. Despite people with psoriasis highlighting a range of daily activities that are 'very frequently' or 'always' affected by their psoriasis, 37% were never or rarely asked by their HCPs how the disease affects their life. Fewer than half of people with psoriasis had a high understanding of the potential future impact of psoriasis (or CLCI-contributing factors), and 44% were unaware that clear/almost clear skin is now a realistic treatment target. Almost half of HCPs considered psoriasis to be of early onset when it presented at ≤ 15 years of age. Despite HCP awareness of the impact of psoriasis on QoL, many of the contributing factors to CLCI were not addressed routinely in clinical practice nor considered when deciding on treatment; 40% of dermatologists set treatment goals (such as clear skin/almost clear skin/target Dermatology Life Quality Index [DLQI]) sometimes, less frequently, or not at all.\nMisalignment exists in the experience of people living with psoriasis versus its assessment in clinical practice. Support is needed for assessment and monitoring of elements that may contribute to CLCI in clinical practice worldwide, to guide early psoriasis treatment decision-making to mitigate the risk for CLCI. Infographic available for this article. INFOGRAPHIC.",
  "pub_date": "2025-11-22",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust and Division of Musculoskeletal and Dermatological Sciences, Manchester NIHR Biomedical Research Centre, Manchester Academic Health Science Centre, University of Manchester, Manchester, UK. raymond.matthews@manchester.ac.uk.",
    "Division of Dermatology, University of California Los Angeles, Los Angeles, USA.",
    "Institute for Health Services Research in Dermatology and Nursing, University Medical Center Hamburg, Hamburg, Germany.",
    "Vincent's Hospital Melbourne, University of Melbourne, Melbourne, Australia.",
    "Servicio de Dermatología Hospital Universitari Germans Trias I Pujol (HUGiT), Universitat Autònoma de Barcelona, Badalona, Spain.",
    "University College Dublin, Dublin, Ireland.",
    "Dalhousie University and Nova Scotia Health, Halifax, Canada.",
    "Royal Free London NHS Foundation Trust, London, UK.",
    "Department of Dermatology, Medical College of Rzeszów, University, Rzeszów, Poland.",
    "Department of Dermatology, University of São Paulo, São Paulo, SP, Brazil.",
    "Clinical Epidemiology Unit, Istituto Dermopatico Dell'Immacolata IDI-IRCCS, Rome, Italy.",
    "Dermatology Centre, Northern Care Alliance NHS Foundation Trust and Division of Musculoskeletal and Dermatological Sciences, Manchester NIHR Biomedical Research Centre, Manchester Academic Health Science Centre, University of Manchester, Manchester, UK."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41273665/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}