{
  "pmid": "41280943",
  "title": "Multiple eruptive dermatofibromas occurred after receiving sequential treatment with secukinumab, guselkumab, and adalimumab: case report.",
  "abstract": "Multiple eruptive dermatofibromas (MEDFs) are characterized by the rapid development of multiple dermatofibromas within a short period, often associated with underlying immune dysregulation or immunosuppressive therapies. We report a rare case of MEDFs in a young male with refractory psoriasis, who developed multiple cutaneous tumors following sequential treatment with biologic agents: secukinumab, guselkumab, and adalimumab. Despite achieving partial control of psoriasis, the patient experienced the onset of widespread, asymptomatic dermatofibromas, leading to the cessation of biologic therapy. Clinical examination, dermoscopic evaluation, and histopathological analysis confirmed the diagnosis of MEDFs. The Naranjo algorithm and WHO-UMC scale suggested a probable adverse drug reaction as the causative factor. The pathogenesis may involve a Th2-polarizing immune shift and persistent activation of antigen-presenting cells, possibly triggered by the cumulative effects of the biologics used. However, as a single-case report, our findings require validation through larger cohort studies to establish causality and incidence. This case highlights the potential for MEDFs as a novel adverse effect of biologic therapies and underscores the need for awareness and monitoring of such reactions in clinical practice.",
  "pub_date": "2025-11-07",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Institute of Dermatology and Venereal Diseases, Affiliated Hospital of Guangdong Medical University, Zhanjiang, Guangdong, China.",
    "Department of Dermatology and Venereal Diseases, Affiliated Hospital of Guangdong Medical University, Zhanjiang, Guangdong, China.",
    "Institute of Dermatology and Venereal Diseases, Affiliated Hospital of Guangdong Medical University, Zhanjiang, Guangdong, China.",
    "Department of Dermatology and Venereal Diseases, Affiliated Hospital of Guangdong Medical University, Zhanjiang, Guangdong, China.",
    "Institute of Dermatology and Venereal Diseases, Affiliated Hospital of Guangdong Medical University, Zhanjiang, Guangdong, China.",
    "Department of Dermatology and Venereal Diseases, Affiliated Hospital of Guangdong Medical University, Zhanjiang, Guangdong, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41280943/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}