{
  "pmid": "41285502",
  "title": "Current landscape of immune-mediated inflammatory rheumatic diseases in Brazil's public and private systems: retrospective cohort study.",
  "abstract": "This study aimed to describe the epidemiology, outcomes and costs of four immune-mediated inflammatory rheumatic diseases (IMIRDs)-systemic lupus erythematosus (SLE), rheumatoid arthritis (RA), psoriatic arthritis (PsA) and ankylosing spondylitis (AS)-in Brazil's public and private healthcare systems from 2018 to 2022.\nRetrospective observational study.\nThe study was conducted across hospital and outpatient levels of care in Brazil, based on nationwide data representing the public (Department of Informatics of the Unified Health System-DATASUS) and private (National Supplementary Health Agency-ANS) healthcare sectors.\nThe study analysed data from four distinct systems: 609 427 patients from the public Outpatient Information System (SIA), 32 119 patients from the public Hospital Information System (SIH), 19 083 deaths from the public Mortality Information System (SIM) and 11 846 hospitalisations from the private healthcare system (ANS).\nRA had the highest incidence, ranging from 19.9 to 24.9 per 100 000, while SLE remained stable (6.3-6.7 per 100 000). Prevalence increased for all diseases: RA rose from 95.7 to 136.8, SLE from 23.4 to 38.9, AS from 15.0 to 23.6 and PsA from 10.8 to 17.4 per 100 000. SLE had the highest hospitalisation (7.2%) and lethality rates (8.7%), along with the highest average outpatient cost (US$440.9 per patient). In the private system, RA and SLE accounted for the most hospitalisations (36.3% each). SLE had the highest proportion of emergency hospitalisations (70.5%), while PsA had the highest proportion of elective hospitalisations (61.8%).\nRA had the highest prevalence and incidence rates among the studied IMIRDs, while SLE was associated with the highest lethality, outpatient costs and emergency hospitalisations. The rising prevalence of these diseases highlights their growing burden on Brazil's healthcare systems.\nNCT06698900.",
  "pub_date": "2025-11-23",
  "publication_types": [
    "Journal Article",
    "Observational Study"
  ],
  "affiliations": [
    "Department of Internal Medicine, Universidade Federal do Rio Grande do Sul, Porto Alegre, Brazil.",
    "Rheumatology, Universidade de Sao Paulo Faculdade de Medicina, Sao Paulo, Brazil.",
    "Universidade Federal de Pernambuco, Recife, Brazil.",
    "AstraZeneca, São Paulo, Brazil.",
    "ICON Plc Brazil, São Paulo, Brazil vanessa.assao@astrazeneca.com.",
    "Oracle Life Sciences, São Paulo, Brazil.",
    "Oracle Life Sciences, São Paulo, Brazil.",
    "Department of Medicine, Universidade Federal de São Paulo, São Paulo, Brazil."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41285502/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}