{
  "pmid": "41314226",
  "title": "Efficacy and safety of rocatinlimab for the treatment of moderate-to-severe atopic dermatitis in ROCKET-IGNITE and ROCKET-HORIZON: two global, double-blind, placebo-controlled, randomised phase 3 clinical trials.",
  "abstract": "Rocatinlimab is a T cell rebalancing therapy that inhibits and reduces the number of pathogenic T cells by targeting the OX40 receptor expressed on the surface of activated T cells. Two global phase 3 studies were performed to assess the efficacy and safety of rocatinlimab for the treatment of moderate-to-severe atopic dermatitis in adults.\nROCKET-IGNITE (IGNITE) and ROCKET-HORIZON (HORIZON) were 24-week randomised, double-blind, placebo-controlled phase 3 trials conducted in 19 countries each. Eligible patients were 18 years and older with confirmed atopic dermatitis (American Academy of Dermatology Consensus Criteria) diagnosed 1 year or longer before study entry with moderate-to-severe disease activity, defined by an Eczema Area and Severity Index (EASI) score of 16 and over, validated Investigator's Global Assessment for Atopic Dermatitis (vIGA-AD) score of 3 (moderate) or 4 (severe), and affected body surface area of 10% and above. In IGNITE, patients were randomly allocated in a 3:2:2 ratio to receive subcutaneous 300 mg rocatinlimab, 150 mg rocatinlimab, or placebo; in HORIZON, patients were randomised 3:1 to receive subcutaneous 300 mg rocatinlimab or placebo. Randomisation was stratified by baseline disease severity (vIGA-AD score of 3 vs 4) and geographical region (Japan vs non-Japan Asian countries vs rest of world). Across both trials, 24-week treatment was administered at weeks 0, 2, and 4 and then every 4 weeks thereafter with the last dose at week 20. The coprimary endpoints for both trials were EASI-75 response (≥75% improvement in EASI score from baseline) at week 24 and vIGA-AD score of 0 or 1 (defined as a score of 0 [clear skin] or 1 [almost clear skin], representing a ≥2-point improvement from baseline) at week 24. Rescue therapy use, including topical therapy, phototherapy, and systemic therapy, was permitted from day 1; all patients who received rescue therapy were considered non-responders for all visits after the first use of rescue therapy but could generally continue study treatment unless prohibited per protocol. Efficacy analyses were conducted in all randomised patients; safety analyses were conducted in all patients who received one or more dose of study treatment, with patients grouped according to actual treatment received. The trials were registered at ClinicalTrials.gov: ROCKET-IGNITE (NCT05398445) and ROCKET-HORIZON (NCT05651711).\nBetween May 31, 2022, and June 12, 2024, 769 patients were randomised in IGNITE (two patients were enrolled under an earlier protocol before study re-design and excluded from the analysis; after the protocol update, 328 were included in the 300 mg rocatinlimab group; 217 in the 150 mg rocatinlimab group; and 222 in the placebo group) and between Dec 14, 2022, and Dec 12, 2023, 726 patients were randomised in HORIZON (543 in 300 mg rocatinlimab and 183 in placebo). Both trials met their coprimary endpoints. Rocatinlimab treatment resulted in statistically significant improvements in EASI-75 response in comparison with placebo at week 24 in IGNITE (138 [42%] of 326 patients on 300 mg rocatinlimab; 78 [36%] of 215 on 150 mg rocatinlimab; and 28 [13%] of 219 on placebo; percentage difference vs placebo: 300 mg rocatinlimab 29·5% [95% CI 22·3-36·1], p<0·001 and 150 mg rocatinlimab 23·4% [15·4-30·9], p<0·001) and HORIZON (rocatinlimab, 178 [33%] of 543 vs placebo, 25 [14%] of 183; percentage difference 19·1% [95% CI 12·4-25·2], p<0·001). Statistically significant improvements with rocatinlimab treatment in comparison with placebo were also observed at week 24 for vIGA-AD score of 0 or 1 response in IGNITE (77 [24%] of 326 patients on 300 mg rocatinlimab; 41 [19%] of 215 patients on 150 mg rocatinlimab; and 19 [9%] of 219 patients on placebo; percentage difference vs placebo 14·9% [95% CI 8·8-20·6], p<0·001 for 300 mg rocatinlimab and 10·3% [3·8-16·6], p=0·002 for 150 mg rocatinlimab) and HORIZON (105 [19%] of 543 for 300 mg rocatinlimab vs 12 [7%] of 183 for placebo; percentage difference 12·8% [95% CI 7·6-17·3], p<0·001). The incidences of treatment-emergent adverse events were generally similar across rocatinlimab and placebo treatment groups in IGNITE and HORIZON. The most frequently reported adverse events in patients receiving rocatinlimab (defined as occurring in ≥4% of patients in any rocatinlimab treatment group and at a rate ≥2 times that of placebo) included pyrexia (105 [12%] of 870 for 300 mg rocatinlimab and 26 [12%] of 214 for 150 mg rocatinlimab), chills (48 [6%] of 870 and five [2%] of 214 for the 300 mg and 150 mg doses, respectively), and aphthous ulcers (38 [4%] of 870 and six [3%] of 214, respectively). Most events of pyrexia and chills were considered injection-related reactions; events were generally mild or moderate in severity and primarily occurred after the first dose. Serious adverse events were reported in 2% to 5% of patients in the rocatinlimab groups and 4% to 6% of patients in the placebo groups. No deaths were reported.\nRocatinlimab treatment resulted in statistically significant and clinically meaningful improvements across clinical endpoints, including the coprimary endpoints of EASI-75 response and vIGA-AD score of 0 or 1, in comparison with placebo and had a clinically acceptable safety profile in adult patients with moderate-to-severe atopic dermatitis.\nAmgen and Kyowa Kirin.",
  "pub_date": "2025-11-25",
  "publication_types": [
    "Clinical Trial, Phase III",
    "Journal Article",
    "Multicenter Study",
    "Randomized Controlled Trial"
  ],
  "affiliations": [
    "Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, NY, USA. Electronic address: emma.guttman@mountsinai.org.",
    "Department of Dermatology, Graduate School of Medicine, Kyoto University, Kyoto, Japan; Singapore Immunology Network (SIgN) and Institute of Medical Biology (IMB), Agency for Science, Technology, and Research (A*STAR), Biopolis, Singapore.",
    "Division of Allergy and Immunology, Department of Dermatology, Venerology and Allergy, Charité Universitätsmedizin, Berlin, Germany.",
    "Department of Dermatology, Hospital Aleman, Buenos Aires, Argentina.",
    "Department of Dermatology and Skin Science, The University of British Columbia, Vancouver, BC, Canada; Probity Medical Research, Surrey, BC, Canada.",
    "Department of Medicine, Chicago Medical School, Rosalind Franklin University of Medicine and Science, North Chicago, IL, USA; Center for Medical Dermatology and Immunology Research, Chicago, IL, USA.",
    "Department of Internal Medicine, Division of Rheumatology, Allergy & Immunology, University of Cincinnati and Bernstein Clinical Research Center, Cincinnati, OH, USA.",
    "Dermatology Department, Alfred Health and School of Translational Medicine, Monash University, Melbourne, VIC, Australia.",
    "Oregon Medical Research Center, Broadway Medical Clinic and Oregon Health & Science University, Portland, OR, USA.",
    "Department of Dermatology and Venereology, University Hospital of Münster, Münster, Germany.",
    "Department of Dermatology and Venereology, La Paz University Hospital, Madrid, Spain.",
    "Department of Dermatology, Henry Ford Health, Detroit, MI, and West Bloomfield, MI, USA.",
    "Division of Dermatology, David Geffen UCLA School of Medicine, Los Angeles, CA, USA.",
    "St John's Institute of Dermatology, Guy's and St Thomas' NHS Foundation Trust and King's College London, London, UK.",
    "Kyowa Kirin International, Marlow, UK.",
    "Kyowa Kirin, Princeton, NJ, USA.",
    "Amgen, Thousand Oaks, CA, USA.",
    "Amgen, Thousand Oaks, CA, USA.",
    "Amgen, Thousand Oaks, CA, USA.",
    "Amgen, Thousand Oaks, CA, USA.",
    "Amgen, Thousand Oaks, CA, USA.",
    "Innovaderm, Montreal, QC, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41314226/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}