{
  "pmid": "41312323",
  "title": "Epidemiology, clinical characteristics, flares and mortality of generalized pustular psoriasis: a nationwide register study in Finland.",
  "abstract": "Generalized pustular psoriasis (GPP) is a chronic and potentially life-threatening inflammatory disease characterized by recurrent, sudden flares often accompanied by systemic symptoms. With the introduction of new, targeted therapies for GPP there is an increased need to better understand patient characteristics to improve disease management.\nTo assess the epidemiology of GPP, and compare clinical characteristics, treatments and overall survival between GPP and population-based controls and control participants with psoriasis vulgaris. Furthermore, flare occurrence and risk factors for flares were also assessed.\nAll Finnish patients with ≥1 GPP diagnosis (International Classification of Diseases, Tenth Revision: L40.1) in secondary healthcare between 1996 and 2021 and age- and sex-matched control groups were identified. Data on diagnoses, medications and deaths were collected from national registers. Incidence and prevalence were assessed using different case criteria. The primary analysis group included patients with ≥2 GPP diagnoses at a dermatology clinic in specialty care.\nGPP period prevalence decreased from 9.9 to 4.7 and the incidence rate from 4.2 to 2.1 per 100 000 when using stricter case criteria. Psoriasis (73%) and hypertension (49%) were the most common comorbidities among patients with GPP, and topical corticosteroids were the most used medication (92%; P < 0.05 vs. control groups). Overall survival was lower in GPP compared with both control groups (P < 0.001). In total, 43% of the patients experienced a flare during follow-up, of which one-third (33%) had a flare at the time of first GPP diagnosis. Systemic corticosteroid use [hazard ratio (HR) 1.41; 95% confidence interval (CI) 1.10-1.81; P = 0.007] was associated with a higher risk of GPP flares and flares were associated with an increased risk of death (HR 1.7; 95% CI 1.08-2.60; P < 0.05).\nThe epidemiology of GPP in Finland was found to be comparable to previously published estimates and associated with a high disease burden and shorter overall survival. Flares occurred frequently during follow-up and are associated with an increased risk of death. Standardized guidelines are crucial to improve the timely diagnosis and management of the disease.",
  "pub_date": "2025-10-09",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "MedEngine Oy, Helsinki, Finland.",
    "Boehringer Ingelheim B.V., Amsterdam, The Netherlands.",
    "MedEngine Oy, Helsinki, Finland.",
    "MedEngine Oy, Helsinki, Finland.",
    "Boehringer Ingelheim, Copenhagen, Denmark.",
    "Boehringer Ingelheim Ky, Helsinki, Finland.",
    "Boehringer Ingelheim Ky, Helsinki, Finland.",
    "Tampere University Hospital and Faculty of Medicine and Health Technology, Tampere University, Tampere, Finland.",
    "Skin and Allergy Hospital, Helsinki University Hospital, Helsinki, Finland.",
    "Research Unit of Clinical Medicine, University of Oulu and Medical Research Center, Oulu University Hospital, Oulu, Finland."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41312323/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}