{
  "pmid": "41335331",
  "title": "Efficacy of Lebrikizumab on Pruritus: A Narrative Review.",
  "abstract": "Atopic dermatitis (AD) is a chronic, relapsing, and heterogeneous skin disease characterized by eczematous morphology and intense pruritus, significantly impacting the quality of life of affected individuals. A primary cytokine implicated in AD is interleukin-13 (IL-13), which directly drives pruritus skin sensitization, contributing to pruritus. Lebrikizumab, a high-affinity IgG4 monoclonal antibody, targets IL-13 to block inflammatory and neuronal sensitization processes. This review aims to provide a comprehensive summary of lebrikizumab's efficacy in managing pruritus in patients with AD, focusing on data from the ADvocate 1&2, ADjoin, ADmirable, and ADhere studies. Clinical trials have demonstrated rapid and sustained improvements in pruritus outcomes, with significant relief observed within days of treatment initiation and maintained over long periods. Lebrikizumab has shown efficacy across diverse populations, including adolescents, the elderly, and skin of color. By effectively targeting IL-13, lebrikizumab offers a valuable treatment option for moderate-to-severe AD, providing significant and sustained pruritus relief, skin clearance, and quality of life improvements.",
  "pub_date": "2025-12-03",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "University of Miami Miller School of Medicine, Miami, USA. gyosipovitch@med.miami.edu.",
    "Kimberly and Eric J. Waldman Department of Dermatology, Icahn School of Medicine at Mount Sinai, New York, USA.",
    "University Hospital Münster, Münster, Germany.",
    "Department of Dermatology, University of California San Francisco, San Francisco, USA.",
    "Probity Medical Research, Dermatology Research Institute, Skin Health and Wellness Centre, and University of Calgary, Calgary, Canada.",
    "Department of Dermatology, Kyoto University Graduate School of Medicine, Kyoto, Japan.",
    "Eli Lilly and Company, Indianapolis, USA.",
    "Eli Lilly and Company, Indianapolis, USA.",
    "Eli Lilly and Company, Indianapolis, USA.",
    "Eli Lilly and Company, Indianapolis, USA.",
    "Department of Dermatology, Johns Hopkins University School of Medicine and Bloomberg School of Public Health, Johns Hopkins University, Baltimore, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41335331/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}