{
  "pmid": "41357183",
  "title": "The complex interplay between psoriasis and depression: from molecular mechanisms to holistic treatment approaches.",
  "abstract": "Psoriasis is an inflammatory disease driven by immune dysregulation. Numerous epidemiological studies have confirmed a significant association between psoriasis and mental health disorders, particularly depression. Recent research has increasingly underscored the common pathogenic mechanisms between psoriasis and depression. The release of factors such as TNF, IL-6, and IL-8 not only directly drives abnormal proliferation of skin keratinocytes and immune infiltration but also disrupts the blood-brain barrier, inducing neuroinflammation. Hypothalamic-pituitary-adrenal (HPA) axis dysfunction leads to inflammation amplification. Additionally, microbiota dysbiosis-such as a reduced abundance of Actinobacteria and Firmicutes-decreases the production of short-chain fatty acids and increases the absorption of lipopolysaccharides into the bloodstream via the \"gut-brain-skin axis,\" thereby exacerbating systemic and neuroinflammatory conditions. Based on this understanding, clinical practice demands an integrated \"biological-psychological-social\" approach. Biologics (e.g., adalimumab, secukinumab, and guselkumab) can simultaneously ameliorate skin lesions and depressive symptoms. When combined with psychological interventions-including cognitive behavioral therapy and mindfulness therapy-a multidisciplinary collaboration involving dermatology, rheumatology, and psychology is essential to formulate a tailored treatment plan. This review systematically outlines the core mechanisms underlying comorbidity of these two diseases, as well as multidimensional treatment strategies.",
  "pub_date": "2025-11-21",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "ShanXi Key Laboratory of Stem Cells for Immunological Dermatosis, State Key Breeding Laboratory of Stem Cells for Immunological Dermatosis, Institute of Dermatology, Taiyuan Central Hospital of Shanxi Medical University, Taiyuan, China.",
    "ShanXi Key Laboratory of Stem Cells for Immunological Dermatosis, State Key Breeding Laboratory of Stem Cells for Immunological Dermatosis, Institute of Dermatology, Taiyuan Central Hospital of Shanxi Medical University, Taiyuan, China.",
    "ShanXi Key Laboratory of Stem Cells for Immunological Dermatosis, State Key Breeding Laboratory of Stem Cells for Immunological Dermatosis, Institute of Dermatology, Taiyuan Central Hospital of Shanxi Medical University, Taiyuan, China.",
    "ShanXi Key Laboratory of Stem Cells for Immunological Dermatosis, State Key Breeding Laboratory of Stem Cells for Immunological Dermatosis, Institute of Dermatology, Taiyuan Central Hospital of Shanxi Medical University, Taiyuan, China.",
    "ShanXi Key Laboratory of Stem Cells for Immunological Dermatosis, State Key Breeding Laboratory of Stem Cells for Immunological Dermatosis, Institute of Dermatology, Taiyuan Central Hospital of Shanxi Medical University, Taiyuan, China.",
    "ShanXi Key Laboratory of Stem Cells for Immunological Dermatosis, State Key Breeding Laboratory of Stem Cells for Immunological Dermatosis, Institute of Dermatology, Taiyuan Central Hospital of Shanxi Medical University, Taiyuan, China.",
    "ShanXi Key Laboratory of Stem Cells for Immunological Dermatosis, State Key Breeding Laboratory of Stem Cells for Immunological Dermatosis, Institute of Dermatology, Taiyuan Central Hospital of Shanxi Medical University, Taiyuan, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41357183/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}