{
  "pmid": "41359216",
  "title": "A Post Hoc Analysis of Atopic Dermatitis of the Head and Neck and Other Body Regions from the Amlitelimab STREAM-AD Phase 2b Study.",
  "abstract": "Amlitelimab (SAR445229, KY1005), a nondepleting anti-OX40 ligand monoclonal antibody, reduced lesions and pruritus in phase 2a and 2b trials in adults with moderate-to-severe atopic dermatitis (AD). Here, efficacy and durability of amlitelimab across body regions were evaluated, given that unmet needs remain for treatment of head and neck AD.\nSTREAM-AD phase 2b trial data were used in this post hoc analysis. Patients were randomized 1:1:1:1:1 to receive amlitelimab subcutaneously (250 mg with 500-mg loading dose, 250 mg, 125 mg, or 62.5 mg) or placebo every 4 weeks from weeks 0 to 24 (part 1). In part 2, clinical responders (patients achieving Investigator Global Assessment 0/1 and/or ≥ 75% reduction in Eczema Area and Severity Index [EASI-75] at week 24) were re-randomized 3:1 to withdraw from amlitelimab or continue their pre-week 24 amlitelimab dose through week 52. EASI subscores and signs were evaluated for head and neck, trunk, lower extremities, and upper extremities.\nPart 1 included 390 randomized patients; 190 continued to part 2. In part 1, all EASI body region subscores were reduced with all amlitelimab doses at week 24 (P ≤ 0.01). Additionally, the four EASI signs-erythema, edema, excoriation, and lichenification-were reduced with amlitelimab vs. placebo. Greater proportions of patients achieved EASI-75 per body region with all amlitelimab doses, compared to placebo (P ≤ 0.05). At week 52, clinical responders maintained improvements in each body region achieved in part 1, regardless of treatment continuation or withdrawal.\nImprovements in AD signs and severity were observed with amlitelimab across all body regions. Notably, clinical responses were sustained following treatment withdrawal, supporting the potential for extended dosing intervals and durable off-treatment efficacy. Amlitelimab may be a treatment option for hard-to-treat head and neck AD that disproportionately impairs quality of life.\nClinicalTrials.gov Identifier NCT05131477.",
  "pub_date": "2025-12-08",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, University of Rzeszow, Rzeszow, Poland. adamandrzejreich@gmail.com.",
    "Blauvelt Consulting LLC, Annapolis, MD, USA.",
    "Department of Dermatology and Allergy, University Hospital Schleswig-Holstein, Kiel, Germany.",
    "Department of Dermatology, University of Washington, Seattle, WA, USA.",
    "North Campus, Kyoto Prefectural University of Medicine, Kyoto, Japan.",
    "University of Toronto, Markham, ON, Canada.",
    "Lynderm Research, Markham, ON, Canada.",
    "Department of Dermatology, The First Hospital of China Medical University, Shenyang, China.",
    "Sanofi, Cambridge, MA, USA.",
    "Sanofi, Paris, France.",
    "Sanofi, Cambridge, MA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41359216/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}