{
  "pmid": "41389139",
  "title": "Treatment Preferences Among Systemic Therapy-Naïve Patients with Atopic Dermatitis or Psoriasis in Germany: A Multicentre Study.",
  "abstract": "Despite the expanding range of approved systemic therapies for atopic dermatitis (AD) and psoriasis (PSO), data on patient preferences remain limited. It is largely unknown whether patients wish to initiate systemic treatment, which route of administration (oral versus subcutaneous) they prefer, or what factors drive their treatment preferences. This study evaluated the desire for systemic therapy among systemic treatment-naïve patients with AD or PSO, including disease-specific influencing factors and preferences for administration routes (subcutaneous injections vs. tablets).\nEligible patients with AD or PSO were recruited at two German university hospitals. Questionnaires collected demographic and clinical data, including disease severity, pruritus and pain intensity, quality of life (QoL) impairment, and desire for systemic therapy. Data analysis comprised Mann-Whitney U tests (between-group comparisons), and Spearman correlations (factors influencing therapy desire).\nFrom 253 recruited patients, systemic treatment-naïve patients with moderate-to-severe disease severity exclusively using topical therapies were selected (56 with AD, 63 with PSO); 77.8% of patients with PSO and 67.9% of patients with AD desired systemic therapy, mainly for superior efficacy, QoL improvement, and pruritus reduction. Administration preferences differed significantly (PSO 57.1% injections; AD 73.7% tablets; p < 0.005). The desire for systemic therapy moderately correlated with pain intensity (ρ = 0.422, p < 0.001) and QoL impairment (ρ = 0.379, p < 0.005) in AD and with male sex in PSO (ρ = 0.347, p < 0.005).\nMost topically treated patients with moderate-to-severe AD or PSO desire systemic therapy, with distinct disease-specific administration preferences.",
  "pub_date": "2025-12-13",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Pruritus Medicine Section, Department of Dermatology, and Center for Chronic Pruritus (KCP), University Hospital Münster, Von-Esmarch-Str. 58, 48149, Münster, Germany. Svenja.Royeck@ukmuenster.de.",
    "Centre for Dermatology, Allergology and Dermatosurgery, Helios University Hospital Wuppertal, University of Witten/Herdecke, Wuppertal, Germany.",
    "Centre for Skin Diseases, Department of Dermatology and Allergy, University Hospital Bonn, Bonn, Germany.",
    "Centre for Dermatology, Allergology and Dermatosurgery, Helios University Hospital Wuppertal, University of Witten/Herdecke, Wuppertal, Germany.",
    "Pruritus Medicine Section, Department of Dermatology, and Center for Chronic Pruritus (KCP), University Hospital Münster, Von-Esmarch-Str. 58, 48149, Münster, Germany.",
    "Centre for Skin Diseases, Department of Dermatology and Allergy, University Hospital Bonn, Bonn, Germany.",
    "Centre for Dermatology, Allergology and Dermatosurgery, Helios University Hospital Wuppertal, University of Witten/Herdecke, Wuppertal, Germany.",
    "Centre for Skin Diseases, Department of Dermatology and Allergy, University Hospital Bonn, Bonn, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41389139/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}