{
  "pmid": "41436138",
  "title": "Assessing internal construct validity of DAPSA and DAPSA28 in psoriatic arthritis: a European observational study using confirmatory factor analysis and additional psychometric testing.",
  "abstract": "The Disease Activity index for Psoriatic Arthritis (DAPSA) was developed to assess disease activity in patients with psoriatic arthritis (PsA). A modified version, DAPSA28, uses 28 joints instead of 66/68. This study evaluated key psychometric properties of DAPSA and DAPSA28.\nData from 1865 patients with PsA in the European Spondyloarthritis (EuroSpA) Research Collaboration Network, having DAPSA and DAPSA28 scores at baseline and follow-up, were analysed. Tests included assessment of internal construct validity by scree plots, confirmatory factor analysis (CFA) and structural equation modelling (SEM), supplemented by tests of differential item functioning (DIF) and evaluation of internal consistency reliability by Cronbach's α (CA). A subset of 625 patients was used for most analyses, except descriptive statistics, correlation matrix and CA.\nOne-dimensional CFA models for DAPSA and DAPSA28 showed acceptable model fit at baseline (root mean square error of approximation, RMSEA: 0.020, 0.034). However, model fit at 6 months follow-up was poor (RMSEA: 0.057, 0.063). SEM combining baseline and follow-up data could not identify an acceptable model fit. DIF was found for sex and country. CA indicated acceptable internal consistency (DAPSA: 0.65; DAPSA28: 0.63). Heterogeneity across countries was observed.\nOverall, the model fit was acceptable across model fit statistics, supporting internal construct validity, but some evidence of misfit at country level was disclosed. Our findings support acceptable internal consistency reliability, but DIF was found for sex and country. Based on mixed results of model fit and DIF, further investigation of these and other PsA disease activity measures is warranted.",
  "pub_date": "2025-12-23",
  "publication_types": [
    "Journal Article",
    "Observational Study"
  ],
  "affiliations": [
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark.",
    "Faculty of Health and Medical Sciences, University of Copenhagen, Copenhagen, Denmark.",
    "Department of Public Health, University of Copenhagen, Copenhagen, Denmark.",
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark.",
    "Center for treatment of Rheumatic and Musculoskeletal Diseases (REMEDY), Diakonhjemmet Hospital, Oslo, Norway.",
    "Research Unit, Sørlandet Sykehus HF, Kristiansand, Norway.",
    "Department of Rheumatology and DANBIO Aarhus University Hospital, Aarhus, Denmark.",
    "Department of Clinical Medicine, Aarhus University, Aarhus, Denmark.",
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark.",
    "Copenhagen Research Center for Biological and Precision Psychiatry, Mental Health Centre Copenhagen, Copenhagen University Hospital, Copenhagen, Denmark.",
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark.",
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark.",
    "Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark.",
    "Institute of Rheumatology, Prague, Czech Republic.",
    "Institute of Rheumatology, Prague, Czech Republic.",
    "Department of Rheumatology, First Faculty of Medicine, Charles University, Prague, Czech Republic.",
    "Rheumatology Unit, DiMePReJ, University of Bari, Bari, Italy.",
    "Department of Clinical Internal, Anesthesiological and Cardiovascular Sciences, Sapienza University of Rome, Rome, Italy.",
    "Instituto Português de Reumatologia, Lisbon, Portugal.",
    "Center for Rheumatic Diseases, University of Medicine and Pharmacy, Bucharest, Romania.",
    "Center for Rheumatic Diseases, University of Medicine and Pharmacy, Bucharest, Romania.",
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark.",
    "Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark.",
    "DANBIO Rigshospitalet, Glostrup, Denmark.",
    "Department of Rheumatology, University Hospital Zurich, University of Zurich, Zürich, Switzerland.",
    "Department of Rheumatology, Geneva University Hospitals, Geneva, Switzerland.",
    "Departments of Medicine and Rheumatology, Helsinki University Central Hospital, Helsinki, Finland.",
    "Department of Rheumatology, Division of Medicine, Turku University Central Hospital, Turku, Finland.",
    "Department of Rheumatology, Division of Medicine, Turku University Central Hospital, Turku, Finland.",
    "Department of Internal Medicine, University of Turku, Turku, Finland.",
    "Department of Rheumatology, East Tallinn Central Hospital, Tallinn, Estonia.",
    "Centre for Rheumatology Research, Landspitali University Hospital, Reykjavík, Iceland.",
    "Faculty of Medicine, University of Iceland, Reykjavík, Iceland.",
    "University of Iceland, Faculty of Medicine, Reykjavík, Iceland.",
    "Landspitali University Hospital, Reykjavík, Iceland.",
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark.",
    "Department of Clinical Medicine, University of Copenhagen, Copenhagen, Denmark.",
    "Copenhagen Center for Arthritis Research, Center for Rheumatology and Spine Diseases, Rigshospitalet, Glostrup, Denmark lykke.midtboell.oernbjerg@regionh.dk."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41436138/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}