{
  "pmid": "41466856",
  "title": "Inflammatory Skin Disease in Latin America: Treatment Challenges and Opportunities.",
  "abstract": "Inflammatory skin diseases, including psoriasis (PsO), atopic dermatitis (AD), hidradenitis suppurativa (HS), and alopecia areata (AA), are chronic immune-mediated disorders that substantially impair the quality of life and impose a growing socioeconomic burden. In Latin America (LA), these conditions unfold in the context of structural inequality, fragmented health systems, and limited epidemiological data. Our objective was to review the epidemiology, awareness, and treatment landscape of PsO, AD, HS, and AA in Latin America, highlighting regional guidelines, real-world studies, and unmet needs.\nA narrative review was performed by integrating data from peer-reviewed publications, national and regional guidelines, registry analyses, and real-world studies published until 2025.\nThe prevalence of PsO in LA ranges from 0.5% to 2%, AD affects 2-3% of adults, HS prevalence is estimated at 0.3-0.5%, and AA lifetime risk approximates 1-2%. Across conditions, awareness among patients and non-specialists remains low, contributing to delayed diagnosis and undertreatment. National guidelines, recently updated in Argentina, Brazil, Colombia, and Mexico, broadly align with international standards, adapting recommendations to local resource and reimbursement constraints. Biologic and targeted therapies have transformed disease management; however, access remains inequitable, limited by high costs, fragmented insurance systems, and slow regulatory approval processes. Emerging real-world evidence from registries such as MEASURE-AD, RENAAC (AA), and national HS cohorts confirms therapeutic benefit but highlights persistent disparities and data gaps.\nDespite major advances in therapeutic innovation, LA faces continuing inequities in access and outcomes for inflammatory skin diseases. Coordinated regional registries, harmonized clinical guidelines, and policy reforms to accelerate drug approval and reimbursement are essential to achieve equitable dermatologic care.",
  "pub_date": "2025-12-22",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Hospital Italiano de Buenos Aires, University Hospital Italiano de Buenos Aires, Buenos Aires, Argentina.",
    "Department of Dermatology, Hospital Italiano de Buenos Aires, University Hospital Italiano de Buenos Aires, Buenos Aires, Argentina.",
    "Department of Dermatology, Hospital Italiano de Buenos Aires, University Hospital Italiano de Buenos Aires, Buenos Aires, Argentina.",
    "Rheumatology Section, Internal Medicine Service, Hospital Italiano de Buenos Aires, University Hospital Italiano de Buenos Aires, Buenos Aires, Argentina."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41466856/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}