{
  "pmid": "41480426",
  "title": "Navigating the Misdiagnosis of Pityriasis Rubra Pilaris and Successful Treatment With Guselkumab: A Case Report of Dual Biologic Therapy.",
  "abstract": "Pityriasis rubra pilaris (PRP) is a rare and chronic dermatologic condition often misdiagnosed due to its clinical resemblance to psoriasis. It significantly impacts quality of life due to its clinical presentation and systemic discomfort. Conventional treatments, including retinoids, corticosteroids, and methotrexate, often yield suboptimal outcomes, particularly in refractory cases. Recently, biologic therapies have shown promise for PRP management. This case report describes the successful treatment of PRP with guselkumab. A 57-year-old male presented with an eight-year history of refractory papulosquamous disorder affecting 70% of his body surface area, initially diagnosed and treated as psoriasis. The patient had failed topical steroids, topical calcineurin inhibitors, sulfasalazine, and methotrexate. He had a past medical history of asthma treated with dupilumab. On skin exam, there were orange-red scaly plaques on the scalp, trunk, upper and lower extremities, buttocks, and genitals. Some of the plaques coalesced in areas to confluence, making PRP a presumptive diagnosis. Diagnosis was confirmed by three punch biopsies, and treatment with guselkumab 100mg subcutaneous injection was initiated. The patient noted improvement after the first loading dose and achieved complete skin clearance following the second dose four weeks later. At his one-year follow-up, he maintained full clearance while receiving guselkumab 100 mg subcutaneously every eight weeks. This case highlights the potential of guselkumab as an effective treatment for refractory PRP, even in cases of extensive disease. It underscores the importance of accurate diagnosis through biopsy and demonstrates the feasibility of concurrent biologic therapies for managing comorbid inflammatory conditions. Further research is needed to optimize biologic treatment strategies and enhance understanding of dual biologic use in complex dermatologic cases.",
  "pub_date": "2025-12-01",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Dermatology, Northern Ontario School of Medicine (NOSM) University, Sudbury, CAN.",
    "Dermatology, Northern Ontario School of Medicine (NOSM) University, Sudbury, CAN."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41480426/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}