{
  "pmid": "41496107",
  "title": "New-onset ulcerative colitis temporally associated with with ixekizumab in a psoriasis patient successfully treated with guselkunmab: A case report.",
  "abstract": "Ulcerative colitis (UC) and psoriasis are both chronic inflammatory diseases mediated by the immune system. Ixekizumab, used to treat psoriasis, carries a risk of inducing or exacerbating UC. Infliximab has also been reported to exacerbate psoriasis. Guselkumab (GUS) can be used to treat both UC and psoriasis. Currently, there are few case reports on the use of GUS for the treatment of UC-psoriasis comorbidity. Our observations support the rationale for IL-23-targeted agents in patients with overlapping psoriasis and inflammatory bowel disease, and they provide exploratory evidence that the psoriasis-labeled regimen of GUS may suffice for selected UC patients.\nA 51-year-old woman with a history of psoriasis for more than 20 years was diagnosed with ulcerative colitis due to abdominal pain, diarrhea, and mucous-bloody stools while using ixekizumab. During treatment with infliximab for ulcerative colitis, her psoriatic lesions worsened. Switching to guselkumab achieved complete skin clearance (PASI 0) and sustained endoscopic remission of UC (Mayo 1, UCEIS 1) without the need for additional biologic therapy.\nPsoriasis has been previously diagnosed; ulcerative colitis was diagnosed based on the patient's clinical symptoms, colonoscopy, and pathological examination.\nThe patient was given guselkumab (100 mg every 8 weeks) and mesalazine (4 g every day).\nFour months after starting guselkumab, the patient's psoriasis area and severity index score reached 0, and guselkumab therapy was continued thereafter. Since then, she has experienced no gastrointestinal symptoms, and her psoriasis has been well-controlled. On June 28, 2025, a follow-up colonoscopy was performed. The Mayo endoscopic score was 1, and the ulcerative colitis endoscopic index of severity score was 1.\nDermatologists closely monitor gastrointestinal symptoms in patients with psoriasis who are receiving ixekizumab to ensure safe medication use. Patients with ulcerative colitis and psoriasis may actively consider using guselkumab.",
  "pub_date": "2026-01-02",
  "publication_types": [
    "Journal Article",
    "Case Reports"
  ],
  "affiliations": [
    "The Second Clinical Medical College of Guangzhou University of traditional Chinese Medicine, Guangdong, China.",
    "The Second Clinical Medical College of Guangzhou University of traditional Chinese Medicine, Guangdong, China.",
    "Guangdong Hospital of Traditional Chinese Medicine, Guangzhou, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41496107/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}