{
  "pmid": "41501565",
  "title": "Real-World Benefit of Tildrakizumab for Moderate-to-Severe Plaque Psoriasis: Findings from a Systematic Literature Review and Meta-Analysis.",
  "abstract": "Plaque psoriasis (PsO) is an inflammatory skin disease that can impair quality of life. Tildrakizumab, an anti-IL-23 p19 monoclonal antibody, offers a treatment option for patients eligible for systemic therapy or phototherapy, but real-world results have not been comprehensively analyzed. This systematic review and meta-analysis evaluated real-world effectiveness, quality-of-life impact, and safety of tildrakizumab for treatment of moderate-to-severe plaque PsO, alone and relative to guselkumab and risankizumab.\nMEDLINE® and Embase were searched on November 16, 2023, along with meeting abstracts (2021-2023) and bibliographies of previous reviews, for English-language real-world studies of tildrakizumab (singly or comparative) in adults with chronic moderate-to-severe plaque PsO. Outcomes included effectiveness (Psoriasis Area and Severity Index [PASI], Physician's Global Assessment [PGA], body surface area percentage [%BSA] affected), Dermatology Life Quality Index (DLQI), and safety (adverse events [AEs], serious AEs [SAEs], treatment-related AEs [TRAEs], or withdrawals due to AEs [WDAEs]). Meta-analyses were performed at 12-16, 24-28, and 36-52 weeks.\nOf 6982 records screened, 37 studies (45 publications) were analyzed. Tildrakizumab-treated patients experienced 78-87% improvement from baseline to 36-52 weeks across mean absolute PASI (12.81 [95% confidence interval 11.69, 13.92] to 1.62 [1.03, 2.20]), %BSA (16.21% [13.72%, 18.70%] to 3.27% [1.26%, 5.28%]), PGA (3.18 [2.89, 3.47] to 0.70 [0.08, 1.33]), and DLQI (14.59 [12.32, 16.87] to 1.83 [0.84, 2.82]), with low rates of AEs, SAEs, TRAEs, and WDAEs. Benefits and safety of tildrakizumab were similar to guselkumab and risankizumab.\nTildrakizumab demonstrated effectiveness, with reduction from moderate-to-severe to mild disease and improved DLQI scores, without notable safety concerns, for up to 1 year in this real-world meta-analysis. Although real-world data must be interpreted cautiously because of heterogeneity and potential bias, these findings align with randomized trial results, further supporting the use of tildrakizumab in clinical practice.",
  "pub_date": "2026-01-07",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Schweiger Dermatology Group, Exton, PA, USA.",
    "Section of Dermatology, Baylor Scott and White Health System, Dallas, TX, USA.",
    "Bare Dermatology, Dallas, TX, USA.",
    "Therapeutics Clinical Research, San Diego, CA, USA.",
    "Evidinno Outcomes Research Inc., Vancouver, BC, Canada.",
    "Evidinno Outcomes Research Inc., Vancouver, BC, Canada.",
    "Evidinno Outcomes Research Inc., Vancouver, BC, Canada.",
    "Viver Health LLC, Morristown, NJ, USA.",
    "Sun Pharmaceutical Industries, Inc., 2 Independence Way Suite 240, Princeton, NJ, 08540, USA. Jacob.Mathew@sunpharma.com.",
    "Sun Pharmaceutical Industries, Inc., 2 Independence Way Suite 240, Princeton, NJ, 08540, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41501565/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}