{
  "pmid": "41518512",
  "title": "Guselkumab Treatment ADHEREnce in BulGaria of Patients with Psoriasis-ADHERE-BG Study.",
  "abstract": "Treatment adherence is crucial for managing chronic diseases, including plaque psoriasis. In Bulgaria, patients with plaque psoriasis can receive treatment with reimbursed biologics, such as guselkumab, if they meet National Health Insurance Fund (NHIF) requirements. These requirements include stringent disease criteria and a complex administrative process. The objective of this analysis is to assess the proportion of patients adhering to the guselkumab administration schedule, as specified in the summary of product characteristics (SmPC), after the first continuation of the NHIF treatment approval period (approximately 48 weeks).\nThis was a prospective, multicenter, single-country, noninterventional study. The primary endpoint was the proportion of patients adhering to the guselkumab administration schedule as outlined in the SmPC after the first continuation of the NHIF treatment approval period. Secondary endpoints included evaluating guselkumab's safety and efficacy, as well as patient profile.\nThis study included 39 female and 61 male patients with plaque psoriasis, with a mean age of 51.5 years. Overall, 95% of enrolled patients adhered to the guselkumab dosing regimen (i.e., received all seven doses) at 50 weeks after study initiation. Treatment with guselkumab led to a rapid and sustained reduction in Psoriasis Area and Severity Index (PASI) scores, with 84.4% of patients achieving PASI 90 and 42.7% reaching PASI 100 by the final visit. Significant improvements were also observed in absolute PASI, body surface area (BSA), and Dermatology Life Quality Index (DLQI) scores, indicating marked disease control and enhanced quality of life across the study period. There were ten adverse events during the study, and no new safety signals for guselkumab were identified.\nBulgarian patients treated with guselkumab adhered well to treatment in this study, with an adherence rate comparable to that observed in randomized clinical trials and higher than the drug survival rates reported in real-world studies. This may be owing, in part, to the existing patient support programs specific to Bulgaria. Treatment with guselkumab in real-life clinical practice in Bulgaria was well tolerated and effective in reducing signs and symptoms of plaque psoriasis, consistent with the overall efficacy and safety profile demonstrated in randomized controlled trials.",
  "pub_date": "2026-01-10",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology and Venereology, Medical Faculty, Medical University, Sofia, Bulgaria.",
    "Department of Dermatology and Venereology, Acibadem City Clinic Tokuda Hospital, Sofia, Bulgaria.",
    "University Hospital for Active Treatment Pulmed Plovdiv, Plovdiv, Bulgaria.",
    "Medical University of Pleven, Pleven, Bulgaria.",
    "Johnson & Johnson Bulgaria EOOD, Business Park Sofia, Build. 4, Floor 1, Sofia, Bulgaria, 1766. bilieva@its.jnj.com.",
    "Department of Dermatology and Venereology, Acibadem City Clinic Tokuda Hospital, Sofia, Bulgaria.",
    "Department of Dermatology and Venereology, Medical Faculty, Trakia University, Stara Zagora, Bulgaria."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41518512/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}