{
  "pmid": "41545605",
  "title": "A Phase 1 Bioequivalence Study to Assess the Pharmacokinetics, Safety and Tolerability of Guselkumab After a Single-Dose Administration via Two Subcutaneous Injection Devices in Healthy Volunteers.",
  "abstract": "Guselkumab is approved for the treatment of psoriasis, psoriatic arthritis, as well as ulcerative colitis and Crohn's disease. Two delivery devices for subcutaneous (SC) injection previously had been approved for the administration of 100 mg guselkumab. This study was designed to demonstrate the bioequivalence and tolerability of guselkumab following a single-dose SC administration of 100 mg guselkumab using a 1 mL prefilled syringe (PFS) assembled with an Ypsomate autoinjector (i.e., 1 mL PFS-Y, Test device) as compared to the approved 1 mL PFS assembled with the UltraSafe Plus needle safety guard (i.e., 1 mL PFS-U, Reference device). Mean serum guselkumab concentration-time profiles were nearly superimposable for both devices following a single SC injection. The geometric mean ratios and the corresponding 90% confidence interval [CI] for Cmax and AUCinf were 102.28% (94.85%-110.30%) and 102.10% (95.19%-109.51%), respectively. There were no significant differences in the incidence of treatment-emergent adverse events between the two treatment groups, and the incidence of treatment-emergent anti-drug antibodies was low and comparable between the two groups. Overall, these results suggest that the pharmacokinetics, safety/tolerability, and immunogenicity of guselkumab are comparable when administered via the 1 mL PFS-Y and 1 mL PFS-U.",
  "pub_date": "2026-01",
  "publication_types": [
    "Journal Article",
    "Clinical Trial, Phase I",
    "Randomized Controlled Trial",
    "Comparative Study"
  ],
  "affiliations": [
    "Clinical Pharmacology and Pharmacometrics, Johnson & Johnson, Spring House, PA, USA.",
    "Immunology Clinical Development, Johnson & Johnson, Spring House, PA, USA.",
    "Immunology Clinical Development, Johnson & Johnson, Spring House, PA, USA.",
    "Preclinical Sciences & Translational Safety, Johnson & Johnson, Spring House, PA, USA.",
    "Statistics & Decision Science, Johnson & Johnson, Titusville, NJ, USA.",
    "Clinical Pharmacology and Pharmacometrics, Johnson & Johnson, Beerse, Belgium.",
    "Clinical Pharmacology and Pharmacometrics, Johnson & Johnson, Spring House, PA, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41545605/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}