{
  "pmid": "41554499",
  "title": "Diet, inflammatory skin disorders, and mental health: A scoping review of current evidence.",
  "abstract": "Chronic inflammatory skin disorders (CISDs)-including acne, psoriasis, and atopic dermatitis-are linked to substantial psychological distress and social stigma, often resulting in comorbid mental health conditions and contributing to the global disease burden. Diet, as a modifiable factor, has drawn growing attention for its potential impact on both CISDs and mental health. This systematic scoping review aimed to evaluate the current evidence on the interrelationships among dietary factors, CISDs, and mental health conditions.\nA comprehensive literature search was performed across six databases (from inception to April 2024): MEDLINE, CINAHL, Embase, Scopus, Cochrane CENTRAL, and PROSPERO. After duplicate removal, 1739 unique records were identified. Titles, abstracts, and full texts were screened using predefined eligibility criteria. 22 studies met inclusion criteria and were included in the final synthesis. Data were extracted and synthesized according to study design, population characteristics, dietary factors, CISDs, and mental health conditions.\nOf the 22 included studies, 11 were cross-sectional. Among the three focal domains, acne (n = 12) was the most frequently studied CISD; food consumption and frequency (n = 8) were the most common dietary exposures; and depression (n = 13) was the most frequently assessed mental health condition. Across studies, consistent associations were observed: beneficial dietary factors, including guideline-aligned dietary patterns, components, and behaviours characterised by nutrient-dense and health-promoting profiles, were positively linked to reduced risk or severity of both CISDs and mental health conditions. A strong positive correlation between CISDs and mental health outcomes was also evident. Two major gaps were identified in the current literature. First, the overall strength of evidence remains limited, with only three cohort studies and two randomized controlled trials among the 22 included. Second, few studies concurrently examined the interrelationships among diet, CISDs, and mental health. The most promising conceptual framework for future mediation analysis appears to be the pathway: Diet → CISDs (mediator) → Mental health outcomes.\nDiet represents a modifiable and potentially cost-effective factor within the interconnected system linking dietary factors, CISDs, and mental health conditions. Current evidence supports associations across all three domains, highlighting the need for integrated research and intervention strategies that simultaneously address diet, skin health, and mental health. Future studies using large-scale and integrated data sources are needed to clarify these complex interrelationships.",
  "pub_date": "2026-01-17",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Nutritional Sciences, School of Life Course and Population Sciences, King's College London, London, UK.",
    "Department of Nutritional Sciences, School of Life Course and Population Sciences, King's College London, London, UK.",
    "Department of Nutritional Sciences, School of Life Course and Population Sciences, King's College London, London, UK.",
    "Department of Nutritional Sciences, School of Life Course and Population Sciences, King's College London, London, UK.",
    "Department of Nutritional Sciences, School of Life Course and Population Sciences, King's College London, London, UK.",
    "Department of Psychological Medicine, Institute of Psychiatry, Psychology and Neuroscience (IoPPN), King's College London, London, UK.",
    "Department of Dermatology, King's College Hospital, King's College London, London, UK.",
    "Department of Nutritional Sciences, School of Life Course and Population Sciences, King's College London, London, UK. Electronic address: wendy.hall@kcl.ac.uk."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41554499/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}