{
  "pmid": "41575604",
  "title": "Real-World Effectiveness and Safety of Tildrakizumab for Plaque Psoriasis: A 3-Year International Multicenter Retrospective Study.",
  "abstract": "",
  "pub_date": "2026-01-23",
  "publication_types": [
    "Letter"
  ],
  "affiliations": [
    "Department of Dermatology, Centro Hospitalar de Santo António, Centro Hospitalar Universitário do Porto, Largo do Prof. Abel Salazar S/N, 4099-001, Porto, Portugal. torres.tiago@outlook.com.",
    "Instituto de Ciências Biomédicas Abel Salazar, University of Porto, Porto, Portugal. torres.tiago@outlook.com.",
    "Temerty Faculty of Medicine, University of Toronto, Toronto, ON, Canada.",
    "College of Medicine, University of Saskatchewan, Saskatoon, SK, Canada.",
    "Division of Dermatology, McMaster University, Hamilton, ON, Canada.",
    "Dermatrials Research Inc. & Venderm Consulting, Hamilton, ON, Canada.",
    "Probity Medical Research, Waterloo, Canada.",
    "Division of Dermatology, Department of Medicine, University of Calgary, Calgary, Canada.",
    "Section of Community Pediatrics, Department of Pediatrics, University of Calgary, Calgary, Canada.",
    "Section of Pediatric Rheumatology, Department of Pediatrics, University of Calgary, Calgary, Canada.",
    "Skin Health & Wellness Centre, Calgary, Canada.",
    "Dermatology Research Institute, Calgary, Canada.",
    "Department of Dermatology, Hospital de la Santa Creu i Sant Pau and Universitat Autònoma de Barcelona School of Medicine, Barcelona, Spain.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Department of Pathophysiology and Transplantation, Università Degli Studi di Milano, Milan, Italy.",
    "Department of Dermatology, University of Verona, Verona, Italy.",
    "Servicio de Dermatología, Hospital Universitari Germans Trias i Pujol, IGTP, UAB Badalona, Barcelona, Spain.",
    "Department of Dermatology, Hospital Universitario de La Princesa, Instituto de Investigación Sanitaria de La Princesa (IIS-IP), Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario de La Princesa, Instituto de Investigación Sanitaria de La Princesa (IIS-IP), Madrid, Spain.",
    "Unit of Dermatology, University of Campania Luigi Vanvitelli, Naples, Italy.",
    "Instituto de Ciências Biomédicas Abel Salazar, University of Porto, Porto, Portugal.",
    "Department of Health Sciences, Section of Dermatology, University of Florence, Florence, Italy.",
    "Department of Dermatology, University of Verona, Verona, Italy.",
    "Department of Health Sciences, Section of Dermatology, University of Florence, Florence, Italy.",
    "Unit of Dermatology, University of Campania Luigi Vanvitelli, Naples, Italy.",
    "Section of Dermatology, Department of Clinical Medicine and Surgery, University of Naples Federico II, Naples, Italy.",
    "Dermatology Unit, Fondazione IRCCS Ca' Granda Ospedale Maggiore Policlinico, Milan, Italy.",
    "Department of Dermatology, Hospital de la Santa Creu i Sant Pau and Universitat Autònoma de Barcelona School of Medicine, Barcelona, Spain.",
    "Servicio de Dermatología, Hospital Universitari Germans Trias i Pujol, IGTP, UAB Badalona, Barcelona, Spain.",
    "Division of Dermatology, Department of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Division of Dermatology, Department of Medicine, Sunnybrook Health Sciences Centre, Toronto, ON, Canada.",
    "Department of Dermatology, University Hospital Basel, Basel, Switzerland.",
    "Department of Dermatology, University Hospital Zürich, Zurich, Switzerland.",
    "Department of Dermatology, University of Padua, Padua, Italy.",
    "Department of Dermatology, University Hospital Zürich, Zurich, Switzerland.",
    "Faculty of Medicine, University of Zürich, Zurich, Switzerland.",
    "Probity Medical Research, Waterloo, Canada.",
    "Division of Dermatology, Department of Medicine, University of Toronto, Toronto, ON, Canada.",
    "Division of Dermatology, Department of Medicine, Sunnybrook Health Sciences Centre, Toronto, ON, Canada.",
    "Division of Dermatology, Department of Medicine, Women's College Hospital, Toronto, Canada."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41575604/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}