{
  "pmid": "41587560",
  "title": "The path to interception in psoriatic disease: from conceptual clarity to clinical translation.",
  "abstract": "Psoriatic arthritis develops in up to one-third of individuals with psoriasis, typically following a prolonged subclinical phase. Diagnostic delays are common, often exceeding 2 years, and can result in irreversible joint damage. The growing recognition of this latent period has fuelled interest in earlier identification and interception. However, efforts are hampered by inconsistent definitions of early or subclinical psoriatic arthritis, insufficient prognostic tools, and an absence of consensus on the outcome for interception studies. This Review synthesises a rapidly evolving field, offering a framework organised around four crucial questions: first, what defines progression from psoriasis to psoriatic arthritis? Second, who is most at risk of transition? Third, how can progression be reliably measured using imaging, molecular biomarkers, or digital health technologies? Fourth, when should preventive intervention be considered? We critically examine new conceptual models, the limitations of existing classification criteria, advances in imaging and biomarker research, and the promise of digital phenotyping. Addressing the current challenges in definitions, risk stratification, measurement, and trial design is essential for the development of biologically grounded, ethically robust interception strategies.",
  "pub_date": "2026-01-23",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences, University of Oxford, Oxford, UK; Big Data Institute, University of Oxford, Oxford, UK. Electronic address: dylan.mcgagh@ndorms.ox.ac.uk.",
    "Wellcome-Wolfson Institute for Experimental Medicine, Queen's University Belfast, Belfast, UK.",
    "School of Medicine, UCD Conway Institute, University College Dublin, Dublin, Ireland.",
    "Group for Research and Assessment of Psoriasis and Psoriatic Arthritis Patient Research Partner, Seattle, WA, USA; Tranzo, Tilburg University, Tilburg, Noord-Brabant, The Netherlands.",
    "School of Medicine, UCD Conway Institute, University College Dublin, Dublin, Ireland.",
    "School of Medicine, UCD Conway Institute, University College Dublin, Dublin, Ireland.",
    "Nuffield Department of Orthopaedics, Rheumatology and Musculoskeletal Sciences, University of Oxford, Oxford, UK."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41587560/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}