{
  "pmid": "41630863",
  "title": "Prevalence, multiterritorial vascular distribution, and burden of subclinical atherosclerosis in psoriasis: The EDSAP study.",
  "abstract": "Psoriasis increases atherosclerosis risk due to inflammation. To date, subclinical atherosclerosis (SA) in psoriasis has only been studied in individual vascular territories by imaging.\nTo conduct a comprehensive evaluation of multiterritorial SA prevalence in psoriasis by imaging and establish its relationships with cardiovascular (CV) risk scores.\nA total of 120 patients with moderate-to-severe psoriasis without CV disease from the Early Detection of Subclinical Atherosclerosis in Psoriasis (EDSAP) cohort underwent vascular ultrasound of carotid/femoral arteries and noncontrast/contrast-coronary computed tomography angiography. SA was defined by the presence of any plaque or a coronary artery calcium score ≥1.\nThe median age was 48.04 (8.25) years, 73% were male, and 77% of participants had SA. Femoral arteries were most affected (57.1%), followed by the coronaries (51.3%) and carotid arteries (49.6%). Femoral plaques exhibited the strongest associations with coronary parameters. CV risk scores underestimated SA, as at least 60% low-risk and 90% moderate-risk patients had SA.\nThe main limitation is the small sample size.\nThis study provides the first multiterritorial assessment of SA in psoriasis, revealing a high prevalence of early disease. Femoral arteries were most affected, correlating with coronary atherosclerosis. The high SA detection within low-/intermediate-risk individuals suggests recalibrating CV scores for establishing effective preventive measures.",
  "pub_date": "2025-12-16",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Faculty of Medicine, Universidad Francisco de Vitoria, Madrid, Spain.",
    "Faculty of Medicine, Universidad Francisco de Vitoria, Madrid, Spain.",
    "Faculty of Medicine, Universidad Francisco de Vitoria, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Department of Dermatology, Hospital del Sureste, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario La Princesa, Madrid, Spain.",
    "Atria Clinic, Madrid, Spain.",
    "HM CIEC Madrid (Centro Integral de Enfermedades Cardiovasculares), Hospital Universitario HM Montepríncipe, HM Hospitales, Madrid, Spain.",
    "Facultad HM de Ciencias de la Salud de la Universidad Camilo José Cela, Madrid, Spain.",
    "Instituto de Investigación Sanitaria HM Hospitales, Madrid, Spain.",
    "Department of Vascular Physiopathology, Hospital Nacional de Parapléjicos, IDISCAM, Toledo, Spain.",
    "Department of Vascular Physiopathology, Hospital Nacional de Parapléjicos, SESCAM, Toledo, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Department of Biostatistics, Epidemiology and Informatics, Perelman School of Medicine, University of Pennsylvania, Philadelphia, Pennsylvania.",
    "Department of Dermatology, Perelman School of Medicine, University of Pennsylvania, Philadelphia, Pennsylvania.",
    "Department of Cardiology, George Washington Medical Center, Washington, DC, USA.",
    "Atria Clinic, Madrid, Spain.",
    "Department of Cardiology, Hospital Universitario 12 de Octubre, Madrid, Spain.",
    "Atria Clinic, Madrid, Spain.",
    "HM CIEC Madrid (Centro Integral de Enfermedades Cardiovasculares), Hospital Universitario HM Montepríncipe, HM Hospitales, Madrid, Spain.",
    "Facultad HM de Ciencias de la Salud de la Universidad Camilo José Cela, Madrid, Spain.",
    "Instituto de Investigación Sanitaria HM Hospitales, Madrid, Spain.",
    "Department of Dermatology, Hospital Universitario Ramón y Cajal, IRYCIS, Madrid, Spain.",
    "Faculty of Medicine, Universidad Francisco de Vitoria, Madrid, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41630863/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}