{
  "pmid": "41656881",
  "title": "The real-world economic impact of herpes zoster disease in patients with selected underlying conditions in Spain.",
  "abstract": "People with underlying diseases are at-increased-risk of suffering from herpes zoster (HZ). However, the economic impact of HZ on these populations is not well described. This study aimed to quantify the clinical and economic impact of HZ in patients with comorbidities (diabetes, chronic obstructive pulmonary disease, heart disease, kidney disease, asthma) and immune disorders (inflammatory bowel disease, rheumatoid arthritis, systemic lupus erythematosus, multiple sclerosis, psoriasis, COVID-19 and psoriatic arthritis) in Spain. This is an observational, retrospective case-control study using the BIG-PAC electronic records from 01 Jan 2014 to 31 Aug 2021. Healthcare resource use and costs over 12 months following HZ diagnosis were compared between patients and controls, matched by propensity scores. The total annual economic burden was estimated using HZ-related costs per patient and HZ crude incidence over the study period, together with the estimated prevalence of each comorbidity in the Spanish population aged ≥18 y. Mean incremental costs per HZ episode were €1,108 in patients with comorbidities and €1,203 in patients with immune disorders. Indirect costs accounted for 4.7% and 22.9% of incremental costs in people with comorbidities and immune disorders, respectively. Mean annual crude HZ incidence rates were 613.6 cases per 100,000 people with comorbidities and 659.0 cases per 100,000 people with autoimmune disorders. Total annual costs due to HZ in these populations were estimated at €121 million. HZ may cause a significant economic burden in Spain from a societal perspective in patients with underlying conditions, highlighting the importance of improving vaccination programs.",
  "pub_date": "2026-02-08",
  "publication_types": [
    "Journal Article",
    "Observational Study"
  ],
  "affiliations": [
    "Preventive Medicine, Immunization Department, Hospital Universitario Fundación Jiménez Díaz, Madrid Spain.",
    "Market Access, GSK, Tres Cantos, Spain.",
    "Global Modelling Team, GSK, Wavre, Belgium.",
    "Market Access, GSK, Tres Cantos, Spain.",
    "Market Access, GSK, Tres Cantos, Spain.",
    "HEOR Department, Atrys Health, Madrid, Spain.",
    "HEOR Department, Atrys Health, Madrid, Spain.",
    "HEOR Department, Atrys Health, Madrid, Spain.",
    "HEOR Department, Atrys Health, Madrid, Spain.",
    "Market Access, GSK, Tres Cantos, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41656881/",
  "snapshot_id": "2026-02-12T15-12-29Z",
  "ingested_at": "2026-02-12T15:12:33.030557+00:00"
}