{
  "pmid": "41577189",
  "title": "Infection risk among psoriasis biologic-new users: a cohort study on the French National Health Data System.",
  "abstract": "The infection risks of recent biologics for psoriasis remain insufficiently studied.\nTo simultaneously assess inpatient- and outpatient-managed infection risks of biologics in psoriasis.\nUsing the French National Health Data System (2013-2022), we conducted a cohort study of 39,669 adults with psoriasis who were new users of biologics. Biologics were compared regarding: (i) time to hospitalization for infection, (ii) time to first outpatient anti-infective dispensation, and (iii) proportion of days covered by anti-infectives over two years.\nDuring biologic exposure, inpatient-managed infections occurred at 27.1 per 1,000 person-years, and median systemic anti-infective coverage was low (5.5%; 95%CI: 2.6-11.5). Using the most frequently prescribed biologic, adalimumab, as reference: (i) inpatient-managed infection risk was lower with ustekinumab, secukinumab, and risankizumab; (ii) first antibacterial use was higher with certolizumab and lower with ustekinumab, guselkumab, and risankizumab; (iii) antibacterial coverage was lower with ustekinumab, secukinumab, ixekizumab, risankizumab, and tildrakizumab; higher antimycotic coverage was observed with IL-17i biologics.\nClaims data lacks clinical information and limits our assessment to systemic anti-infectives.\nBiologics are associated with low overall infection risks. Among biologics, ustekinumab and IL-23 inhibitors show the lowest overall risk (time to the first inpatient/outpatient event).",
  "pub_date": "2026-01-21",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "EpiDermE Epidemiology in Dermatology and Evaluation of Therapeutics, EA7379, Paris Est Créteil University UPEC, F-94010, Créteil, France.",
    "EpiDermE Epidemiology in Dermatology and Evaluation of Therapeutics, EA7379, Paris Est Créteil University UPEC, F-94010, Créteil, France.",
    "EpiDermE Epidemiology in Dermatology and Evaluation of Therapeutics, EA7379, Paris Est Créteil University UPEC, F-94010, Créteil, France; Centre d'Investigation Clinique 1430, INSERM, Créteil, France; Department of Dermatology, Assistance Publique-Hôpitaux de Paris (AP-HP), Henri Mondor Hospital, Creteil, France. Electronic address: emilie.sbidian@aphp.fr."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41577189/",
  "snapshot_id": "2026-02-12T15-48-55Z",
  "ingested_at": "2026-02-12T15:48:57.253777+00:00"
}