{
  "pmid": "41676155",
  "title": "A 76-week real-world multidimensional analysis of guselkumab in moderate to severe plaque psoriasis: a retrospective cohort study based on Chinese clinical practice standards.",
  "abstract": "Guselkumab, a monoclonal antibody targeting IL-23p19, has shown durable efficacy and safety in global phase III trials and real-world studies. However, in Chinese populations, comprehensive real-world evidence regarding its effects across disease severities, body areas, and metabolic parameters remains limited.\nTo conduct a multidimensional evaluation of guselkumab in moderate to severe plaque psoriasis based on Chinese clinical practice standards.\nThis retrospective analysis enrolled 90 patients receiving guselkumab and assessed efficacy from multiple dimensions, along with adverse events, drug survival, and metabolic indicators. Composite indices were used to evaluate coronary artery disease (CAD) and insulin resistance risk.\nGuselkumab showed sustained efficacy over 76 weeks in Chinese patients. Body area analysis showed significantly faster clearance of head lesions, with 40.0% of patients achieving complete clearance at week 4, compared to only 16.0% for lower extremities (P < 0.01). Baseline disease severity and switching to guselkumab due to inadequate response to prior biologics did not significantly affect treatment outcomes (P > 0.05). Predictors of PASI 100 at week 52 included normal BMI (OR = 6.10, 95% CI: 1.54-23.96), no phototherapy history (OR = 0.17, 95% CI: 0.04-0.71), and biologic-naïve status (OR = 0.14, 95% CI: 0.03-0.62). Mean fasting blood glucose (FBG) increased from 5.51 (0.74) to 5.65 (0.75) mmol/L at week 52 (P = 0.02). The Within Normal Limits (WNL) subgroup showed transient elevations in total cholesterol (week 28, P = 0.049) and triglycerides (week 28, P = 0.009). Although these indicators increased, they remained within the normal range. The Abnormal Without Treatment (AWT) subgroup exhibited decreased uric acid (UA) at week 52 (471.00 ± 51.06 to 418.72 ± 64.35 μmol/L; P = 0.004). Composite indices indicated no increased CAD or insulin resistance risk. Injection site reactions (32.2%) were the most common adverse events. Drug survival was 78.9% at 76 weeks.\nThis study confirms the durable efficacy and safety of guselkumab in Chinese patients with plaque psoriasis, with early response heterogeneity favoring the head. Treatment did not increase CAD or insulin resistance risk. Normal BMI and biologic-naïve status were associated with superior efficacy, supporting precision management strategies that integrate cutaneous and systemic monitoring.",
  "pub_date": "2026-01-27",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China.",
    "Department of Dermatology, The First Affiliated Hospital of Chongqing Medical University, Chongqing, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41676155/",
  "snapshot_id": "2026-02-12T16-18-10Z",
  "ingested_at": "2026-02-12T16:18:11.791314+00:00"
}