{
  "pmid": "37341177",
  "title": "Deucravacitinib: The First FDA-Approved Oral TYK2 Inhibitor for Moderate to Severe Plaque Psoriasis.",
  "abstract": "The objective of this study was to review the safety and efficacy of deucravacitinib, a tyrosine kinase 2 (TYK2) inhibitor for moderate to severe plaque psoriasis.\nLiterature was reviewed from MEDLINE and Clinicaltrials.gov up to December 2022 using the terms \"deucravacitinib\" and \"BMS-986165.\"\nRelevant articles in English relating to the pharmacodynamics, pharmacokinetics, efficacy, and safety of deucravacitinib were included. A total of 6 trial results were included.\nDeucravacitinib showed clinical efficacy across all the phase II and III clinical trials. Excluding the long-term extension study, there were 2248 subjects across all studies, with 63.2% of patients receiving deucravacitinib 6 mg daily. Of these subjects, the average proportion achieving a PASI 75 (a reduction of greater than 75% in the Psoriasis Area and Severity Index) at week 16 was 65.1%. Patients receiving deucravacitinib 6 mg once daily had a higher rate of achieving both PASI 75 response and a Static Physician's Global Assessment (sPGA) score of 0 or 1, compared with oral apremilast 30 mg twice daily. The safety profile of deucravacitinib includes mild adverse events (AEs), most commonly nasopharyngitis, with serious AEs reported ranging from 1.35% to 9.5%.\nWhile many available therapies for moderate to severe plaque psoriasis rely on an injectable dosage form or extensive monitoring, deucravacitinib can potentially reduce patient medication-related burden. This review summarizes the efficacy and safety of oral deucravacitinib for the treatment of severe plaque psoriasis.\nDeucravacitinib shows a consistent efficacy and safety profile as the first oral TYK2 inhibitor approved for adult patients with moderate to severe plaque psoriasis who are eligible for systemic therapy or phototherapy treatment.",
  "pub_date": "2023-06-21",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Rutgers Robert Wood Johnson Medical School, Somerset, NJ, USA.",
    "School of Medicine, Rutgers New Jersey Medical School, Newark, NJ, USA.",
    "School of Medicine, Rutgers Robert Wood Johnson Medical School, New Brunswick, NJ, USA.",
    "School of Medicine, Rutgers New Jersey Medical School, Newark, NJ, USA.",
    "NYIT College of Osteopathic Medicine, Glen Head, NY, USA.",
    "Department of Dermatology, Rutgers Robert Wood Johnson Medical School, Somerset, NJ, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37341177/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}