{
  "pmid": "37436070",
  "title": "Systemic pharmacological treatments for chronic plaque psoriasis: a network meta-analysis.",
  "abstract": "Psoriasis is an immune-mediated disease with either skin or joints manifestations, or both, and it has a major impact on quality of life. Although there is currently no cure for psoriasis, various treatment strategies allow sustained control of disease signs and symptoms. The relative benefit of these treatments remains unclear due to the limited number of trials comparing them directly head-to-head, which is why we chose to conduct a network meta-analysis.\nTo compare the benefits and harms of non-biological systemic agents, small molecules, and biologics for people with moderate-to-severe psoriasis using a network meta-analysis, and to provide a ranking of these treatments according to their benefits and harms.\nFor this update of the living systematic review, we updated our searches of the following databases monthly to October 2022: the Cochrane Central Register of Controlled Trials (CENTRAL), MEDLINE, and Embase.\nRandomised controlled trials (RCTs) of systemic treatments in adults over 18 years with moderate-to-severe plaque psoriasis, at any stage of treatment, compared to placebo or another active agent. The primary outcomes were: proportion of participants who achieved clear or almost clear skin, that is, at least Psoriasis Area and Severity Index (PASI) 90; proportion of participants with serious adverse events (SAEs) at induction phase (8 to 24 weeks after randomisation).\nWe conducted duplicate study selection, data extraction, risk of bias assessment, and analyses. We synthesised data using pairwise and network meta-analysis (NMA) to compare treatments and rank them according to effectiveness (PASI 90 score) and acceptability (inverse of SAEs). We assessed the certainty of NMA evidence for the two primary outcomes and all comparisons using CINeMA, as very low, low, moderate, or high. We contacted study authors when data were unclear or missing. We used the surface under the cumulative ranking curve (SUCRA) to infer treatment hierarchy, from 0% (worst for effectiveness or safety) to 100% (best for effectiveness or safety).\nThis update includes an additional 12 studies, taking the total number of included studies to 179, and randomised participants to 62,339, 67.1% men, mainly recruited from hospitals. Average age was 44.6 years, mean PASI score at baseline was 20.4 (range: 9.5 to 39). Most studies were placebo-controlled (56%). We assessed a total of 20 treatments. Most (152) trials were multicentric (two to 231 centres). One-third of the studies (65/179) had high risk of bias, 24 unclear risk, and most (90) low risk. Most studies (138/179) declared funding by a pharmaceutical company, and 24 studies did not report a funding source. Network meta-analysis at class level showed that all interventions (non-biological systemic agents, small molecules, and biological treatments) showed a higher proportion of patients reaching PASI 90 than placebo. Anti-IL17 treatment showed a higher proportion of patients reaching PASI 90 compared to all the interventions. Biologic treatments anti-IL17, anti-IL12/23, anti-IL23, and anti-TNF alpha showed a higher proportion of patients reaching PASI 90 than the non-biological systemic agents. For reaching PASI 90, the most effective drugs when compared to placebo were (SUCRA rank order, all high-certainty evidence): infliximab (risk ratio (RR) 49.16, 95% CI 20.49 to 117.95), bimekizumab (RR 27.86, 95% CI 23.56 to 32.94), ixekizumab (RR 27.35, 95% CI 23.15 to 32.29), risankizumab (RR 26.16, 95% CI 22.03 to 31.07). Clinical effectiveness of these drugs was similar when compared against each other. Bimekizumab and ixekizumab were significantly more likely to reach PASI 90 than secukinumab. Bimekizumab, ixekizumab, and risankizumab were significantly more likely to reach PASI 90 than brodalumab and guselkumab. Infliximab, anti-IL17 drugs (bimekizumab, ixekizumab, secukinumab, and brodalumab), and anti-IL23 drugs except tildrakizumab were significantly more likely to reach PASI 90 than ustekinumab, three anti-TNF alpha agents, and deucravacitinib. Ustekinumab was superior to certolizumab. Adalimumab, tildrakizumab, and ustekinumab were superior to etanercept. No significant difference was shown between apremilast and two non-biological drugs: ciclosporin and methotrexate. We found no significant difference between any of the interventions and the placebo for the risk of SAEs. The risk of SAEs was significantly lower for participants on methotrexate compared with most of the interventions. Nevertheless, the SAE analyses were based on a very low number of events with very low- to moderate-certainty evidence for all the comparisons. The findings therefore have to be viewed with caution. For other efficacy outcomes (PASI 75 and Physician Global Assessment (PGA) 0/1), the results were similar to the results for PASI 90. Information on quality of life was often poorly reported and was absent for several of the interventions.\nOur review shows that, compared to placebo, the biologics infliximab, bimekizumab, ixekizumab, and risankizumab were the most effective treatments for achieving PASI 90 in people with moderate-to-severe psoriasis on the basis of high-certainty evidence. This NMA evidence is limited to induction therapy (outcomes measured from 8 to 24 weeks after randomisation), and is not sufficient for evaluating longer-term outcomes in this chronic disease. Moreover, we found low numbers of studies for some of the interventions, and the young age (mean 44.6 years) and high level of disease severity (PASI 20.4 at baseline) may not be typical of patients seen in daily clinical practice. We found no significant difference in the assessed interventions and placebo in terms of SAEs, and the safety evidence for most interventions was very low to moderate quality. More randomised trials directly comparing active agents are needed, and these should include systematic subgroup analyses (sex, age, ethnicity, comorbidities, psoriatic arthritis). To provide long-term information on the safety of treatments included in this review, an evaluation of non-randomised studies is needed. Editorial note: This is a living systematic review. Living systematic reviews offer a new approach to review updating, in which the review is continually updated, incorporating relevant new evidence as it becomes available. Please refer to the Cochrane Database of Systematic Reviews for the current status of this review.",
  "pub_date": "2023-07-12",
  "publication_types": [
    "Journal Article",
    "Review",
    "Research Support, Non-U.S. Gov't",
    "Network Meta-Analysis"
  ],
  "affiliations": [
    "Department of Dermatology, Hôpital Henri Mondor, Créteil, France.",
    "Clinical Investigation Centre, Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Université de Paris, Centre of Research in Epidemiology and Statistics (CRESS), INSERM, F-75004, Paris, France.",
    "Cochrane France, Paris, France.",
    "Department of Dermatology, Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Department of Dermatology, Complexo Hospitalario Universitario de Vigo, Vigo, Spain.",
    "Department of Dermatology, Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "c/o Cochrane Skin Group, The University of Nottingham, Nottingham, UK.",
    "Centro Studi GISED (Italian Group for Epidemiologic Research in Dermatology) - FROM (Research Foundation of Ospedale Maggiore Bergamo), Padiglione Mazzoleni - Presidio Ospedaliero Matteo Rota, Bergamo, Italy.",
    "Charité - Universitätsmedizin Berlin, corporate member of Freie Universität Berlin, Humboldt-Universität zu Berlin, Berlin, Germany.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France.",
    "Department of Dermatology, Hôpital Henri Mondor, Créteil, France.",
    "Epidemiology in Dermatology and Evaluation of Therapeutics (EpiDermE) - EA 7379, Université Paris Est Créteil (UPEC), Créteil, France."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37436070/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}