{
  "pmid": "37507233",
  "title": "Psoriasis: a focus on upcoming oral formulations.",
  "abstract": "Targeted therapies have greatly improved the quality of life of patients with psoriasis. Despite the extensive list of treatments available, multiple new drugs are being developed, especially oral therapies with potential advantages as regards comfort of administration. However, the efficacy and safety of these new oral therapies need to be improved to match those of novel biologics.\nWe provide a narrative review of the oral therapies for psoriasis that are currently under development, from Jak inhibitors to oral IL-17 and IL-23 inhibitors, among others. A literature search was performed for articles published from 1 January 2020, to 6 June 2023.\nThe approval of deucravacitinib, the first Jak inhibitor for the treatment of moderate-to-severe plaque psoriasis, heralds a bright therapeutic future with multiple new oral formulations. A great number of oral treatments with singular mechanism of action, like A3AR agonists, HSP90 inhibitors, ROCK-2 inhibitors, oral TNF inhibitors, oral IL-23 inhibitors, oral IL-17 inhibitors, PD4 inhibitors (orismilast) and several Tyk2 inhibitors, are currently being evaluated in clinical trials and could be suitable for approval in the future. Growing variation in treatment modes of administration will allow dermatologists to better integrate patient preferences in the therapeutic decision process.",
  "pub_date": "2023-08-01",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [
    "Dermatology Department IIB Sant Pau, Hospital de la Santa Creu I Sant Pau, Barcelona, Spain.",
    "Dermatology Department IIB Sant Pau, Hospital de la Santa Creu I Sant Pau, Barcelona, Spain.",
    "Dermatology Department IIB Sant Pau, Hospital de la Santa Creu I Sant Pau, Barcelona, Spain."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/37507233/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}