{
  "pmid": "38876119",
  "title": "Deucravacitinib and shikonin combination therapy ameliorates imiquimod-induced psoriasis in mice.",
  "abstract": "TYK2 inhibitors and traditional natural drugs as promising drugs for psoriasis therapy are receiving increasing attention. They both affect different molecules of JAK/STAT pathway, but it is currently unclear whether their combination will enhance the effect on psoriasis. In this study, we used imiquimod (IMQ)-induced psoriasis mouse model to investigate the therapeutic effects of the combined administration of deucravacitinib (TYK2 inhibitor) and shikonin.\nAldara cream containing 5% IMQ was used to topically treat the dorsal skin of each mouse for a total of six consecutive days to induce psoriasis. The psoriasis area and severity index (PASI) scores were recorded every day. On the 7th day, skin tissues were taken for histopathological examination and the content of cytokines in skin were evaluated. The frequency of immune cells in peripheral blood, spleen and skin were detected through flow cytometry.\nCompared to the vehicle control group, the psoriasis symptoms and immune disorder improved significantly in the combination therapy group and deucravacitinib treatment group on the 7th day, and the expressions of p-STAT3 and Ki67 in skin were reduced as well. Moreover, the combined treatment of deucravacitinib and shikonin for psoriasis was superior to the monotherapy group, especially in inhibiting abnormal capillaries proliferation, reducing immune cells infiltration and decreasing the concentration of IL-12p70 in skin.\nThe combination of deucravacitinib and shikonin is a promising clinical application.",
  "pub_date": "2024",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "School of Pharmacy, Nantong University, Nantong, China.",
    "Biomarker Department, Crown Bioscience, Inc, Suzhou, China.",
    "School of Pharmacy, Nantong University, Nantong, China.",
    "Biomarker Department, Crown Bioscience, Inc, Suzhou, China.",
    "School of Pharmacy, Nantong University, Nantong, China.",
    "Biomarker Department, Crown Bioscience, Inc, Suzhou, China.",
    "Biomarker Department, Crown Bioscience, Inc, Suzhou, China.",
    "School of Pharmacy, Nantong University, Nantong, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38876119/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}