{
  "pmid": "38899421",
  "title": "Comparative efficacy and safety of JAK/TYK2 inhibitors and other oral drugs for moderate-to-severe plaque psoriasis: Systematic review and network meta-analysis.",
  "abstract": "Background Janus kinase (JAK)/tyrosine kinase 2 (TYK2) inhibitors are novel treatments for moderate-to-severe plaque psoriasis. Objective To perform a network meta-analysis to compare the efficacy and safety of TYK2 inhibitors with other oral drugs in moderate-to-severe psoriasis. Methods Eligible randomised clinical trials (RCTs) were identified from public databases (published before November 2, 2023). Random-effect frequentist network meta-analysis was performed with ranking based on the surface under the cumulative ranking curve (SUCRA) of Physician's Global Assessment of \"clear\" or \"almost clear\" (PGA 0/1), 75% reduction from baseline in Psoriasis Area and Severity Index (PASI-75). Results Twenty RCTs containing 7,564 patients with moderate-to-severe psoriasis were included. Deucravacitinib at all dose levels (except for 3 mg every other day) and tofacitinib (10 mg BID) ranked best in achieving PGA 0/1 and PASI-75 at 12- 16 weeks. Tofacitinib (10 mg BID) was considered the most unsafe. Analysis of Ranking according to efficacy and safety showed deucravacitinib (3 mg QD and 3 mg BID) was the best treatment. Analysis of Ranking according to efficacy and safety showed deucravacitinib (3 mg QD and 3 mg BID) was the best treatment. Limitation Insufficiency of eligible data and no long-term follow-up data. Conclusion Deucravacitinib showed superior efficacy and safety for treating moderate-to-severe psoriasis over other included drugs.",
  "pub_date": "2024",
  "publication_types": [
    "Journal Article",
    "Systematic Review",
    "Network Meta-Analysis"
  ],
  "affiliations": [
    "Department of Dermatology and Venerology, Fujian Medical University Union Hospital, Fuzhou, China.",
    "Department of Dermatology and Venerology, Fujian Medical University Union Hospital, Fuzhou, China.",
    "Department of Dermatology and Venerology, Fujian Medical University Union Hospital, Fuzhou, China.",
    "Department of Dermatology and Venerology, Fujian Medical University Union Hospital, Fuzhou, China.",
    "Department of Dermatology and Venerology, Fujian Medical University Union Hospital, Fuzhou, China.",
    "Department of Dermatology and Venerology, Fujian Medical University Union Hospital, Fuzhou, China.",
    "Department of Dermatology and Venerology, Fujian Medical University Union Hospital, Fuzhou, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/38899421/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}