{
  "pmid": "39255968",
  "title": "Exploring the effect of deucravacitinib in patients with palmoplantar pustular psoriasis.",
  "abstract": "Palmoplantar pustular psoriasis (PPPP) is a chronic inflammatory skin disorder characterized by sterile pustules on the palms and soles, significantly impacting patients' quality of life. The pathogenesis of PPPP involves intricate interactions between immune dysregulation, environmental triggers, and genetic predisposition. The treatment of PPPP is challenging, and there is a need for effective and safe treatment options for patients.\nWe evaluated the efficacy and safety of deucravacitinib, a novel oral selective allosteric inhibitor of tyrosine kinase 2 (TYK2), in treating refractory PPPP.\nA retrospective analysis was conducted on five patients treated with deucravacitinib 6 mg/day, with clinical assessments at weeks 0, 4, and 16.\nWhile initial worsening was observed in most patients, three showed improvement by week 16. One patient improved with the addition of methotrexate. Treatment was discontinued in two patients after week 16. Adverse effects were primarily viral and bacterial infections, and no serious adverse events occurred.\nCurrent therapeutic options for PPPP are limited, necessitating exploration of novel treatments. Deucravacitinib's mechanism of action, targeting TYK2, could show promise in PPPP management. However, its efficacy and safety in this specific condition require further investigation through larger, randomized controlled trials.",
  "pub_date": "2024-09-10",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Section for Inflammation Medicine, Department of Dermatology, Allergology and Venereology, University Hospital Schleswig-Holstein (UKSH), Lübeck, Germany.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Section for Inflammation Medicine, Department of Dermatology, Allergology and Venereology, University Hospital Schleswig-Holstein (UKSH), Lübeck, Germany.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39255968/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}