{
  "pmid": "39473371",
  "title": "Dual-Action Psoriasis Therapy: Antiproliferative and Immunomodulatory Effects via Self-Locking Microneedles.",
  "abstract": "Psoriasis is a chronic, immune-mediated disorder characterized by immune regulation disorders and abnormal keratinocyte proliferation. Deucravacitinib (Deu), a selective oral Tyrosine Kinase 2 (TYK2) inhibitor, shows promise in treating psoriasis but may cause systemic side effects and fail to address persistent localized thickened lesions. Herein, a self-locking microneedle (MN) patch with a polyvinyl alcohol (PVA) inner ring loaded with Deu is developed, designed to penetrate the transdermal barriers and dissolve rapidly, downregulating the IL-23/IL-17 pathway and serve as the first line of defense against the spread of skin-originated inflammation. Additionally, Calcipotriol (Cal), a vitamin D derivative, is incorporated into a methacrylated hyaluronic acid (HAMA) backing layer and outer ring that mimics occlusive administration, maintaining localized skin surface retention for prolonged anti-proliferative therapy. The Deu@Cal MN demonstrates satisfactory adhesiveness due to swelling-mediated mechanical interlocking via the outer ring, ensuring targeted drug release at lesion site. Besides its effectiveness in alleviating both skin inflammation and proliferation, it inhibits the differentiation of Th17 cells in the spleen, suggesting potential to reduce systemic inflammation. These findings offer a new therapeutic approach for treating psoriasis and other autoimmune and inflammatory conditions.",
  "pub_date": "2024-10-30",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "China-Japan Friendship Hospital (Institute of Clinical Medical Sciences), Chinese Academy of Medical Sciences & Peking Union Medical College, Beijing, 100029, China.",
    "Department of Dermatology, China-Japan Friendship Hospital, Beijing, 100029, China.",
    "State Key Laboratory of Organic-Inorganic Composites, Beijing University of Chemical Technology, Beijing, 100029, China.",
    "Beijing Laboratory of Biomedical Materials, College of Materials Science and Engineering, Beijing University of Chemical Technology, Beijing, 100029, China.",
    "Department of Dermatology, China-Japan Friendship Hospital, Beijing, 100029, China.",
    "China-Japan Friendship Hospital (Institute of Clinical Medical Sciences), Chinese Academy of Medical Sciences & Peking Union Medical College, Beijing, 100029, China.",
    "Department of Dermatology, China-Japan Friendship Hospital, Beijing, 100029, China.",
    "State Key Laboratory of Organic-Inorganic Composites, Beijing University of Chemical Technology, Beijing, 100029, China.",
    "Beijing Laboratory of Biomedical Materials, College of Materials Science and Engineering, Beijing University of Chemical Technology, Beijing, 100029, China.",
    "State Key Laboratory of Organic-Inorganic Composites, Beijing University of Chemical Technology, Beijing, 100029, China.",
    "Beijing Laboratory of Biomedical Materials, College of Materials Science and Engineering, Beijing University of Chemical Technology, Beijing, 100029, China.",
    "China-Japan Friendship Hospital (Institute of Clinical Medical Sciences), Chinese Academy of Medical Sciences & Peking Union Medical College, Beijing, 100029, China.",
    "Department of Dermatology, China-Japan Friendship Hospital, Beijing, 100029, China."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39473371/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}