{
  "pmid": "39723549",
  "title": "Predictive factors for responders to deucravacitinib treatment in patients with psoriasis.",
  "abstract": "The tyrosine kinase 2 inhibitor deucravacitinib is therapeutically effective for psoriasis. However, predictive factors for high responses to deucravacitinib have not been examined in a real-world clinical study. Our study aimed to identify predictive factors for responders to deucravacitinib. Therefore, a retrospective study was conducted on 74 patients with psoriasis treated with deucravacitinib (6 mg/day) at week 16 of treatment from January 2023 to February 2024. Patients were classified into responders (achievers of a static Physician's Global Assessment [sPGA] of 0 or 1 with ≥2-point improvement from basal sPGA) and non-responders (non-achievers). We compared baseline values of clinical and laboratory indexes between responders and non-responders. Multivariate logistic regression analysis was used to identify variables predicting responders. Forty-one patients (55.4%) were considered as responders at week 16. Multivariate logistic regression analysis revealed that the response to deucravacitinib was associated with higher age (odds ratio [OR] 1.04; 95% confidence interval [CI] 1.01-1.08; p = 0.0222) and lower body mass index (BMI) (OR 0.825; 95% CI 0.713-0.955; p = 0.0101). Higher age and lower BMI may predict a higher response to deucravacitinib (6 mg/day) at week 16 of treatment.",
  "pub_date": "2024-12-26",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Fujimoto Dermatology Clinic, Funabashi, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39723549/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}