{
  "pmid": "39891469",
  "title": "Acneiform Eruption Secondary to Deucravacitinib: A Case Series and Review of the Literature.",
  "abstract": "Acneiform eruptions have been observed and reported in clinical trials for tyrosine kinase 2 (TYK2) inhibitors. However, data on their occurrence in real-world settings remain limited. This case series describes six patients, who developed acneiform eruptions following the initiation of deucravacitinib for chronic plaque psoriasis. Through this case series, we aim to shed further light into the clinical characteristics and potential risk factors for this side effect. Contrary to clinical trial data, we demonstrate high cessation rates of deucravacitinib following the development of acneiform eruption, due to the significant burden on quality of life. We highlight the need to identify risk factors to improve patient selection and allow adequate counselling or prophylactic treatments for these acneiform eruptions.",
  "pub_date": "2025-02-01",
  "publication_types": [
    "Journal Article",
    "Case Reports",
    "Review"
  ],
  "affiliations": [
    "Department of Dermatology, Royal Melbourne Hospital, Parkville, Victoria, Australia.",
    "Department of Dermatology, Royal Melbourne Hospital, Parkville, Victoria, Australia.",
    "Chroma Dermatology, Pigment and Skin of Colour Centre, Melbourne, Victoria, Australia.",
    "Department of Dermatology, Monash Health, Clayton, Victoria, Australia.",
    "Faculty of Medicine, Dentistry and Health Sciences, The University of Melbourne, Melbourne, Victoria, Australia.",
    "Chroma Dermatology, Pigment and Skin of Colour Centre, Melbourne, Victoria, Australia.",
    "Department of Dermatology, Monash Health, Clayton, Victoria, Australia.",
    "Skin Health Institute, Carlton, Victoria, Australia.",
    "Chroma Dermatology, Pigment and Skin of Colour Centre, Melbourne, Victoria, Australia.",
    "Faculty of Medicine, Dentistry and Health Sciences, The University of Melbourne, Melbourne, Victoria, Australia.",
    "Department of Dermatology, Royal Children's Hospital, Parkville, Victoria, Australia."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39891469/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}