{
  "pmid": "39913225",
  "title": "A Review of the Safety and Efficacy of Deucravacitinib for Plaque Psoriasis: An Expert Consensus Panel.",
  "abstract": "Psoriasis is a chronic, inflammatory disease associated with numerous negative physical and psychosocial impacts. Deucravacitinib is a novel, selective TYK2 inhibitor approved by the FDA for the treatment of moderate-to-severe plaque psoriasis in adults. Deucravacitinib has established efficacy and safety through several clinical trials, but many clinicians are unfamiliar with its safety profile given the lack of formal guidelines. Thus, this expert consensus panel aims to provide clinical recommendations on the efficacy, safety, and appropriate laboratory monitoring for deucravacitinib.\nA comprehensive literature search of PubMed, Scopus, and Google Scholar was completed for English-language original research articles on the efficacy and safety of deucravacitinib. A panel of 10 dermatologists with expertise in managing psoriasis reviewed the relevant literature and crafted consensus statements regarding the efficacy, safety, and recommended laboratory monitoring for deucravacitinib. Using a modified Delphi process, each statement received supermajority approval and was assigned a strength of recommendation using the Strength of Recommendation Taxonomy (SORT) criteria.\nThe literature search resulted in 101 articles that met search criteria. After screening the articles for relevance to the discussion topic, 14 articles were selected and distributed to the panelists for review prior to the roundtable discussion. The panel unanimously voted to adopt 6 consensus statements and recommendations, 5 of which were given a strength of \"A,\" 0 were given a strength of \"B,\" and 1 was given a strength of \"C.\"\nDeucravacitinib is an effective treatment for plaque psoriasis that is well-tolerated and has an excellent safety profile. The 6 consensus statements created by the panel provide expert recommendations regarding the efficacy, safety, and appropriate laboratory monitoring for deucravacitinib. The expert panel also concludes that deucravacitinib has a superior safety profile to traditional JAK inhibitors. After reviewing the clinical trials, the panel did not find evidence of a causal role for deucravacitinib in inducing laboratory abnormalities and did not recommend baseline and ongoing laboratory monitoring for patients treated with deucravacitinib. J Drugs Dermatol. 2025;24(2):147-155. doi:10.36849/JDD.8616.",
  "pub_date": "2025-02-01",
  "publication_types": [
    "Journal Article",
    "Review",
    "Consensus Statement"
  ],
  "affiliations": [],
  "url": "https://pubmed.ncbi.nlm.nih.gov/39913225/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}