{
  "pmid": "40176687",
  "title": "Pharmacological Management of Psoriasis: Current Landscape and Future Perspectives.",
  "abstract": "Psoriasis is a relapsing, chronic, and inflammatory disease of the skin. However, its impact goes beyond just pathophysiology and takes a toll on the physical and psychological aspects of the health of the afflicted, lowering the quality of life significantly. It is also a mechanistically complex disease with a substantial immune component. Therefore, ongoing treatment strategies focus on targeting at least one immune component associated with the disease development and progression by employing biological agents like IL-1 inhibitors, IL-23 inhibitors, IL-36 inhibitors, and TNF-α inhibitors. Psoriasis-induced disruptions in cellular signalling pathways have drawn significant attention as novel drug targets. Numerous novel synthetic agents, such as JAK/STAT inhibitors [ruxolitinib, peficitinib], TYK2 inhibitors [zasocitinib, ropsacitinib], RORꝩT inhibitors [cedirogant], A3AR agonists [piclodenoson], and CXCR2 antagonists [vimnerixin] are undergoing extensive clinical trials and have demonstrated beneficial outcomes in multiple phases of these trials. Deucravacitinib, an orally administered TYK2 inhibitor, has recently received FDA approval for the treatment of moderate to severe plaque psoriasis. These synthetic agents hold promise to change the outlook of psoriasis management by modulating specific molecular targets associated with the dysregulated immune response observed in psoriasis. Moreover, these pathways can be exploited to personalize anti-psoriatic therapy, minimize side effects, and maximize therapeutic outcomes. Altogether, the integration of biological agents and synthetic agents can overcome the challenges associated with the management of the repertoire of psoriatic pathophysiology and symptoms.",
  "pub_date": "2025-03-28",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Amity Institute of Pharmacy, Amity University Campus, Sector-125, Noida, 201301, Gautam Buddha Nagar, Uttar Pradesh, India.",
    "College of Pharmacy [Orlando Campus], University of Florida, 6550 Sanger Rd, Orlando, FL 32827, USA.",
    "Amity Institute of Pharmacy, Amity University Campus, Sector-125, Noida, 201301, Gautam Buddha Nagar, Uttar Pradesh, India."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40176687/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}