{
  "pmid": "40445270",
  "title": "Deucravacitinib in Patients with Plaque Psoriasis Who Screened Positive for Psoriatic Arthritis: Improvements in Joint Pain and the Impact of Musculoskeletal Symptoms.",
  "abstract": "For patients with psoriasis, psoriatic arthritis can be a painful comorbid condition that is often undiagnosed. It is therefore essential that more research is done to understand which treatments for psoriasis relieve both dermatologic and joint symptoms. This analysis aimed to compare the effects of deucravacitinib vs. placebo or apremilast on joint pain and the impact of musculoskeletal symptoms at weeks 16 and 24 in patients from the POETYK psoriasis (PSO-1; NCT03624127) and POETYK PSO second (PSO-2; NCT03611751) trials who self-reported joint symptoms.\nDuring screening in each trial, patients with psoriasis who reported musculoskeletal complaints completed the self-administered Psoriatic Arthritis Screening and Evaluation (PASE) questionnaire. Scores of ≥ 47 constituted positive screens (PASE positive). Joint pain and the impact of musculoskeletal symptoms were measured using a visual analog scale (VAS), with higher scores denoting worse disease burden.\nThis pooled analysis included 185 patients who screened as PASE-positive in the combined POETYK PSO-1 and PSO-2 trials. Improvement from baseline was greater in patients treated with deucravacitinib vs. placebo at week 16 for joint pain VAS (- 15.2 vs. - 3.2) and joint disease VAS (- 17.4 vs. - 3.8). Improvements from baseline were also greater for patients treated with deucravacitinib vs. apremilast for joint pain VAS (- 22.8 vs. - 8.6) and joint disease VAS (- 19.6 vs. - 8.8) scores at week 24. Greater proportions of deucravacitinib-treated patients also achieved 30%, 50%, and 70% improvements in joint pain and musculoskeletal symptoms and impact VAS scores at weeks 16 and 24 than those who received placebo or apremilast.\nFindings from this pooled analysis suggest that deucravacitinib may be used in patients with psoriasis to effectively treat both dermatologic and joint symptoms. Graphical abstract available for this article.",
  "pub_date": "2025-05-30",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Department of Medicine, Division of Rheumatic Diseases, UT Southwestern Medical Center, Dallas, TX, USA. Joseph.Merola@UTSouthwestern.edu.",
    "Swedish Medical Center/Providence St. Joseph Health and University of Washington School of Medicine, Seattle, WA, USA.",
    "University of California Los Angeles, Los Angeles, CA, USA.",
    "Stanford University, Palo Alto, CA, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Institute and Comprehensive Center for Inflammation Medicine, University of Lübeck, Lübeck, Germany.",
    "Bristol Myers Squibb, Princeton, NJ, USA.",
    "Icahn School of Medicine at Mount Sinai, New York, NY, USA."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40445270/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}