{
  "pmid": "40475785",
  "title": "Case Report: Effectiveness of deucravacitinib in chronic recurrent multifocal osteomyelitis and concomitant psoriasis.",
  "abstract": "We present the case of a 22-year-old male who was first diagnosed with chronic recurrent multifocal osteomyelitis (CRMO) at the age of 16 years. During treatment with the tumor necrosis factor (TNF)-alpha inhibitor adalimumab, he developed severe palmoplantar psoriasis that affected his quality of life and necessitated discontinuation of the drug despite its efficacy against CRMO. Subsequent treatment with the interleukin (IL)-17a inhibitor secukinumab did not improve the psoriasis and led to a recurrence of the osteomyelitis. Therefore, the TYK-2 inhibitor deucravacitinib, approved in 2023 for the treatment of moderate to severe plaque psoriasis, was initiated. This resulted in clinical and morphological complete and sustained remission of CRMO within 12 weeks and a significant improvement of the psoriasis after six months of treatment with no occurrence of severe adverse events. To our knowledge, this is the first case report demonstrating complete and safe remission of CRMO associated with palmoplantar psoriasis treated with the TYK2 inhibitor deucravacitinib.",
  "pub_date": "2025-05-22",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Venereology and Allergology, University Hospital Würzburg, Würzburg, Germany.",
    "Department of Internal Medicine II, Rheumatology/Clinical Immunology, University Hospital of Würzburg, Würzburg, Germany.",
    "Department of Dermatology, Venereology and Allergology, University Hospital Würzburg, Würzburg, Germany.",
    "Children's Hospital, Section of Pediatric Rheumatology, University of Würzburg, Würzburg, Germany.",
    "Department of Internal Medicine II, Rheumatology/Clinical Immunology, University Hospital of Würzburg, Würzburg, Germany.",
    "Department of Dermatology, Venereology and Allergology, University Hospital Würzburg, Würzburg, Germany."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40475785/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}