{
  "pmid": "40519492",
  "title": "Deucravacitinib Treatment for Psoriasis Complicated by Myelodysplastic Syndrome Without Exacerbation of the Underlying Hematologic Disorder: A Case Report.",
  "abstract": "Psoriasis is a chronic, immune-mediated inflammatory skin disease associated with systemic comorbidities such as cardiovascular disease and autoimmune disorders. Deucravacitinib, a selective oral tyrosine kinase 2 (TYK2) inhibitor, has demonstrated strong efficacy and safety in the treatment of psoriasis. However, its use in patients with hematologic malignancies, such as myelodysplastic syndrome (MDS), has not been thoroughly investigated. We report the case of a 73-year-old man with psoriasis vulgaris complicated by MDS and chronic kidney disease (CKD). The patient had a long-standing history of psoriasis managed with topical therapies but experienced an acute flare, presenting with erythema, scaling, and pustules involving over 40% of the body surface area (Psoriasis Area and Severity Index (PASI) score: 28.8). Given his underlying MDS and the need for a safe therapeutic option, deucravacitinib (6 mg once daily) was initiated. Over eight months of treatment, the patient's skin lesions markedly improved, achieving a PASI 75 response with a final PASI score of 4.6. No adverse effects or signs of MDS progression were observed. Moreover, his anemia remained well controlled without the need for monthly darbepoetin alfa injections. This case highlights the potential of deucravacitinib as a safe and effective treatment option for psoriasis patients with concurrent MDS. Given the emerging understanding of TYK2 as an oncogenic driver in myeloproliferative diseases, further studies are warranted to clarify the therapeutic implications of TYK2 inhibition in this patient population.",
  "pub_date": "2025-05-14",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Tokyo Metropolitan Police Hospital, Tokyo, JPN.",
    "Department of Dermatology, Tokyo Metropolitan Police Hospital, Tokyo, JPN.",
    "Department of Dermatology, Tokyo Metropolitan Police Hospital, Tokyo, JPN."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40519492/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}