{
  "pmid": "40655543",
  "title": "Deucravacitinib Improved Interstitial Pneumonia Along with KL-6 Reduction in a Patient with Psoriasis: A Case Report.",
  "abstract": "This case report describes a patient with psoriasis and interstitial pneumonia (IP) presenting with linear opacities who was treated with deucravacitinib, aiming to highlight the potential role of deucravacitinib in improving IP. Psoriasis is a chronic immune-mediated skin disease involving T helper (Th) 17 cells, often accompanied by systemic comorbidities. Deucravacitinib, a selective oral tyrosine kinase 2 (TYK2) inhibitor targeting interleukin (IL)-23 and type I interferons, has shown strong efficacy and safety in psoriasis treatment. Interstitial pneumonia (IP) is a group of lung diseases characterized by inflammation, fibrosis, and progressive respiratory decline. Cytokines play key roles in its pathogenesis. Emerging evidence suggests that psoriasis has higher risks of IP, possibly due to shared IL-23/IL-17 pathway. The patient showed marked improvement in skin and lung findings, along with KL-6 levels after deucravacitinib treatment. TYK2 mediates downstream signaling of key pro-fibrotic and pro-inflammatory cytokines involved in IP. Therefore, we consider that deucravacitinib may have contributed to the improvement of IP by blocking these signaling pathways, thereby suppressing chronic T cell-driven inflammation and fibrosis. Further accumulation of cases and continued research will be essential in advancing discussions on the clinical utility of TYK2 inhibitors in IP management.",
  "pub_date": "2025-07-08",
  "publication_types": [
    "Case Reports",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Tokyo Metropolitan Police Hospital, Tokyo, Japan.",
    "Department of Dermatology, International University of Health and Welfare Hospital, Tochigi, Japan.",
    "Department of Dermatology, International University of Health and Welfare Hospital, Tochigi, Japan.",
    "Department of Respiratory Medicine, Fujieda Municipal General Hospital, Shizuoka, Japan.",
    "Department of Dermatology, International University of Health and Welfare Narita Hospital, Chiba, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/40655543/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}