{
  "pmid": "41025299",
  "title": "[A real world study on the effectiveness and safety of deu-cravacitinib in the treatment of moderate-to-severe plaque psoriasis in China].",
  "abstract": "To evaluate the effectiveness and safety of deucravacitinib in Chinese patients with moderate-to-severe plaque psoriasis.\nThis retrospective study included 41 patients with moderate-to-severe plaque psoriasis treated with deu-cravacitinib 6 mg once daily for 16 weeks at the First Affiliated Hospital of Wenzhou Medical University between January and September 2024. Effectiveness was assessed by the psoriasis area and severity index (PASI), static physician's global assessment (sPGA), palmoplantar psoriasis area and severity index (PPASI), modified nail psoriasis severity index (mNAPSI), and dermatology life quality index (DLQI) at baseline, 4, 8, 12 and 16 weeks after treatment. Adverse events during treatment were recorded. Laboratory parameters, including complete blood count, liver and kidney function, electrolytes, and lipids, were assessed at baseline, 8, 16 weeks after treatment to evaluate safety. Univariate and multivariate logistic regression analyses were performed to explore factors associated with achieving PASI75 at week 16, using baseline characteristics as independent variables.\nSignificant reductions from baseline in PASI and DLQI scores were observed from week 4 through week 16 (all P<0.01). Overall response rates for PASI75, PASI90, PASI100, sPGA 0 or 1 grade, and DLQI 0 or 1 point increased progressively over the treatment period. 75, 90, and 100 refer to a score reduction of at least 75%, at least 90%, and 100%, respectively, from baseline. Response rates of PASI75, PASI90, PASI100 for the scalp, limbs, and trunk, PPASI75, PPASI90, PPASI100 for palmoplantar lesions, and mNAPSI75, mNAPSI90 for nail lesions increased progressively over time but with different trends. Scalp lesions improved most markedly from week 4, followed by the limbs, whereas improvements in trunk and palmoplantar lesions were relatively slower. Nail lesions responded more slowly, with only 20% of patients achieving marked improve-ment at week 16. Deucravacitinib demonstrated good tolerability and compatibility with concomitant medications. No severe adverse events were reported, indicating a favorable safety profile. Multivariate logistic regression analysis revealed no significant association between the achievement of PASI75 response at week 16 and patient age, body mass index, disease duration, or baseline PASI, sPGA, or DLQI scores (all P>0.05).\nIn this real world study of Chinese patients with moderate-to-severe plaque psoriasis, deucravacitinib demonstrated favorable effectiveness and safety over 16 weeks of treatment.",
  "pub_date": "2025-09-25",
  "publication_types": [
    "English Abstract",
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, the First Affiliated Hospital of Wenzhou Medical University, Wenzhou 325000, Zhejiang Province, China. harveyzy@163.com.",
    "Department of Dermatology, the First Affiliated Hospital of Wenzhou Medical University, Wenzhou 325000, Zhejiang Province, China.",
    "Department of Dermatology, the First Affiliated Hospital of Wenzhou Medical University, Wenzhou 325000, Zhejiang Province, China.",
    "Department of Dermatology, the First Affiliated Hospital of Wenzhou Medical University, Wenzhou 325000, Zhejiang Province, China. 409705470@qq.com."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41025299/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}