{
  "pmid": "41489211",
  "title": "Two-Year Real-World Effectiveness of Deucravacitinib 6 mg in Psoriasis: A Single-Center Analysis Stratified by Body Mass Index or Age in a Japanese Cohort.",
  "abstract": "Real-world data are limited on 2 year effectiveness of tyrosine kinase 2 inhibitor deucravacitinib for psoriasis, especially that stratified by body mass index (BMI) or age. This study is aimed to evaluate 104 week effectiveness of deucravacitinib in patients with psoriasis, stratified by BMI (< 25 versus ≥ 25 kg/m2) or age (< 65 versus ≥ 65 years). We included 127 patients with moderate-to-severe psoriasis who received deucravacitinib 6 mg once daily. Psoriasis area and severity index (PASI) decreased throughout 104 weeks in whole patients. In between-group comparisons, mean percent reduction of PASI did not significantly differ at any time point in either BMI or age stratification. The amount of decreasing PASI and achievement rates of PASI 75, 90, and absolute PASI ≤ 2 through week 16 to 68 were slightly higher in BMI < 25 than in BMI ≥ 25, thereafter inverted order. The achievement rates of PASI 100 or absolute PASI ≤ 1 were higher in BMI < 25 throughout 104 weeks; week 104 PASI 100 or absolute PASI ≤ 1 rates were 16.7% or 54.2% in BMI < 25 while 0% or 40% in BMI ≥ 25, respectively. Percent reduction of PASI and achievement rates of PASI 75 and 90 were slightly higher in age ≥ 65 years than in age < 65 years by week 52, thereafter inverted order. Week 104 achievement rates of PASI 100 or absolute PASI ≤ 1 were 28.6% or 57.1% in age < 65 years while 0% or 46.7% in age ≥ 65 years, respectively. Deucravacitinib reduced PASI throughout 104 weeks in whole patients. Patients with BMI < 25 or age ≥ 65 years might show slightly higher response to deucravacitinib at early time points around 1 year compared to slightly higher response at later time points in those with BMI ≥ 25 or age < 65 years. Patients with BMI ≥ 25 or age ≥ 65 years might have difficulty in keeping PASI 100 through week 104.",
  "pub_date": "2026-01-05",
  "publication_types": [
    "Journal Article"
  ],
  "affiliations": [
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan.",
    "Department of Dermatology, Nippon Medical School, Tokyo, Japan.",
    "Department of Dermatology, Fujimoto Dermatology Clinic, Funabashi, Japan.",
    "Department of Dermatology, Nippon Medical School Chiba Hokusoh Hospital, Inzai, Japan."
  ],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41489211/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}