{
  "pmid": "41642152",
  "title": "INDIVIDUAL ARTICLE: Evidence-Based Synthesis of Deucravacitinib: Long Term Efficacy, Safety, and Practical Use in Moderate-to-Severe Psoriasis.",
  "abstract": "Deucravacitinib, a first-in-class, oral, selective TYK2 inhibitor, has redefined systemic therapy options for moderate-to-severe plaque psoriasis. This review synthesizes published data from the POETYK phase 3 and long-term extension (LTE) studies, together with current research and real-world clinical evidence, to provide clinicians a comprehensive perspective on the agent&rsquo;s long-term efficacy, safety, and clinical utility.\nTo synthesize long-term efficacy and safety data for deucravacitinib and provide practical insights for real-world use.\nWe reviewed published, long-term data for 1,519 patients on deucravacitinib over 5,000 person-years of exposure. Sustained clinical response was observed in the efficacy cohort (n=513), with PASI 75/90/100 responses maintained at 67%, 46%, and 22% at week 256 (mNRI). Nearly half of patients achieved minimal disease impact on daily life (DLQI 0/1). Patient-reported outcomes confirmed durable improvement in symptoms, itch, and quality of life. Deucravacitinib demonstrated a consistent safety profile with no new signals in the available long-term data. Rates of adverse and serious adverse events declined over time; acne, when present, was mild and transient. The agent&rsquo;s selective TYK2 regulatory-domain inhibition distinguishes it mechanistically from broader JAK inhibitors, underpinning its favorable safety and tolerability.\nLong-term evidence affirms deucravacitinib&rsquo;s durable disease control, stable safety, and patient-friendly convenience. With once-daily oral dosing, minimal laboratory monitoring, and efficacy across difficult-to-treat sites, deucravacitinib represents a practical and reliable long-term therapy with oral simplicity for patients with moderate-to-severe plaque psoriasis. J Drugs Dermatol. 2026;25:2(Suppl 1):s3-s10.",
  "pub_date": "2026-02-01",
  "publication_types": [
    "Journal Article",
    "Review"
  ],
  "affiliations": [],
  "url": "https://pubmed.ncbi.nlm.nih.gov/41642152/",
  "snapshot_id": "2026-02-12T14-09-47Z",
  "ingested_at": "2026-02-12T14:09:51.284857+00:00"
}